{"id":"18807","title":[{"value":"Master of Science in Data Science - Align Portland"}],"body":[{"value":"<p>The Align Master of Science in Data Science (Align MSDS) provides a direct path to a master’s degree in data science for people from any background, with no prior experience required. The Align MSDS program delivers a comprehensive foundation for processing, modeling, analyzing, and working with data.<\/p>\r\n","summary":"","format":"basic_html"}],"field_accredidation":[],"field_formatted_title":[{"value":"Data Science Align"}],"field_program_thumbnail":[{"target_id":"2421","alt":"Master of Science in Data Science Align Portland ","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2021-01\/Buildings_HighRes_002%20copy%202_0.jpg"}],"field_unique_features":[{"value":"<ul>\r\n\t<li>This interdisciplinary program between the Khoury College of Computer Sciences and the College of Engineering combines expertise across mathematics, computing, and data engineering.<\/li>\r\n\t<li>This program focuses on the end-to-end data process, allowing participants to collect, visualize, and deploy essential models or predictions.<\/li>\r\n\t<li>Students gain real-world experience through co-ops, internships, and project work.<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_key_requirements":[{"value":"<ul>\r\n\t<li>Statement of purpose that should include career goals and expected outcomes and benefits from the program<\/li>\r\n\t<li>Recent professional resumé listing detailed position responsibilities<\/li>\r\n\t<li>Three confidential letters of recommendation<\/li>\r\n\t<li>Official GRE General Test scores -&nbsp;NOT REQUIRED FOR FALL 2021 and SPRING 2022<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_sv_id":[{"value":"a2j2L000000a3ehQAA"}],"field_visa_eligible":[{"value":"1"}],"field_total_credit_hours":[{"value":"48"}],"field_accredidation_link":[],"field_sidebar":{"type":"entity","entities":[]},"field_banner_id_er":{"type":"eck","entities":[{"field_degree_iped_code":[{"value":"7"}],"field_level_code":[{"value":"GR"}]}]},"field_curriculum":{"entities":[{"id":"18732","title":[{"value":"MS Data Science Align"}],"field_catalog_year":[{"value":"2021"}],"field_level_1_group":{"type":"eck","entities":[{"title":[{"value":"Core Requirements "}],"field_group_type":[{"value":"core"}],"field_group_level_2":{"type":"eck","entities":[{"title":[{"value":"Master of Science in Data Science General Requirements "}],"field_requirements":[{"value":"<h3>Align&nbsp;Bridge Coursework<\/h3>\n\n<p>Students will be required to complete two or more of the following bridge courses to be determined by faculty mentor.<\/p>\n\n<p>A grade of B or higher is required for each course.<\/p>\n\n<h4>Fundamentals&nbsp;<\/h4>\n\n<p>[course_table id=0]<\/p>\n\n<h4>Discrete Structures<\/h4>\n\n<p>[course_table id=1]<\/p>\n\n<h4>Programming for Data Science<\/h4>\n\n<p>[course_table id=2]<\/p>\n\n<h4>Additional Align&nbsp;Coursework<\/h4>\n\n<p>[course_table id=3]<\/p>\n\n<h3>Core Requirements<\/h3>\n\n<p>A cumulative GPA of 3.000 or higher is required in the following core courses:<\/p>\n\n<h4>Algorithms<\/h4>\n\n<p>Complete 4 semester hours from the following:<\/p>\n\n<p>[course_table id=4]<\/p>\n\n<h4>Data Management and Processing<\/h4>\n\n<p>[course_table id=5]<\/p>\n\n<h4>Machine Learning and Data Mining<\/h4>\n\n<p>[course_table id=6]<\/p>\n\n<h4>Presentation and Visualization<\/h4>\n\n<p>[course_table id=7]<\/p>\n\n<h3>Electives*<\/h3>\n\n<p>Complete 12 semester hours from the following:<\/p>\n\n<h4>Khoury College of Computer Sciences<\/h4>\n\n<p>[course_table id=8]<\/p>\n\n<h4>College of Engineering<\/h4>\n\n<p>[course_table id=9]<\/p>\n\n<h4>College of Social Sciences and Humanities<\/h4>\n\n<p>[course_table id=10]<\/p>\n\n<h4>D'Amore-McKim School of Business<\/h4>\n\n<p>[course_table id=11]<\/p>\n\n<h4>College of Science<\/h4>\n\n<p>[course_table id=12]<\/p>\n\n<h4>Bouvé College of Health Sciences<\/h4>\n\n<p>[course_table id=13]<\/p>\n\n<h4>College of Arts, Media, and Design<\/h4>\n\n<p>[course_table id=14]<\/p>\n\n<p>*Note: Students taking electives worth fewer than 4 credits (i.e., Bouvé courses) should enroll for an accompanying data science project course in the same semester to bring the cumulative credits to 4. In order to earn this additional credit, students are expected to work with faculty to design an additional project in line with the curricular aims of their chosen elective and the data science core learning outcomes.<\/p>\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"1471","title":[{"value":"CS 5001 - Intensive Foundations of Computer Science"}],"field_course_code":[{"value":"CS 5001"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces systematic problem solving through programming. Offers students an opportunity to learn how to analyze a problem, how to divide and organize the problem into appropriate components, how to describe the problem in a computer language, how to analyze and understand the behavior of their programs, and how to test that their programs are working correctly. Additionally, introduces a method of program design called object-oriented programming and various ways to organize data, including a discussion of their advantages and disadvantages. To practice the course concepts, students undertake assignments ranging from small, highly specified programming tasks to larger open-ended problems where students design and code their own solutions.","format":null}]},{"id":"1473","title":[{"value":"CS 5003 - Recitation for CS 5001"}],"field_course_code":[{"value":"CS 5003"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"0.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides a small-group discussion format to cover material in CS 5001. <i>Coreq CS 5001.<\/i>","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"1472","title":[{"value":"CS 5002 - Discrete Structures"}],"field_course_code":[{"value":"CS 5002"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the mathematical structures and methods that form the foundation of computer science. Studies structures such as sets, tuples, sequences, lists, trees, and graphs. Discusses functions, relations, ordering, and equivalence relations. Examines inductive and recursive definitions of structures and functions. Covers principles of proof such as truth tables, inductive proof, and basic logic and the counting techniques and arguments needed to estimate the size of sets, the growth of functions, and the space-time complexity of algorithms. Also, discusses data structures such as arrays, stacks, queues, lists, and the algorithms that manipulate them.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"6606","title":[{"value":"DS 5010 - Introduction to Programming for Data Science"}],"field_course_code":[{"value":"DS 5010"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an introductory course on fundamentals of programming and data structures. Covers lists, arrays, trees, hash tables, etc.; program design, programming practices, testing, debugging, maintainability, data collection techniques, and data cleaning and preprocessing. Includes a class project, where students use the concepts covered to collect data from the web, clean and preprocess the data, and make it ready for analysis.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"6607","title":[{"value":"DS 5020 - Introduction to Linear Algebra and Probability for Data Science"}],"field_course_code":[{"value":"DS 5020"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an introductory course on the basics of statistics, probability, and linear algebra. Covers random variables, frequency distributions, measures of central tendency, measures of dispersion, moments of a distribution, discrete and continuous probability distributions, chain rule, Bayes&#8217; rule, correlation theory, basic sampling, matrix operations, trace of a matrix, norms, linear independence and ranks, inverse of a matrix, orthogonal matrices, range and null-space of a matrix, the determinant of a matrix, positive semidefinite matrices, eigenvalues, and eigenvectors.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"1500","title":[{"value":"CS 5800 - Algorithms"}],"field_course_code":[{"value":"CS 5800"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents the mathematical techniques used for the design and analysis of computer algorithms. Focuses on algorithmic design paradigms and techniques for analyzing the correctness, time, and space complexity of algorithms. Topics may include asymptotic notation, recurrences, loop invariants, Hoare triples, sorting and searching, advanced data structures, lower bounds, hashing, greedy algorithms, dynamic programming, graph algorithms, and NP-completeness.","format":null}]},{"id":"2138","title":[{"value":"EECE 7205 - Fundamentals of Computer Engineering"}],"field_course_code":[{"value":"EECE 7205"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces fundamental techniques in computer engineering used throughout the graduate curriculum. Covers basic programming and analysis methods and the formulation and solution of a wide range of computer engineering problems. Also discusses the applications of algorithm analysis and complexity theory to analyzing and solving problems. Emphasizes those fundamental computational problems and related algorithms whose solution can be obtained in polynomial time. For basic computational problems such as sorting, searching, elementary graph algorithms, shortest-paths problems, as well as flow problems in networks, many different algorithms and data structures are described and analyzed, implemented, and compared both from a theoretical and from an experimental point of view.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"6550","title":[{"value":"DS 5110 - Introduction to Data Management and Processing"}],"field_course_code":[{"value":"DS 5110"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces students to the core tasks in data science, including data collection, storage, tidying, transformation, processing, management, and modeling for the purpose of extracting knowledge from raw observations. Programming is a cross-cutting aspect of the course. Offers students an opportunity to gain experience with data science tasks and tools through short assignments. Includes a term project based on real-world data.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"6551","title":[{"value":"DS 5220 - Supervised Machine Learning and Learning Theory"}],"field_course_code":[{"value":"DS 5220"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces supervised machine learning, which is the study and design of algorithms that enable computers\/machines to learn from experience or data, given examples of data with a known outcome of interest. Offers a broad view of models and algorithms for supervised decision making. Discusses the methodological foundations behind the models and the algorithms, as well as issues of practical implementation and use, and techniques for assessing the performance. Includes a term project involving programming and\/or work with real-world data sets. Requires proficiency in a programming language such as Python, R, or MATLAB.","format":null}]},{"id":"6552","title":[{"value":"DS 5230 - Unsupervised Machine Learning and Data Mining"}],"field_course_code":[{"value":"DS 5230"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces unsupervised machine learning and data mining, which is the process of discovering and summarizing patterns from large amounts of data, without examples of data with a known outcome of interest. Offers a broad view of models and algorithms for unsupervised data exploration. Discusses the methodological foundations behind the models and the algorithms, as well as issues of practical implementation and use, and techniques for assessing the performance. Includes a term project involving programming and\/or work with real-life data sets. Requires proficiency in a programming language such as Python, R, or MATLAB.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"10560","title":[{"value":"DS 5500 - Capstone: Applications in Data Science"}],"field_course_code":[{"value":"DS 5500"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers students a capstone opportunity to practice data science skills learned in previous courses and to build a portfolio. Students practice visualization, data wrangling, and machine learning skills by applying them to semester-long term projects on real-world data. Students may either propose their own projects or choose from a selection of industry options. Emphasizes the overall data science process, including identification of the scientific problem, selection of appropriate machine learning methods, and visualization and communication of results. Lectures may include additional topics, including visualization, communication, and data science ethics.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"1480","title":[{"value":"CS 5100 - Foundations of Artificial Intelligence"}],"field_course_code":[{"value":"CS 5100"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the fundamental problems, theories, and algorithms of the artificial intelligence field. Topics include heuristic search and game trees, knowledge representation using predicate calculus, automated deduction and its applications, problem solving and planning, and introduction to machine learning. Required course work includes the creation of working programs that solve problems, reason logically, and\/or improve their own performance using techniques presented in the course. Requires experience in Java programming.","format":null}]},{"id":"10789","title":[{"value":"CS 5180 - Reinforcement Learning and Sequential Decision Making"}],"field_course_code":[{"value":"CS 5180"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces reinforcement learning and the underlying computational frameworks and the Markov decision process framework. Covers a variety of reinforcement learning algorithms, including model-based, model-free, value function, policy gradient, actor-critic, and Monte Carlo methods. Examines commonly used representations including deep learning representations and approaches to partially observable problems. Students are expected to have a working knowledge of probability and linear algebra, to complete programming assignments, and to complete a course project that applies some form of reinforcement learning to a problem of interest.","format":null}]},{"id":"1482","title":[{"value":"CS 5200 - Database Management Systems"}],"field_course_code":[{"value":"CS 5200"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces relational database management systems as a class of software systems. Prepares students to be sophisticated users of database management systems. Covers design theory, query language, and performance\/tuning issues. Topics include relational algebra, SQL, stored procedures, user-defined functions, cursors, embedded SQL programs, client-server interfaces, entity-relationship diagrams, normalization, B-trees, concurrency, transactions, database security, constraints, object-relational DBMSs, and specialized engines such as spatial, text, XML conversion, and time series. Includes exercises using a commercial relational or object-relational database management system.","format":null}]},{"id":"1488","title":[{"value":"CS 5340 - Computer\/Human Interaction"}],"field_course_code":[{"value":"CS 5340"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers the principles of human-computer interaction and the design and evaluation of user interfaces. Topics include an overview of human information processing subsystems (perception, memory, attention, and problem solving); how the properties of these systems affect the design of user interfaces; the principles, guidelines, and specification languages for designing good user interfaces, with emphasis on tool kits and libraries of standard graphical user interface objects; and a variety of interface evaluation methodologies that can be used to measure the usability of software. Other topics may include World Wide Web design principles and tools, computer-supported cooperative work, multimodal and “next generation” interfaces, speech and natural language interfaces, and virtual reality interfaces. Course work includes both the creation and implementation of original user interface designs, and the evaluation of user interfaces created by others. Requires knowledge of C programming language\/UNIX.\n","format":null}]},{"id":"1494","title":[{"value":"CS 5610 - Web Development"}],"field_course_code":[{"value":"CS 5610"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Discusses Web development for sites that are dynamic, data driven, and interactive. Focuses on the software development issues of integrating multiple languages, assorted data technologies, and Web interaction. Considers ASP.NET, C#, HTTP, HTML, CSS, XML, XSLT, JavaScript, AJAX, RSS\/Atom, SQL, and Web services. Each student must deploy individually designed Web experiments that illustrate the Web technologies and at least one major integrative Web site project. Students may work in teams with the permission of the instructor. Each student or team must also create extensive documentation of their goals, plans, design decisions, accomplishments, and user guidelines. All source files must be open and be automatically served by a sources server.","format":null}]},{"id":"1506","title":[{"value":"CS 6120 - Natural Language Processing"}],"field_course_code":[{"value":"CS 6120"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides an introduction to the computational modeling of human language, the ongoing effort to create computer programs that can communicate with people in natural language, and current applications of the natural language field, such as automated document classification, intelligent query processing, and information extraction. Topics include computational models of grammar and automatic parsing, statistical language models and the analysis of large text corpuses, natural language semantics and programs that understand language, models of discourse structure, and language use by intelligent agents. Course work includes formal and mathematical analysis of language models, and implementation of working programs that analyze and interpret natural language text.","format":null}]},{"id":"1509","title":[{"value":"CS 6200 - Information Retrieval"}],"field_course_code":[{"value":"CS 6200"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides an introduction to information retrieval systems and different approaches to information retrieval. Topics covered include evaluation of information retrieval systems; retrieval, language, and indexing models; file organization; compression; relevance feedback; clustering; distributed retrieval and metasearch; probabilistic approaches to information retrieval; Web retrieval; filtering, collaborative filtering, and recommendation systems; cross-language IR; multimedia IR; and machine learning for information retrieval.","format":null}]},{"id":"1511","title":[{"value":"CS 6240 - Large-Scale Parallel Data Processing"}],"field_course_code":[{"value":"CS 6240"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers big-data analysis techniques that scale out with increasing number of compute nodes, e.g., for cloud computing. Emphasizes approaches for problem and data partitioning that distribute work effectively, while keeping total cost for computation and data transfer low. Studies and analyzes deterministic and random algorithms from a variety of domains, including graphs, data mining, linear algebra, and information retrieval in terms of their cost, scalability, and robustness against skew. Course work emphasizes hands-on programming experience with modern state-of-the-art big-data processing technology. Students who do not meet course prerequisites may seek permission of instructor.","format":null}]},{"id":"1513","title":[{"value":"CS 6350 - Empirical Research Methods"}],"field_course_code":[{"value":"CS 6350"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents an overview of methods for conducting empirical research within computer science. These methods help provide objective answers to questions about the usability, effectiveness, and acceptability of systems. The course covers the basics of the scientific method, building from a survey of objective measures to the fundamentals of hypothesis testing using relatively simple research designs, and on to more advanced research designs and statistical methods. The course also includes a significant amount of fieldwork, spanning the design, conduct, and presentation of small empirical studies.","format":null}]},{"id":"10484","title":[{"value":"CS 6620 - Fundamentals of Cloud Computing"}],"field_course_code":[{"value":"CS 6620"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers fundamentals of cloud computing, including virtualization and containers, distributed file systems and object stores, infrastructure as a service platforms, open source cloud platforms, key big data platforms, and topics in data center scale systems. Combines classroom material delivered via lectures, readings from literature, student presentations, and a semester-long software project.","format":null}]},{"id":"1539","title":[{"value":"CS 7180 - Special Topics in Artificial Intelligence"}],"field_course_code":[{"value":"CS 7180"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers various topics on artificial intelligence. May be repeated up to two times.","format":null}]},{"id":"11223","title":[{"value":"DS 7990 - Thesis"}],"field_course_code":[{"value":"DS 7990"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers selected work with the agreement of a project supervisor.","format":null}]},{"id":"10469","title":[{"value":"DS 7995 - Project"}],"field_course_code":[{"value":"DS 7995"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"1.00"}],"field_credit_high":[{"value":"4.00"}],"field_credit_connector":[{"value":"TO"}],"field_description":[{"value":"Offers students an opportunity to participate in a direct data science project under the supervision of a faculty member. May be repeated once for a total of 8 credits.","format":null}]},{"id":"1541","title":[{"value":"CS 7280 - Special Topics in Database Management"}],"field_course_code":[{"value":"CS 7280"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers various topics. Possible areas include object-oriented database systems and distributed database systems. May be repeated up to two times.","format":null}]},{"id":"6605","title":[{"value":"CS 7290 - Special Topics in Data Science"}],"field_course_code":[{"value":"CS 7290"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers special topics in data science, including machine learning, statistics, data mining, parallel and distributed data analysis, database systems, information retrieval, knowledge representation, information visualization, natural language processing, computational biology and bioinformatics, computational social science, digital humanities, health informatics, business, and predictive analytics. May be repeated once for up to 8 total credits.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"1168","title":[{"value":"CIVE 7100 - Time Series and Geospatial Data Sciences"}],"field_course_code":[{"value":"CIVE 7100"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an interdisciplinary course covering the fundamentals of time series and spatial statistics with applications in engineering, science, and business. Introduces analysis and forecasting methods for time series, spatial, and spatiotemporal data. Discusses classical time or frequency domain methods, as well as recent techniques motivated from computer science, physics, statistics, or engineering. Case studies relate to ongoing research and to real-world examples. A demo project is selected by the instructor based on discussion with individual students. A computer-based final project can be tailored to student interests in environmental engineering, sustainability sciences, security threat assessments, social sciences, business, or management science and finance. Requires undergraduate probability and statistics (CIVE 3464 or equivalent); background in programming languages such as MATLAB or R helpful but not required.","format":null}]},{"id":"1197","title":[{"value":"CIVE 7388 - Special Topics in Civil Engineering"}],"field_course_code":[{"value":"CIVE 7388"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offered when the need for a special topic is evident to faculty and students. The course is initiated by the appropriate faculty members and discipline committee and approved by the department. May be repeated without limit.","format":null}]},{"id":"2105","title":[{"value":"EECE 5639 - Computer Vision"}],"field_course_code":[{"value":"EECE 5639"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces topics such as image formation, segmentation, feature extraction, matching, shape recovery, dynamic scene analysis, and object recognition. Computer vision brings together imaging devices, computers, and sophisticated algorithms to solve problems in industrial inspection, autonomous navigation, human-computer interfaces, medicine, image retrieval from databases, realistic computer graphics rendering, document analysis, and remote sensing. The goal of computer vision is to make useful decisions about real physical objects and scenes based on sensed images. Computer vision is an exciting but disorganized field that builds on very diverse disciplines such as image processing, statistics, pattern recognition, control theory, system identification, physics, geometry, computer graphics, and learning theory. Requires good programming experience in Matlab or C++.","format":null}]},{"id":"2106","title":[{"value":"EECE 5640 - High-Performance Computing"}],"field_course_code":[{"value":"EECE 5640"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers accelerating scientific and other applications on computer clusters, many-core processors, and graphical processing units (GPUs). Modern computers take advantage of multiple threads and multiple cores to accelerate scientific and engineering applications. Topics covered include parallel computer architecture, parallel programming models, and theories of computation, as well as models for many-core processing. Highlights implementation of computer arithmetic and how it varies on different computer architectures. Includes an individual project where each student is expected to implement an application, port that application to several different styles of parallelism, and compare the results. Programming is done in variants of the C programming language.","format":null}]},{"id":"2204","title":[{"value":"EECE 7337 - Information Theory"}],"field_course_code":[{"value":"EECE 7337"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Discusses basic properties of entropy and mutual information, Shannon&#8217;s fundamental theorems on data compression and data transmission in the single-user case, binning, and covering lemmas. Topics include rate distortion theory, feedback in one-way channels, Slepian-Wolf coding of correlated information sources, source coding with side information at the receiver, multiple access channel and its capacity region, and the capacity region of the Gaussian multiple access channel. Also covers broadcast channels, superposition coding, and the capacity region of the degraded broadcast channel; performance and comparison of TDMA, FDMA, and CDMA systems from a theoretical point of view; capacity issues for time-varying channels and channels with memory; relation between information theory and statistics; Stein&#8217;s lemma; and large deviation theory.","format":null}]},{"id":"2230","title":[{"value":"EECE 7370 - Advanced Computer Vision"}],"field_course_code":[{"value":"EECE 7370"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers students an opportunity to obtain practical knowledge in computer vision and to develop skills for being a successful researcher in this field. The goal of the field of computer vision is to make useful decisions about real physical objects and scenes based on sensed images. Achieving this goal requires obtaining and using descriptions (models) of the sensors and the world. Computer vision is an exciting field that builds on very diverse disciplines such as image processing, statistics, pattern recognition, control theory and system identification, physics, geometry, computer graphics, and machine learning. Course material includes state-of-the-art in the field, current research trends, and algorithms and their applications, with an emphasis on the mathematical methods used.","format":null}]},{"id":"2239","title":[{"value":"EECE 7397 - Advanced Machine Learning"}],"field_course_code":[{"value":"EECE 7397"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers topics in advanced machine learning. Presents materials in the current machine learning literature. Focuses on graphical models, latent variable models, Bayesian inference, and nonparametric Bayesian methods. Seeks to prepare students to do research in machine learning. Expects students to read conference and journal articles, present these articles, and write an individual research paper. CS 7140 and EECE 7397 are cross-listed.","format":null}]},{"id":"3509","title":[{"value":"IE 7275 - Data Mining in Engineering"}],"field_course_code":[{"value":"IE 7275"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers the theory and applications of data mining in engineering. Reviews fundamentals and key concepts of data mining, discusses important data mining techniques, and presents algorithms for implementing these techniques. Specifically covers data mining techniques for data preprocessing, association rule extraction, classification, prediction, clustering, and complex data exploration. Discusses data mining applications in several areas, including manufacturing, healthcare, medicine, business, and other service sectors. Students who do not meet course prerequisites may seek permission of instructor.","format":null}]},{"id":"3510","title":[{"value":"IE 7280 - Statistical Methods in Engineering"}],"field_course_code":[{"value":"IE 7280"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Discusses statistical models for analysis and prediction of random phenomena. Topics include review of descriptive statistics and hypothesis testing, linear models, both regression and ANOVA. Introduces design of experiments. Covers experiments with single and multiple factors of interest, and considers experiments with high-order experimental restrictions.","format":null}]},{"id":"10599","title":[{"value":"INFO 7370 - Designing Advanced Data Architectures for Business Intelligence"}],"field_course_code":[{"value":"INFO 7370"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[{"value":"0.00"}],"field_credit_connector":[{"value":"creditConnector"}],"field_description":[{"value":"Focuses on designing advanced data architectures supporting structured, unstructured, and semistructured data sources; hybrid integration and data engineering; and analytical uses by casual information consumers, power users,and data scientists. Technologies include databases (relational, columnar, in-memory, and NoSQL); hybrid data, application, and cloud integration; data preparation; data virtualization; descriptive, diagnostic, predictive, and prescriptive analytics; and on-premise and on-cloud deployments. Topics include data structures, data models, data integration workflow and data engineering, data integration, data preparation, and data virtualization.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"1720","title":[{"value":"ECON 5140 - Applied Econometrics"}],"field_course_code":[{"value":"ECON 5140"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an intensive study of econometric techniques applied to cross-section, time-series, and panel data. Applies the fundamentals of econometrics to analyzing structural economic models, forecasting, and policy analysis. Computer applications and an empirical research project are an integral part of the course.","format":null}]},{"id":"5614","title":[{"value":"PPUA 5261 - Dynamic Modeling for Environmental Decision Making"}],"field_course_code":[{"value":"PPUA 5261"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the theory, methods, and tools of dynamic modeling for policy and investment decision making, with special focus on environmental issues. Makes use of state-of-the-art computing methods to translate theory and concepts into executable models and provides extensive hands-on modeling experience. Topics include discounting, intertemporal optimization, dynamic games, and treatment of uncertainty.","format":null}]},{"id":"5615","title":[{"value":"PPUA 5262 - Big Data for Cities"}],"field_course_code":[{"value":"PPUA 5262"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Investigates the city and its spatial, social, and economic dynamics through the lens of data and visual analytics. Utilizes large public datasets to develop knowledge about visual methods for analyzing data and communicating results. Offers students an opportunity to develop a critical understanding of data structures, collection methodologies, and their inherent biases.","format":null}]},{"id":"5616","title":[{"value":"PPUA 5263 - Geographic Information Systems for Urban and Regional Policy"}],"field_course_code":[{"value":"PPUA 5263"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Studies basic skills in spatial analytic methods. Introduces students to some of the urban social scientific and policy questions that have been answered with these methods. Covers introductory concepts and tools in geographic information systems (GIS). Offers students an opportunity to obtain the skills to develop and write an original policy-oriented spatial research project with an urban social science focus.","format":null}]},{"id":"5618","title":[{"value":"PPUA 5266 - Urban Theory and Science"}],"field_course_code":[{"value":"PPUA 5266"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Studies the evolution of urban science, looking at some seminal theories that seeded the field and the subsequent work they inspired, including the methodologies developed to examine them. For over a century, social scientists and policymakers have sought to better understand cities, asking important theoretical questions, such as: What is a neighborhood? How does a city grow? What is a city in the first place? Culminates in an examination of urban science in the digital age, exploring how modern technological trends, including &#8220;big data,&#8221; are posing new questions and offering new ways to answer them.","format":null}]},{"id":"5677","title":[{"value":"PPUA 7237 - Advanced Spatial Analysis of Urban Systems"}],"field_course_code":[{"value":"PPUA 7237"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Builds on skills covered in PPUA 5263. Offers students an opportunity to obtain greater depth in the analysis of urban spatial data focused on several urban systems (including social, built, and natural systems). Focuses on understanding the spatial relationships between various new and large urban datasets relevant to current policy challenges within cities. This is a project-based class.","format":null}]},{"id":"5510","title":[{"value":"POLS 7200 - Perspectives on Social Science Inquiry"}],"field_course_code":[{"value":"POLS 7200"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Explores the philosophy of science and the scientific method as applied to the social sciences and political analysis. Considers individualist perspectives (that is, rational choice), group perspectives (pluralism), structural\/institutional perspectives (class analysis), and postmodern critiques.","format":null}]},{"id":"5511","title":[{"value":"POLS 7201 - Research Design"}],"field_course_code":[{"value":"POLS 7201"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides an overview of research methods and tools used by social scientists including survey research, elite interviews, statistical approaches, case studies, comparative analysis, use of history, and experimental\/nonexperimental design.","format":null}]},{"id":"5512","title":[{"value":"POLS 7202 - Quantitative Techniques"}],"field_course_code":[{"value":"POLS 7202"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Teaches the use of social science quantitative techniques, emphasizing applications of value to public sector analysts and scholars alike. Includes descriptive statistics, hypothesis testing, cross-tabulation, bivariate regression and correlation, and multiple regression. Examines how to generate and interpret statistical analyses through use of SPSS.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"762","title":[{"value":"BUSN 6320 - Business Analytics Fundamentals"}],"field_course_code":[{"value":"BUSN 6320"}],"field_credits":[{"value":"1.00"}],"field_credit_low":[{"value":"1.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the key concepts of data science and data analytics as applied to solving data-centered business problems. Emphasizes principles and methods covering the process from envisioning the problem; applying data science techniques; deploying results; and improving financial performance, strategic management, and operational efficiency. Includes an introduction to data-analytic thinking, application of data science solutions to business problems, and some fundamental data science tools for data analysis.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"5352","title":[{"value":"PHYS 5116 - Complex Networks and Applications"}],"field_course_code":[{"value":"PHYS 5116"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces network science and the set of analytical, numerical, and modeling tools used to understand complex networks emerging in nature and technology. Focuses on the empirical study of real networks, with examples coming from biology (metabolic, protein interaction networks), computer science (World Wide Web, Internet), or social systems (e-mail, friendship networks). Shows the organizing principles that govern the emergence of networks and the set of tools necessary to characterize and model them. Covers elements of graph theory, statistical physics, biology, and social science as they pertain to the understanding of complex systems.","format":null}]},{"id":"5372","title":[{"value":"PHYS 7305 - Statistical Physics"}],"field_course_code":[{"value":"PHYS 7305"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Briefly reviews thermodynamics. Topics include the principles of statistical mechanics and statistical thermodynamics; density matrix; theory of ensembles; Fermi-Dirac and Bose-Einstein statistics, application to gases, liquids, and solids; theory of phase transitions; and thermodynamics of electric and magnetic systems, transport phenomena, random walks, and cooperative phenomena.","format":null}]},{"id":"5375","title":[{"value":"PHYS 7321 - Computational Physics"}],"field_course_code":[{"value":"PHYS 7321"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers basic numerical methods for differentiation, integration, and matrix operations used in linear algebra problems, discrete Fourier transforms, and standard and stochastic ordinary and partial differential equations. Specific applications of these methods may include classical chaos, computation of eigenstates of simple quantum systems, classical phase transitions, boundary value problems, pattern formation, and molecular dynamics and classical\/quantum Monte Carlo methods to simulate the equilibrium and nonequilibrium properties of condensed phases.","format":null}]},{"id":"5378","title":[{"value":"PHYS 7331 - Network Science Data"}],"field_course_code":[{"value":"PHYS 7331"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an overview of data mining and analysis and techniques in network science. Introduces students to network data analysis. Presents algorithms for the characterization and measurement of networks (centrality based, decomposition, community analysis, etc.) and issues in sampling and statistical biases. Reviews visualization algorithms and specific software tools. Offers students an opportunity to learn about working with real-world network datasets.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"5278","title":[{"value":"PHTH 5202 - Introduction to Epidemiology"}],"field_course_code":[{"value":"PHTH 5202"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the principles, concepts, and methods of population-based epidemiologic research. Offers students an opportunity to understand and critically review epidemiologic studies. Lectures and discussions aim to serve as a foundation for training in epidemiology, quantitative methods, and population-based health research. The course is a required introductory course for students in the Master of Public Health program and is appropriate for students who are interested in epidemiologic research. Students not meeting course restrictions may seek permission of instructor.","format":null}]},{"id":"5279","title":[{"value":"PHTH 5210 - Biostatistics in Public Health"}],"field_course_code":[{"value":"PHTH 5210"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers public health students an opportunity to obtain the fundamental concepts and methods of biostatistics as applied predominantly to public health problems and the skills to perform basic statistical calculations Emphasizes interpretation and comprehension of concepts. Topics include descriptive statistics, vital statistics, sampling, estimation and significance testing, sample size and power, correlation and regression, spatial and temporal trends, small area analysis, and statistical issues in policy development. Draws examples of statistical methods from the public health practice. Introduces use of computer statistical packages. Requires permission of instructor for students outside designated programs.","format":null}]},{"id":"10892","title":[{"value":"PHTH 6224 - Social Epidemiology"}],"field_course_code":[{"value":"PHTH 6224"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[{"value":"0.00"}],"field_credit_connector":[{"value":"creditConnector"}],"field_description":[{"value":"Focuses on social epidemiology, which is defined as the study of the distribution and determinants of health in populations as related to the social and economic determinants of health. Includes theories, patterns, and controversies, as well as programs and policies that can be applied to address health inequalities. Readings include articles that situate one dimension of social epidemiology with articles addressing the empirical patterns, address prevailing theories and controversies regarding the causes of the inequalities, as well as address interventions or policies that may be applied to address the inequalities.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"2863","title":[{"value":"GSND 5110 - Game Design and Analysis"}],"field_course_code":[{"value":"GSND 5110"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides theoretical background and foundation for analyzing and designing games. Examines fundamental domains that are necessary to understand what games are and how they affect players, including but not limited to interface design, level design, narrative, learning, and culture. Presents relevant concepts and frameworks from a wide variety of disciplines&#8212;psychology, phenomenology, sociology, anthropology, media studies, affect theories, learning theories, and theories of motivation&#8212;for each domain. Explains the core elements of game design, introduces students to formal abstract design tools, explores several models of design process and iteration, and offers students an opportunity to practice game design in groups.","format":null}]},{"id":"2872","title":[{"value":"GSND 6350 - Data-Driven Player Modeling"}],"field_course_code":[{"value":"GSND 6350"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the topic of game analytics, defined as the process of discovering and communicating patterns in data with a goal of solving problems and developing predictions in user behavior supporting decision management, driving action, and\/or improving game products. Covers the fundamental tools, methods, and principles of game analytics, including the knowledge-discovery process, data collection, feature extraction and selection, pattern recognition to aid in prediction and churn analysis, visualization, and reporting. Covers analytics across game forms, notably online games and delivery platforms. Presents analytical tools recommended during development and tools designed for ongoing maintenance of games.","format":null}]}]}}]}}]}}]}}]},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}],"description":[{"value":"","format":null}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}],"description":[{"value":"","format":null}]},{"tid":"4","name":[{"value":"Part-Time"}],"description":[{"value":"","format":null}]}],"nids":["3","4"],"type":"taxonomy"},"field_align_program":{"entities":[{"tid":"9","name":[{"value":"Align Program"}],"description":[{"value":"<p>The Align program offers rigorous academic bridge courses that prepare students for master’s level coursework<\/p>\r\n","format":"basic_html"}]}],"nids":["9"],"type":"taxonomy"},"field_pan":{"entities":[],"nids":[],"type":"taxonomy"},"field_degree_type":{"entities":[{"tid":"38","name":[{"value":"Master's"}],"description":[{"value":"","format":null}]}],"nids":["38"],"type":"taxonomy"},"field_undergrad_degree_type":{"entities":[],"nids":[],"type":"taxonomy"},"field_area_of_study":{"entities":[{"tid":"67","name":[{"value":"Analytics"}],"description":[{"value":"","format":null}],"field_slug":[{"value":"analytics"}]}],"nids":["67"],"type":"taxonomy"},"field_study_options":{"entities":[{"tid":"40","name":[{"value":"Classroom"}],"description":[{"value":"","format":null}]}],"nids":["40"],"type":"taxonomy"},"field_entry_terms":{"entities":[{"tid":"77","name":[{"value":"Fall"}]},{"tid":"78","name":[{"value":"Spring"}]}],"nids":["77","78"],"type":"taxonomy"},"field_program_family":{"type":"entity","entities":[{"title":[{"value":"Data Science"}],"field_college":{"type":"entity","entities":[{"id":"119","title":[{"value":"Khoury College of Computer Sciences"}],"field_experiential_learning":[{"value":"<p>Co-op makes the Northeastern graduate education richer and more meaningful. It provides master’s students with up to 12 months of professional experience that helps them develop the knowledge, awareness, perspective, and confidence to develop rich careers. In addition to the esteemed faculty, many students enroll in the master’s programs largely because of the successful co-op program.<\/p>\r\n\r\n<p>Graduate students typically have an experiential work opportunity following their second semester. This could be a six- to eight-month co-op or a three- to four-month summer internship. Those who initially experience co-op may have the opportunity to seek an internship for the following summer, or vice versa.<\/p>\r\n\r\n<p>Student participation in experiential education provides enhanced:<\/p>\r\n\r\n<ul>\r\n\t<li>Learning, technical expertise, and occupational knowledge<\/li>\r\n\t<li>Confidence, maturity, and self-knowledge<\/li>\r\n\t<li>Job-seeking and job-success skills<\/li>\r\n\t<li>Networking opportunities within your desired career path<\/li>\r\n<\/ul>\r\n\r\n<p>Northeastern’s co-op program is based on a unique educational strategy that recognizes that classroom learning only provides some of the skills students will need to succeed in their professional lives. Our administration, faculty, and staff are dedicated to the university’s mission to “educate students for a life of fulfillment and accomplishment.” Co-op is closely integrated with our course curriculum and our advising system. The team of graduate co-op faculty within the Khoury College of Computer Sciences provides support for students in preparing for and succeeding in their co-ops.<\/p>\r\n\r\n<p>These multiple connections make co-op at Northeastern an avenue to intellectual and personal growth: adding depth to classroom studies, providing exposure to career paths and opportunities, and developing in students a deeper understanding that leads to success in today’s world.<\/p>\r\n","format":"basic_html"}],"field_requirements":[{"value":"<ul>\r\n\t<li>Online application and fee<\/li>\r\n\t<li>Unofficial undergraduate\/graduate transcripts (you can submit official transcripts from all colleges\/universities attended at the time of admission)<\/li>\r\n\t<li>Statement of purpose that should include career goals and expected outcomes and benefits from the program<\/li>\r\n\t<li>Recent professional resumé listing detailed position responsibilities<\/li>\r\n\t<li>Three confidential letters of recommendation<\/li>\r\n\t<li>Official GRE General Test scores<\/li>\r\n\t<li>Official TOEFL examination scores (international students only)<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_college_link":[{"value":"https:\/\/www.khoury.northeastern.edu\/"}]}]},"program":{"entities":[{"id":"5256","title":[{"value":"Master of Science in Data Science"}]},{"id":"18795","title":[{"value":"Master of Science in Data Science - Align Silicon Valley"}]},{"id":"18796","title":[{"value":"Master of Science in Data Science - Silicon Valley "}]},{"id":"18806","title":[{"value":"Master of Science in Data Science - Portland"}]},{"id":"18807","title":[{"value":"Master of Science in Data Science - Align Portland"}]},{"id":"18904","title":[{"value":"Master of Science in Data Science - Align Boston"}]}]}}]},"field_hero_image":[{"target_id":"2420","alt":"","title":"","width":"480","height":"290","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2021-01\/Buildings_HighRes_002%20copy%202%20%281%29_0.jpg"}],"field_hero_video_mp4":[],"field_hero_video_webm":[],"field_overview":[],"field_program_description_long":[{"value":"<p>The Align Master of Science in Data Science (Align MSDS) program’s first two semesters comprises four bridge courses that will prepare students from any undergraduate discipline for graduate-level coursework. The Align MSDS delivers a comprehensive foundation for processing, modeling, analyzing, and working with data.<\/p>\r\n\r\n<p>This program provides research and coursework in artificial intelligence, machine learning, databases, statistics (hypothesis testing), and the theory of language programming. During your time in this program, you will learn to collect data from numerous sources, explore and hypothesize, analyze using machine learning modals, and develop an effective analysis. These important skills, coupled with opportunities for experiential learning, will allow you to chart your own unique career path in this highly competitive and rewarding field.<\/p>\r\n\r\n<p>All Roux Institute programs provide content relevant to the urgent and emerging needs of industry in Maine and the rapidly evolving regional, national, and global economy. Opportunities for experiential learning will be concentrated in Portland, the state of Maine, and the Northeast region. Students are encouraged to pursue co-ops and special virtual Experiential Network projects with the institute’s founding corporate partners, a group of leading employers in Maine.<\/p>\r\n\r\n<hr \/>\r\n<h3>More Details<\/h3>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Unique Features<\/h4>\r\n\r\n<ul>\r\n\t<li>This interdisciplinary program between the Khoury College of Computer Sciences and the College of Engineering combines expertise across mathematics, computing, and data engineering.<\/li>\r\n\t<li>This program focuses on the end-to-end data process, allowing participants to collect, visualize, and deploy essential models or predictions.<\/li>\r\n\t<li>Students gain real-world experience through co-ops, internships, and project work.<\/li>\r\n<\/ul>\r\n<\/div>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Program Objectives<\/h4>\r\n\r\n<p>The objective of this program is to provide a well-rounded educational experience that delivers a comprehensive foundation on all areas related to data collection, hypothesis, analysis, and reporting.<\/p>\r\n<\/div>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Career Outlook<\/h4>\r\n\r\n<p>Graduates from this program go on to a range of careers, including&nbsp;data scientist, data analyst, quantitative researcher, machine learning engineer, natural language processing\/OCR engineer. There is demand for data science specialists in every industry. The U.S. Bureau of Labor Statistics reports that the demand for data science skills will drive a 28 percent rise in employment in the field through 2026.<\/p>\r\n<\/div>\r\n","format":"basic_html"}],"field_requirements":[],"field_requirements_append":[{"value":"1"}],"field_marketo_form_one":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-1A-1B_MS-DASC-AL.html"}],"field_marketo_form_two":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-1A-1B_MS-DASC-AL-ALL-GRAD-POI-Hidden-1B.html"}],"field_marketo_form_three":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-2_MS-DASC-AL-No-POI-Form-2.html"}],"field_marketo_form_four":[{"value":"https:\/\/pages.northeastern.edu\/GRAD-WEBS-Prog-Page-iFrames-4_MS-DASC-AL-Find-Out-More-Bottom-ALL-GRAD-POI-Hidden.html"}],"field_program_experience":[{"value":"<p>Learning integrated with professional experience is a hallmark of Northeastern and the Roux Institute. Students gain a clear understanding of real-world industry needs in Portland, the state of Maine, and the Northeast—and valued workplace skills like communication and teamwork—through assignments at companies and nonprofit organizations. Students can complete a six-week virtual project relevant to their studies through the university’s Experiential Network (XN) of employers, or even for their own company. Or they can apply for four- and six-month, full-time co-op positions. All opportunities enable students to build their resumés, expand their professional networks, and chart a path to in-demand careers.<\/p>\r\n","format":"basic_html"}],"field_testimonials":{"entities":[{"field_link":[],"field_image":[],"field_quote":[{"value":"Joining the data science program at Northeastern University has been one of the most rewarding decisions that I have made. The program helps you build foundational data science skills and gives you an opportunity to specialize in other domains through its great mix of electives. The faculty brings a great deal of research and industry experience to this program. I would highly recommend this program."}],"field_source":[{"value":"Shantam Gupta, MSDS'18"}]}]},"field_faculty_overview":[],"field_students_overview":[{"value":"<p>Below is a look at where our computing and IT alumni work, the positions they hold, and the skills they bring to their organization.<\/p>\r\n\r\n<div class=\"element-container striped-list\" data-eq-pts=\"small: 300, medium: 500, large: 760\">\r\n<p>&nbsp;<\/p>\r\n\r\n<ul class=\"striped-table columns\">\r\n\t<li>\r\n\t<h4>Where They Work<\/h4>\r\n\r\n\t<ul>\r\n\t\t<li>Dell EMC<\/li>\r\n\t\t<li>IBM<\/li>\r\n\t\t<li>Amazon<\/li>\r\n\t\t<li>Oracle<\/li>\r\n\t\t<li>Microsoft<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n\t<li>\r\n\t<h4>What They Do<\/h4>\r\n\r\n\t<ul>\r\n\t\t<li>Engineering<\/li>\r\n\t\t<li>Information Technology<\/li>\r\n\t\t<li>Business Development<\/li>\r\n\t\t<li>Entrepreneurship<\/li>\r\n\t\t<li>Program and Project Management<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n\t<li>\r\n\t<h4>What They're Skilled At<\/h4>\r\n\r\n\t<ul>\r\n\t\t<li>Java<\/li>\r\n\t\t<li>SQL<\/li>\r\n\t\t<li>Software Development<\/li>\r\n\t\t<li>JavaScript<\/li>\r\n\t\t<li>HTML<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n<\/ul>\r\n<\/div>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Learn more about Northeastern alumni on&nbsp;<a href=\"https:\/\/www.linkedin.com\/school\/northeastern-university\/people\/\">Linkedin<\/a>.<\/p>\r\n","format":"basic_html"}],"field_duration":[{"value":"2-3 years"}],"field_accreditation_abbreviation":[],"field_related_program":{"type":"entity","entities":[]},"field_related_program_2":{"type":"entity","entities":[{"id":"18390","title":[{"value":"Master of Science in Computer Science – Portland"}],"field_formatted_title":[{"value":"Computer Science"}],"field_program_thumbnail":[{"target_id":"2363","alt":"Master of Science in Computer Science Portland","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/MS-in-computer-science-thumb.jpg"}],"field_degree_type":{"entities":[{"tid":"38","name":[{"value":"Master's"}]}],"nids":["38"],"type":"taxonomy"},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}]},{"tid":"4","name":[{"value":"Part-Time"}]}],"nids":["3","4"],"type":"taxonomy"},"field_duration":[{"value":"2-2.5 years"}],"field_study_options":{"entities":[{"tid":"41","name":[{"value":"Hybrid"}]}],"nids":["41"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"}},{"id":"18391","title":[{"value":"Master of Science in Computer Science – Align – Portland"}],"field_formatted_title":[{"value":"Computer Science-Align"}],"field_program_thumbnail":[{"target_id":"2365","alt":"Master of Science in Computer Science - Align Portland","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/MSCS-Align-thumb.jpg"}],"field_degree_type":{"entities":[{"tid":"38","name":[{"value":"Master's"}]}],"nids":["38"],"type":"taxonomy"},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}]},{"tid":"4","name":[{"value":"Part-Time"}]}],"nids":["3","4"],"type":"taxonomy"},"field_duration":[{"value":"2.5-3 years"}],"field_study_options":{"entities":[{"tid":"41","name":[{"value":"Hybrid"}]}],"nids":["41"],"type":"taxonomy"},"field_align_program":{"entities":[{"tid":"9","name":[{"value":"Align Program"}],"description":[{"value":"<p>The Align program offers rigorous academic bridge courses that prepare students for master’s level coursework<\/p>\r\n","format":"basic_html"}]}],"nids":["9"],"type":"taxonomy"}}]},"field_finance_tuition_calc":[{"value":"{\"tuitionCalcOption\":\"tuitionPerCreditHours\",\"fields\":{\"costPerCreditHour\":\"1690.00\",\"tuition\":\"79900\",\"creditHours\":\"48\"},\"tuitionCalcValue\":81120,\"tuitionCalcLabel\":\"Tuition\"}"}],"field_hide_tuition_costs":[{"value":"0"}],"field_finance_program_fees":[],"field_finance_aid":[],"field_finance_percent_aid":[],"field_finance_information":[],"field_finance_link":[],"field_finance_link_one_source":[{"value":"global"}],"field_finance_link_one_link":[],"field_finance_link_one_text":[],"field_finance_link_two_source":[{"value":"global"}],"field_finance_link_two_link":[],"field_finance_link_two_text":[],"field_admissions_deadline_source":[{"value":"program"}],"field_admissions_intro_text":[{"value":"<p>Our admissions process operates on a rolling basis; however, we do recommend following the application guidelines below to ensure you can begin during your desired start term.<\/p>\r\n\r\n<p>Please note:&nbsp;This program will begin at the Portland campus starting fall 2021.&nbsp;<\/p>\r\n","format":"basic_html"}],"field_admissions_tables":{"type":"eck","entities":[{"title":[{"value":"Fall 2021"}],"field_table_header_col1":[],"field_table_header_col2":[],"field_admissions_table_rows":{"type":"eck","entities":[{"field_table_row_col1":[{"value":"Deadline for domestic applicants:"}],"field_table_row_col2":[{"value":"August 15, 2021"}]}]}},{"title":[{"value":"Spring 2022"}],"field_table_header_col1":[],"field_table_header_col2":[],"field_admissions_table_rows":{"type":"eck","entities":[{"field_table_row_col1":[{"value":"Deadline for domestic applicants:"}],"field_table_row_col2":[{"value":"December 15, 2021"}]}]}}]},"field_admissions_link_one_source":[{"value":"college"}],"field_admissions_link_one_link":[],"field_admissions_link_one_text":[],"field_admissions_link_two_source":[{"value":"college"}],"field_admissions_link_two_link":[],"field_admissions_link_two_text":[],"field_apply_text":[],"field_apply_link":[],"field_apply_link_source":[{"value":"college"}],"field_admissions_section_intro_text":{"value":"<p>A graduate degree or&nbsp;certificate from Northeastern—a top-50 university—can accelerate your career through rigorous academic coursework and hands-on professional experience in the area of your interest. Apply now—and take your career to the next level.<\/p>\r\n"},"field_admissions_deadlines":{"value":{"intro_text":"<p>Our admissions process operates on a rolling basis; however, we do recommend following the application guidelines below to ensure you can begin during your desired start term.<\/p>\r\n\r\n<p>Please note:&nbsp;This program will begin at the Portland campus starting fall 2021.&nbsp;<\/p>\r\n","tables":[{"title":"Fall 2021","header":[null,null],"rows":[["Deadline for domestic applicants:","August 15, 2021"]]},{"title":"Spring 2022","header":[null,null],"rows":[["Deadline for domestic applicants:","December 15, 2021"]]}]}},"field_admissions_links":{"value":{"one":{"url":"https:\/\/www.northeastern.edu\/graduate\/admissions-information\/how-to-apply\/applying-as-an-international-student\/","title":"Are You an International Student?","text":"Find out what additional documents are required to apply."},"two":{"url":"https:\/\/www.northeastern.edu\/graduate\/why-northeastern\/about-our-academics\/global-engagement\/","title":"Global Engagement","text":"Learn how our teaching and research benefit from a worldwide network of students, faculty, and industry partners."}}},"field_financial_links":{"value":{"one":{"url":"https:\/\/studentfinance.northeastern.edu\/#_ga=2.59552109.19549433.1506949601-148400310.1505504629","title":"Finance Your Education","text":"We offer a variety of resources, including scholarships and assistantships."},"two":{"url":"https:\/\/www.northeastern.edu\/graduate\/admissions-information\/how-to-apply\/the-process\/","title":"How to Apply","text":"Learn more about the application process and requirements."}}},"field_apply_link_transform":{"value":"https:\/\/app.applyyourself.com\/AYApplicantLogin\/fl_ApplicantConnectLogin.asp?id=neu-grad"},"field_requirements_transform":{"value":"<ul>\r\n\t<li>Online application and fee<\/li>\r\n\t<li>Unofficial undergraduate\/graduate transcripts (you can submit official transcripts from all colleges\/universities attended at the time of admission)<\/li>\r\n\t<li>Statement of purpose that should include career goals and expected outcomes and benefits from the program<\/li>\r\n\t<li>Recent professional resumé listing detailed position responsibilities<\/li>\r\n\t<li>Three confidential letters of recommendation<\/li>\r\n\t<li>Official GRE General Test scores<\/li>\r\n\t<li>Official TOEFL examination scores (international students only)<\/li>\r\n<\/ul>\r\n"},"field_key_requirements_transform":{"value":"<ul>\r\n\t<li>Statement of purpose that should include career goals and expected outcomes and benefits from the program<\/li>\r\n\t<li>Recent professional resumé listing detailed position responsibilities<\/li>\r\n\t<li>Three confidential letters of recommendation<\/li>\r\n\t<li>Official GRE General Test scores -&nbsp;NOT REQUIRED FOR FALL 2021 and SPRING 2022<\/li>\r\n<\/ul>\r\n"},"field_experiential_transform":{"value":"<p>Learning integrated with professional experience is a hallmark of Northeastern and the Roux Institute. Students gain a clear understanding of real-world industry needs in Portland, the state of Maine, and the Northeast—and valued workplace skills like communication and teamwork—through assignments at companies and nonprofit organizations. Students can complete a six-week virtual project relevant to their studies through the university’s Experiential Network (XN) of employers, or even for their own company. Or they can apply for four- and six-month, full-time co-op positions. All opportunities enable students to build their resumés, expand their professional networks, and chart a path to in-demand careers.<\/p>\r\n"},"field_finance_blocks":{"value":[{"value":"<span class='bullet-currency'>$<\/span><span class='bullet-value'>81.1<\/span><span class='bullet-units'>K<\/span>","label":"Tuition","modal":"<p dir=\"ltr\"><strong>Estimated Total Tuition<\/strong><\/p>\r\n\r\n<p>This is an estimate based on the tuition rates for Academic Year 2020-2021 and does not include any fees or other expenses. Some courses and labs have tuition rates that may increase or decrease total tuition. Tuition and fees are subject to revision by the president and Board of Trustees at any time. For more detailed information, please visit <a href=\"https:\/\/studentfinance.northeastern.edu\/billing-payments\/tuition-and-fees\/\">Student Financial Services<\/a>.<\/p>\r\n"}]},"field_faculty_section_intro_text":{"value":"<p>Our faculty represents a wide cross-section of professional practices and fields ranging from finance to education to biomedical science to management to the U.S. military. They serve as mentors and advisors and collaborate alongside students to solve the most pressing global challenges facing established and emerging markets.<\/p>\r\n"},"field_student_section_intro_text":{"value":"<p>By enrolling in Northeastern, you gain access to a network of more than 275,000 alumni and 3,350+ employer partners, including Fortune 500 companies, government agencies, and global nongovernmental organizations. Our current students and faculty across strategically located regional locations further foster a lifelong, global community of learning and mentoring.<\/p>\r\n"},"field_curriculum_disclaimer":{"value":"<p>Please note: This curriculum is for marketing purposes only and is subject to change. Official curriculum can be found within the course catalog.<\/p>\r\n"}}