{"id":"18388","title":[{"value":"Graduate Certificate in Cloud Software Development - Portland"}],"body":[{"value":"<p>The Graduate Certificate in Cloud Software Development provides students with a strong foundation for working with cloud computing platforms like Amazon Web Services, Google Cloud, and Microsoft Azure. Through coursework and project-based learning, students gain the specialized skills and practical exposure needed to work across these platforms, as well as in hybrid platform environments.<\/p>\r\n","summary":"","format":"basic_html"}],"field_accredidation":[],"field_formatted_title":[{"value":"Cloud Software Development"}],"field_program_thumbnail":[{"target_id":"2377","alt":"Graduate Certificate in Cloud Software Development Portland","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/Behrakis%20copy%202_1.jpg"}],"field_unique_features":[{"value":"<ul>\r\n\t<li>Program readies students of all backgrounds to immediately pursue a career in cloud computing<\/li>\r\n\t<li>Scholarships are available to cover up to 50% of the tuition cost<\/li>\r\n\t<li>While the certificate is designed as a stand-alone offering, it is stackable into the Master of Science in Computer Science degree<\/li>\r\n\t<li>Through company partnerships, the Khoury College of Computer Sciences will provide career transition support (e.g., resumé reviews, practice technical interviewing, prep for certification exams) to ensure that students are positioned to enter the workforce quickly<\/li>\r\n\t<li>The program is delivered through a hybrid model of online and on-site learning<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_key_requirements":[],"field_sv_id":[{"value":"a2j2L000001Edt9QAC"}],"field_visa_eligible":[{"value":"0"}],"field_total_credit_hours":[{"value":"16"}],"field_accredidation_link":[],"field_sidebar":{"type":"entity","entities":[]},"field_banner_id_er":{"type":"eck","entities":[{"field_degree_iped_code":[{"value":"6"}],"field_level_code":[{"value":"GR"}]}]},"field_curriculum":{"entities":[{"id":"18702","title":[{"value":"Graduate Certificate in Cloud Software Development"}],"field_catalog_year":[{"value":"2021"}],"field_level_1_group":{"type":"eck","entities":[{"title":[{"value":"Graduate Certificate in Cloud Software Development "}],"field_group_type":[{"value":"core"}],"field_group_level_2":{"type":"eck","entities":[{"title":[{"value":"Graduate Certificate in Cloud Software Development General Requirements"}],"field_requirements":[{"value":"<p>[course_table id=0]<\/p>\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"1474","title":[{"value":"CS 5004 - Object-Oriented Design"}],"field_course_code":[{"value":"CS 5004"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents a comparative approach to object-oriented programming and design. Discusses the concepts of object, class, metaclass, message, method, inheritance, and genericity. Reviews forms of polymorphism in object-oriented languages. Contrasts the use of inheritance and composition as dual techniques for software reuse&#8212;forwarding vs. delegation and subclassing vs. subtyping. Offers students an opportunity to obtain a deeper understanding of the principles of object-oriented programming and design, including software components, object-oriented design patterns, and the use of graphical design notations such as UML (unified modeling language). Illustrates basic concepts in object-oriented design with case studies in application frameworks and by writing programs in Java.","format":null}]},{"id":"1494","title":[{"value":"CS 5610 - Web Development"}],"field_course_code":[{"value":"CS 5610"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Discusses Web development for sites that are dynamic, data driven, and interactive. Focuses on the software development issues of integrating multiple languages, assorted data technologies, and Web interaction. Considers ASP.NET, C#, HTTP, HTML, CSS, XML, XSLT, JavaScript, AJAX, RSS\/Atom, SQL, and Web services. Each student must deploy individually designed Web experiments that illustrate the Web technologies and at least one major integrative Web site project. Students may work in teams with the permission of the instructor. Each student or team must also create extensive documentation of their goals, plans, design decisions, accomplishments, and user guidelines. All source files must be open and be automatically served by a sources server.","format":null}]},{"id":"1516","title":[{"value":"CS 6510 - Advanced Software Development"}],"field_course_code":[{"value":"CS 6510"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Designed to integrate academic concepts and practical experience of software design by having students work as part of a programming team, with an option to lead a subteam. Offers students an opportunity to study, in-depth, some aspects of the development process. The goal is to have students participate in a large-scale project, taking time to reflect and analyze the work and the process, rather than concentrating exclusively on the final product. Students who do not meet course prerequisites may seek permission of instructor.","format":null}]},{"id":"10484","title":[{"value":"CS 6620 - Fundamentals of Cloud Computing"}],"field_course_code":[{"value":"CS 6620"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers fundamentals of cloud computing, including virtualization and containers, distributed file systems and object stores, infrastructure as a service platforms, open source cloud platforms, key big data platforms, and topics in data center scale systems. Combines classroom material delivered via lectures, readings from literature, student presentations, and a semester-long software project.","format":null}]}]}}]}}]}}]}}]},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}],"description":[{"value":"","format":null}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}],"description":[{"value":"","format":null}]},{"tid":"4","name":[{"value":"Part-Time"}],"description":[{"value":"","format":null}]}],"nids":["3","4"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"},"field_pan":{"entities":[],"nids":[],"type":"taxonomy"},"field_degree_type":{"entities":[{"tid":"39","name":[{"value":"Certificate"}],"description":[{"value":"","format":null}]}],"nids":["39"],"type":"taxonomy"},"field_undergrad_degree_type":{"entities":[],"nids":[],"type":"taxonomy"},"field_area_of_study":{"entities":[{"tid":"50","name":[{"value":"Computing  and IT"}],"description":[{"value":"","format":null}],"field_slug":[{"value":"computing-it"}]}],"nids":["50"],"type":"taxonomy"},"field_study_options":{"entities":[{"tid":"41","name":[{"value":"Hybrid"}],"description":[{"value":"","format":null}]}],"nids":["41"],"type":"taxonomy"},"field_entry_terms":{"entities":[{"tid":"77","name":[{"value":"Fall"}]},{"tid":"78","name":[{"value":"Spring"}]}],"nids":["77","78"],"type":"taxonomy"},"field_program_family":{"type":"entity","entities":[{"title":[{"value":"Cloud Software Development "}],"field_college":{"type":"entity","entities":[{"id":"119","title":[{"value":"Khoury College of Computer Sciences"}],"field_experiential_learning":[{"value":"<p>Co-op makes the Northeastern graduate education richer and more meaningful. It provides master’s students with up to 12 months of professional experience that helps them develop the knowledge, awareness, perspective, and confidence to develop rich careers. In addition to the esteemed faculty, many students enroll in the master’s programs largely because of the successful co-op program.<\/p>\r\n\r\n<p>Graduate students typically have an experiential work opportunity following their second semester. This could be a six- to eight-month co-op or a three- to four-month summer internship. Those who initially experience co-op may have the opportunity to seek an internship for the following summer, or vice versa.<\/p>\r\n\r\n<p>Student participation in experiential education provides enhanced:<\/p>\r\n\r\n<ul>\r\n\t<li>Learning, technical expertise, and occupational knowledge<\/li>\r\n\t<li>Confidence, maturity, and self-knowledge<\/li>\r\n\t<li>Job-seeking and job-success skills<\/li>\r\n\t<li>Networking opportunities within your desired career path<\/li>\r\n<\/ul>\r\n\r\n<p>Northeastern’s co-op program is based on a unique educational strategy that recognizes that classroom learning only provides some of the skills students will need to succeed in their professional lives. Our administration, faculty, and staff are dedicated to the university’s mission to “educate students for a life of fulfillment and accomplishment.” Co-op is closely integrated with our course curriculum and our advising system. The team of graduate co-op faculty within the Khoury College of Computer Sciences provides support for students in preparing for and succeeding in their co-ops.<\/p>\r\n\r\n<p>These multiple connections make co-op at Northeastern an avenue to intellectual and personal growth: adding depth to classroom studies, providing exposure to career paths and opportunities, and developing in students a deeper understanding that leads to success in today’s world.<\/p>\r\n","format":"basic_html"}],"field_requirements":[{"value":"<ul>\r\n\t<li>Online application and fee<\/li>\r\n\t<li>Unofficial undergraduate\/graduate transcripts (you can submit official transcripts from all colleges\/universities attended at the time of admission)<\/li>\r\n\t<li>Statement of purpose that should include career goals and expected outcomes and benefits from the program<\/li>\r\n\t<li>Recent professional resumé listing detailed position responsibilities<\/li>\r\n\t<li>Three confidential letters of recommendation<\/li>\r\n\t<li>Official GRE General Test scores<\/li>\r\n\t<li>Official TOEFL examination scores (international students only)<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_college_link":[{"value":"https:\/\/www.khoury.northeastern.edu\/"}]}]},"program":{"entities":[{"id":"18350","title":[{"value":"Graduate Certificate in Cloud Software Development - Boston"}]},{"id":"18351","title":[{"value":"Graduate Certificate in Cloud Software Development - Seattle "}]},{"id":"18388","title":[{"value":"Graduate Certificate in Cloud Software Development - Portland"}]}]}}]},"field_hero_image":[{"target_id":"2376","alt":"","title":"","width":"480","height":"290","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/Behrakis%20copy%202%20%281%29_1.jpg"}],"field_hero_video_mp4":[],"field_hero_video_webm":[],"field_overview":[],"field_program_description_long":[{"value":"<p>The Graduate Certificate in Cloud Software Development provides students of all backgrounds with the foundational skills needed to pursue a career in cloud computing. This four-course program, offered by Northeastern's Khoury College of Computer Sciences,&nbsp;emphasizes hands-on, industry-facing experiential learning via the college’s partnerships with leading cloud platform companies like Amazon, Google, and Microsoft and their suppliers. Students gain the technical ability, exposure, and experience to work on any cloud computing platform, as well as the career-building resources to put them on the fast track in this growing field.<\/p>\r\n\r\n<p>All Roux Institute programs provide content relevant to the urgent and emerging needs of industry in Maine and the rapidly evolving regional, national, and global economy. Opportunities for experiential learning will be concentrated in Portland, the state of Maine, and the Northeast region. Students are encouraged to pursue co-ops and special virtual Experiential Network projects with the institute’s founding corporate partners, a group of leading employers in Maine.<\/p>\r\n\r\n<p>We are currently offering a limited number of scholarships, equivalent to one free class for each of the first two semesters (up to $12,500 value). Priority will be given to students with the greatest financial need, but all applicants are eligible to apply.<\/p>\r\n\r\n<hr \/>\r\n<h3>More Details<\/h3>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Unique Features<\/h4>\r\n\r\n<ul>\r\n\t<li>Program readies students of all backgrounds to immediately pursue a career in cloud computing<\/li>\r\n\t<li>Scholarships are available to cover up to 50% of the tuition cost<\/li>\r\n\t<li>While the certificate is designed as a stand-alone offering, it is stackable into the Master of Science in Computer Science degree<\/li>\r\n\t<li>Through company partnerships, the Khoury College of Computer Sciences will provide career transition support (e.g., resumé reviews, practice technical interviewing, prep for certification exams) to ensure that students are positioned to enter the workforce quickly<\/li>\r\n\t<li>The program is delivered through a hybrid model of online and on-site learning<\/li>\r\n<\/ul>\r\n<\/div>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Program Objectives<\/h4>\r\n\r\n<ul>\r\n\t<li>Acquire extensive experience in object-oriented design and development with Java.<\/li>\r\n\t<li>Solve problems using established design patterns, explain strengths and weaknesses of their solutions, and use industry-standard code management, build, and quality assessment tools.<\/li>\r\n\t<li>Design, build, and deploy full-stack applications on cloud platforms.<\/li>\r\n\t<li>Design advanced browser-based interfaces, securely process user requests using cloud-based services in Java\/JavaScript\/Python, and design and utilize cloud SQL\/NoSQL storage solutions.<\/li>\r\n\t<li>Design, develop, and deploy secure cloud applications using appropriate cloud services.<\/li>\r\n\t<li>Analyze cost and engineering trade-offs of using specific application and system architectures, and be able to visualize these using application management platforms.<\/li>\r\n\t<li>Utilize knowledge of distributed systems theory and architecture to build high-performance, scalable, and cost-optimized cloud applications.<\/li>\r\n\t<li>Design and implement application observability to quantitatively enable performance visualization and analysis for system evolution.<\/li>\r\n<\/ul>\r\n<\/div>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Career Outlook<\/h4>\r\n\r\n<p>Students who successfully complete the certificate are ready for a wide range of cloud computing roles, including software development engineers, product managers, solutions architects, support engineers, and system engineers.<\/p>\r\n\r\n<p>The cloud computing market has grown from $15 billion to more than $210 billion in the past 10 years, with projections to double again by 2025. In fact, many IT decision makers believe the only obstacle to even more explosive growth in the field is a shortage of qualified talent to fill roles.<\/p>\r\n<\/div>\r\n","format":"basic_html"}],"field_requirements":[{"value":"<ul>\r\n\t<li>Undergraduate degree with a minimum GPA of 3.0 (PDF or scanned copies of unofficial undergraduate transcripts; you can submit official transcripts from colleges\/universities attended at the time of admission).<\/li>\r\n\t<li>Completion of CS5001, \"Intensive Foundation of Computer Science,\"&nbsp;or&nbsp;equivalent college intro to CS course OR adequate programming experience.<\/li>\r\n\t<li>TOEFL score of at least 100 for international students who have a bachelor's degree from a non-English speaking country (international students only). We are also accepting DuoLingo and IELTS scores at this time.&nbsp;<\/li>\r\n\t<li>Statement of purpose including description of academic or professional goals and relevant work experience.<\/li>\r\n\t<li>A confidential letter of reference from an individual that knows your academic record and\/or potential for graduate study.<\/li>\r\n\t<li>To be considered for a scholarship students must complete the FAFSA<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_requirements_append":[{"value":"0"}],"field_marketo_form_one":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-1A-1B_CERTG-CLSD-Simple-POI-1A.html"}],"field_marketo_form_two":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-1A-1B_CERTG-CLSD-ALL-GRAD-POI-Hidden-1B.html"}],"field_marketo_form_three":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-2_CERTG-CLSD-No-POI-Form-2.html"}],"field_marketo_form_four":[{"value":"https:\/\/pages.northeastern.edu\/GRAD-WEBS-Prog-Page-iFrames-4_CERTG-CLSD-Find-Out-More-Bottom-ALL-GRAD-POI-Hidden.html"}],"field_program_experience":[{"value":"<p>Learning integrated with professional experience is a hallmark of Northeastern and the Roux Institute. Students gain a clear understanding of real-world industry needs in Portland, the state of Maine, and the Northeast—and valued workplace skills like communication and teamwork—through assignments at companies and nonprofit organizations. Students can complete a six-week virtual project relevant to their studies through the university’s <a href=\"https:\/\/careers.northeastern.edu\/experiential-network\/\">Experiential Network (XN)<\/a> of employers, or even for their own company. Or they can apply for four- and six-month, full-time co-op positions. All opportunities enable students to build their resumés, expand their professional networks, and chart a path to in-demand careers.<\/p>\r\n","format":"basic_html"}],"field_testimonials":{"entities":[]},"field_faculty_overview":[],"field_students_overview":[],"field_duration":[{"value":"8-12 months"}],"field_accreditation_abbreviation":[],"field_related_program":{"type":"entity","entities":[]},"field_related_program_2":{"type":"entity","entities":[]},"field_finance_tuition_calc":[{"value":"{\"tuitionCalcOption\":\"costPerProgram\",\"fields\":{\"costPerCreditHour\":\"1600.00\",\"creditHours\":\"16\",\"tuition\":\"26000\"},\"tuitionCalcValue\":26000,\"tuitionCalcLabel\":\"Tuition\"}"}],"field_hide_tuition_costs":[{"value":"0"}],"field_finance_program_fees":[],"field_finance_aid":[],"field_finance_percent_aid":[],"field_finance_information":[],"field_finance_link":[],"field_finance_link_one_source":[{"value":"global"}],"field_finance_link_one_link":[],"field_finance_link_one_text":[],"field_finance_link_two_source":[{"value":"global"}],"field_finance_link_two_link":[],"field_finance_link_two_text":[],"field_admissions_deadline_source":[{"value":"program"}],"field_admissions_intro_text":[],"field_admissions_tables":{"type":"eck","entities":[{"title":[{"value":"Fall 2021"}],"field_table_header_col1":[],"field_table_header_col2":[],"field_admissions_table_rows":{"type":"eck","entities":[{"field_table_row_col1":[{"value":"Deadline for domestic applicants:"}],"field_table_row_col2":[{"value":"August 15, 2021"}]}]}}]},"field_admissions_link_one_source":[{"value":"college"}],"field_admissions_link_one_link":[],"field_admissions_link_one_text":[],"field_admissions_link_two_source":[{"value":"college"}],"field_admissions_link_two_link":[],"field_admissions_link_two_text":[],"field_apply_text":[],"field_apply_link":[],"field_apply_link_source":[{"value":"college"}],"field_admissions_section_intro_text":{"value":"<p>A graduate degree or&nbsp;certificate from Northeastern—a top-50 university—can accelerate your career through rigorous academic coursework and hands-on professional experience in the area of your interest. Apply now—and take your career to the next level.<\/p>\r\n"},"field_admissions_deadlines":{"value":{"intro_text":"","tables":[{"title":"Fall 2021","header":[null,null],"rows":[["Deadline for domestic applicants:","August 15, 2021"]]}]}},"field_admissions_links":{"value":{"one":{"url":"https:\/\/www.northeastern.edu\/graduate\/admissions-information\/how-to-apply\/applying-as-an-international-student\/","title":"Are You an International Student?","text":"Find out what additional documents are required to apply."},"two":{"url":"https:\/\/www.northeastern.edu\/graduate\/why-northeastern\/about-our-academics\/global-engagement\/","title":"Global Engagement","text":"Learn how our teaching and research benefit from a worldwide network of students, faculty, and industry partners."}}},"field_financial_links":{"value":{"one":{"url":"https:\/\/studentfinance.northeastern.edu\/#_ga=2.59552109.19549433.1506949601-148400310.1505504629","title":"Finance Your Education","text":"We offer a variety of resources, including scholarships and assistantships."},"two":{"url":"https:\/\/www.northeastern.edu\/graduate\/admissions-information\/how-to-apply\/the-process\/","title":"How to Apply","text":"Learn more about the application process and requirements."}}},"field_apply_link_transform":{"value":"https:\/\/app.applyyourself.com\/AYApplicantLogin\/fl_ApplicantConnectLogin.asp?id=neu-grad"},"field_requirements_transform":{"value":"<ul>\r\n\t<li>Undergraduate degree with a minimum GPA of 3.0 (PDF or scanned copies of unofficial undergraduate transcripts; you can submit official transcripts from colleges\/universities attended at the time of admission).<\/li>\r\n\t<li>Completion of CS5001, \"Intensive Foundation of Computer Science,\"&nbsp;or&nbsp;equivalent college intro to CS course OR adequate programming experience.<\/li>\r\n\t<li>TOEFL score of at least 100 for international students who have a bachelor's degree from a non-English speaking country (international students only). We are also accepting DuoLingo and IELTS scores at this time.&nbsp;<\/li>\r\n\t<li>Statement of purpose including description of academic or professional goals and relevant work experience.<\/li>\r\n\t<li>A confidential letter of reference from an individual that knows your academic record and\/or potential for graduate study.<\/li>\r\n\t<li>To be considered for a scholarship students must complete the FAFSA<\/li>\r\n<\/ul>\r\n"},"field_key_requirements_transform":{"value":""},"field_experiential_transform":{"value":"<p>Learning integrated with professional experience is a hallmark of Northeastern and the Roux Institute. Students gain a clear understanding of real-world industry needs in Portland, the state of Maine, and the Northeast—and valued workplace skills like communication and teamwork—through assignments at companies and nonprofit organizations. Students can complete a six-week virtual project relevant to their studies through the university’s <a href=\"https:\/\/careers.northeastern.edu\/experiential-network\/\">Experiential Network (XN)<\/a> of employers, or even for their own company. Or they can apply for four- and six-month, full-time co-op positions. All opportunities enable students to build their resumés, expand their professional networks, and chart a path to in-demand careers.<\/p>\r\n"},"field_finance_blocks":{"value":[{"value":"<span class='bullet-currency'>$<\/span><span class='bullet-value'>26<\/span><span class='bullet-units'>K<\/span>","label":"Tuition","modal":"<p dir=\"ltr\"><strong>Estimated Total Tuition<\/strong><\/p>\r\n\r\n<p>This is an estimate based on the tuition rates for Academic Year 2020-2021 and does not include any fees or other expenses. Some courses and labs have tuition rates that may increase or decrease total tuition. Tuition and fees are subject to revision by the president and Board of Trustees at any time. For more detailed information, please visit <a href=\"https:\/\/studentfinance.northeastern.edu\/billing-payments\/tuition-and-fees\/\">Student Financial Services<\/a>.<\/p>\r\n"}]},"field_faculty_section_intro_text":{"value":"<p>Our faculty represents a wide cross-section of professional practices and fields ranging from finance to education to biomedical science to management to the U.S. military. They serve as mentors and advisors and collaborate alongside students to solve the most pressing global challenges facing established and emerging markets.<\/p>\r\n"},"field_student_section_intro_text":{"value":"<p>By enrolling in Northeastern, you gain access to a network of more than 275,000 alumni and 3,350+ employer partners, including Fortune 500 companies, government agencies, and global nongovernmental organizations. Our current students and faculty across strategically located regional locations further foster a lifelong, global community of learning and mentoring.<\/p>\r\n"},"field_curriculum_disclaimer":{"value":"<p>Please note: This curriculum is for marketing purposes only and is subject to change. Official curriculum can be found within the course catalog.<\/p>\r\n"}}