{"id":"18825","title":[{"value":"Master of Professional Studies in Applied Machine Intelligence - Portland"}],"body":[{"value":"<p>If you’re looking for a successful career in applied artificial intelligence and machine learning in the fields of pharmaceuticals\/healthcare, finance, human resources, and business ventures, the MPS in Applied Machine Intelligence program prepares you to excel in these fast-growing and highly in-demand fields—focusing on data, technology, and human literacy.<\/p>\r\n","summary":"","format":"basic_html"}],"field_accredidation":[],"field_formatted_title":[{"value":"Applied Machine Intelligence"}],"field_program_thumbnail":[{"target_id":"2431","alt":"Master of Professional Studies in Applied Machine Intelligence Portland","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2021-03\/Campus_in_Fall_26OCT10_008.jpg"}],"field_unique_features":[{"value":"<ul>\r\n\t<li>Graduate with a portfolio of work samples that demonstrate your range and depth of competencies and skills with machine learning and artificial intelligence.<\/li>\r\n\t<li>Work closely with faculty from different fields and areas of expertise.<\/li>\r\n\t<li>Our experiential AI curriculum includes an introductory core, as well as an advanced core with an end-to-end AI education, with the goal to proactively and thoughtfully prepare students for the evolving technology and the challenges it presents.<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_key_requirements":[{"value":"<ul>\r\n\t<li>Statement of purpose<\/li>\r\n\t<li>Two letters of recommendation<\/li>\r\n\t<li>Unofficial undergraduate transcripts reflecting degrees in engineering, computer technology, or coursework in place of Statistics<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_sv_id":[{"value":"a2j2L000000w8XsQAI"}],"field_visa_eligible":[{"value":"1"}],"field_total_credit_hours":[],"field_accredidation_link":[],"field_sidebar":{"type":"entity","entities":[]},"field_banner_id_er":{"type":"eck","entities":[{"field_degree_iped_code":[{"value":"7"}],"field_level_code":[{"value":"GP"}]}]},"field_curriculum":{"entities":[{"id":"18703","title":[{"value":"Master of Professional Studies in Applied Machine Intelligence "}],"field_catalog_year":[{"value":"2021"}],"field_level_1_group":{"type":"eck","entities":[{"title":[{"value":"Master of Professional Studies in Applied Machine Intelligence General Requirements "}],"field_group_type":[{"value":"core"}],"field_group_level_2":{"type":"eck","entities":[{"title":[{"value":"Core Courses"}],"field_requirements":[{"value":"<p>Note: All students accepted to the MPS in Applied Machine Intelligence will be required to complete a Python Placement Exam upon acceptance. Those who achieve an 85% or greater will start with EAI 6000, those below 85% will have to take a required Python course in their first term that will count towards a required elective.<\/p>\n\n<p>[course_table id=0]&nbsp;<\/p>\n\n<h3>Experiential Network and Capstone<\/h3>\n\n<p>[course_table id=1]&nbsp;<\/p>\n\n<h3>Elective Courses<\/h3>\n\n<p>Complete a minimum of 10 quarter hours from the following to reach 45 quarter hours.<\/p>\n\n<p>[course_table id=2]&nbsp;<\/p>\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"10739","title":[{"value":"EAI 6000 - Fundamentals of Artificial Intelligence"}],"field_course_code":[{"value":"EAI 6000"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the fundamental problems, theories, and algorithms of the artificial intelligence field. Topics include heuristic search and game trees, knowledge representation using predicate calculus, automated deduction and its applications, problem solving and planning, and an introduction to machine learning. Required course work includes the creation of working programs that solve problems, reason logically, and\/or improve their own performance using techniques presented in the course.","format":null}]},{"id":"10740","title":[{"value":"EAI 6010 - Applications of Artificial Intelligence"}],"field_course_code":[{"value":"EAI 6010"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Explores numerous industry applications of AI with emphasis on solving specific needs or problems. Topics include neural networks, natural language processing, and implications of cybersecurity. Artificial Intelligence is actively developing in applications across numerous fields and industries, including finance, healthcare, education, and transportation.","format":null}]},{"id":"226","title":[{"value":"ALY 6110 - Data Management and Big Data"}],"field_course_code":[{"value":"ALY 6110"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Designed to provide the student with the core concepts of data collection and management. Topics include systems for collecting data and implications for practice; types of data (textual, quantitative, qualitative, etc.); and storing data with privacy and security issues in mind. Offers students an opportunity to obtain a high-level understanding of big data technologies for data accessibility, efficiency, and security of data management at scale, including big data storage and computing technologies and big data analytics applications. Students create a working system for data acquisition and management using publicly available data sets and evaluate traditional data warehouse platforms as well as cloud-based big data storage and computing technologies. Azure is also introduced and used in the lab sessions.","format":null}]},{"id":"10742","title":[{"value":"EAI 6030 - Usability and Human Interaction"}],"field_course_code":[{"value":"EAI 6030"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Surveys the theory and practice of human-computer interaction and the development of user interfaces. Through both analysis and design projects, offers students an opportunity to learn cutting-edge approaches to usability research and evaluation, testing methods, and how to design systems that meet end-user needs. Topics covered include behavioral and cognitive foundations of interaction design, principles of good design for interaction, basic user research techniques, and the process of user-centered design.","format":null}]},{"id":"10741","title":[{"value":"EAI 6020 - AI System Technologies"}],"field_course_code":[{"value":"EAI 6020"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents a selection of systems technologies utilized in AI, including data visualization; file systems for a large data mart; applications of structured query language; and filtering and transforming to ingest data, predictions, etc. Covers mathematics\/statistics and computation, machine learning, and privacy requirements.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"3615","title":[{"value":"INT 6940 - Experiential Learning Projects for Professionals"}],"field_course_code":[{"value":"INT 6940"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"1.00"}],"field_credit_high":[{"value":"4.00"}],"field_credit_connector":[{"value":"TO"}],"field_description":[{"value":"Offers students an opportunity to apply knowledge and skills gained through their master&#8217;s program to work on challenging short-term projects under faculty supervision. Students are matched with discipline-specific consulting projects provided by a wide range of sponsoring organizations in the private and nonprofit sectors. Students develop a project plan, conduct research, develop and deliver recommendations to sponsoring organizations, and reflect on lessons learned. Mapping academic course concepts and skills to the consultative process is a primary learning goal. Requires an application process.","format":null}]},{"id":"10748","title":[{"value":"EAI 6980 - Integrated Experiential Capstone"}],"field_course_code":[{"value":"EAI 6980"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers students an opportunity to apply the knowledge, skills, and best practices acquired throughout the Enterprise Artificial Intelligence program in the context of a practicum in the development and delivery of discipline-specific artificial intelligence projects. Students advance a project plan, conduct research, and create and deliver recommendations with the objective to apply artificial intelligence to real-world problems in organizations. Students develop and present the insights and recommendations for successful implementation of the capstone project.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"10540","title":[{"value":"ALY 6140 - Analytics Systems Technology"}],"field_course_code":[{"value":"ALY 6140"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents a selection of analytics systems technologies that are deployed in lab sessions throughout the analytics program. A multitude of analytics systems technologies are used for different purposes to describe data numerically and graphically, for data visualization, file systems (HFS) for a large data mart, applications of structured query language, and filtering and transforming to ingest the data through scripting languages. Some of the tools are taught in greater detail (e.g., Python, machine learning), whereas others are introduced more broadly.","format":null}]},{"id":"931","title":[{"value":"CED 6050 - Commerce and Economic Development"}],"field_course_code":[{"value":"CED 6050"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Explores introductory material in economics, finance, and mathematics relevant for graduate studies. Covers basic concepts of micro- and macroeconomics, statistics, optimization, and market basics.","format":null}]},{"id":"1323","title":[{"value":"CMN 6000 - Introduction to Organizational Communication"}],"field_course_code":[{"value":"CMN 6000"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Considers writing and other forms of communication as a management tool. Addresses how effective writing&#8212;in plain English&#8212;can shape project plans, motivate people, solve problems, and enhance one&#8217;s role as a communicator. Offers students an opportunity to demonstrate their writing and editing skills through research, case study analysis, and composing business-related communications as well as to develop other forms of communication, including oral presentations. As such, the two major goals of this course are to acquaint students with a step-by-step communication methodology and to provide them with an opportunity to develop and polish their writing and communication skills.","format":null}]},{"id":"2819","title":[{"value":"GIS 5201 - Advanced Spatial Analysis"}],"field_course_code":[{"value":"GIS 5201"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides an in-depth evaluation of theoretical, mathematical, and computational foundations of GIS. Topics include spatial information theory, database theory, mathematical models of spatial objects, and GIS-based representation. Examines advanced concepts and techniques in raster-based GIS and high-level GIS modeling techniques.","format":null}]},{"id":"2826","title":[{"value":"GIS 6360 - Spatial Databases"}],"field_course_code":[{"value":"GIS 6360"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers students an opportunity to develop skills in acquiring and building spatial data and maintaining spatial databases. Emphasizes Personal, Workgroup, and Enterprise ArcSDE geodatabases, topology, and versioned editing. Analyzes fundamental theoretical knowledge about information systems and the unique demands created by geographic information. Material includes  data modeling and knowledge representation for spatial data, database schemas and models, and architectural principles for GIS.  Students use database documentation (metadata) and SQL tools to query and update database attributes. Requires a final project to create a complete geodatabase representative of a spatial database used to support a real-world application. Software: ArcGIS Desktop Advanced; ArcSDE\/Microsoft SQL Server enterprise geodatabase; OSQL application to query and create data in a Microsoft SQL Server database.","format":null}]},{"id":"3891","title":[{"value":"LDR 6135 - Ethical Leadership"}],"field_course_code":[{"value":"LDR 6135"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Considers leadership dilemmas that can arise when the individual’s values conflict with those of the organization, or when a situation requires decisions with conflicting value sets. Students use case studies, their own experiences, and current events to examine actions leaders have taken and consequences faced when confronted with ethical dilemmas. Requires work on a real-life ethical dilemma for understanding in-depth reasoning of the problem and developing an action plan for solving and preventing similar problems at the organizational and societal levels. From these exercises and discussions, students have an opportunity to develop a personal model for ethical leadership.","format":null}]},{"id":"5406","title":[{"value":"PJM 6005 - Project Scope Management"}],"field_course_code":[{"value":"PJM 6005"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers insight into how projects are defined, evaluated, and ultimately translated into manageable project requirements and concrete deliverables. By learning how to identify stakeholder needs and convert those needs into viable, measurable project scope documentation, a project manager can successfully manage not only a project&#8217;s scope but also make informed recommendations when trade-offs between project scope, cost, and schedule become necessary.","format":null}]},{"id":"5408","title":[{"value":"PJM 6015 - Project Risk Management"}],"field_course_code":[{"value":"PJM 6015"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Examines quantitative techniques for risk assessment and decision making, as well as the steps and elements of a risk management plan, including the ongoing monitoring of risk factors. The accurate identification of risks, and understanding of how to account for the potential impact of risks, can greatly impact the likelihood of project success.","format":null}]},{"id":"5421","title":[{"value":"PJM 6205 - Leading and Managing Technical Projects"}],"field_course_code":[{"value":"PJM 6205"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers students an opportunity to learn about leadership and management skills and strategies needed to succeed in a demanding technical project environment. Many project managers understand the technical aspects of a particular project environment but lack these critical management and leadership skills. Topics covered include understanding the technical environment, managing and motivating team members, understanding organizational culture, interpersonal strategies, and developing a personal leadership approach.","format":null}]},{"id":"1808","title":[{"value":"EDU 6184 - Interdisciplinary Foundations"}],"field_course_code":[{"value":"EDU 6184"}],"field_credits":[{"value":"2.00"}],"field_credit_low":[{"value":"2.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides orientation through three areas of focus: reflection and self-assessment to inform the course selection process; exposure to a broad vision of the contemporary workplace and the competencies required for career success as individuals, members of organizations, and as global citizens; and development of an individual Professional Learning Plan (PLP). Includes a variety of academic and career-related support systems as students embark on a journey that builds on past experiences while providing opportunities for reflection as they develop goals for the future.","format":null}]}]}}]}}]}},{"title":[{"value":"Concentrations"}],"field_group_type":[{"value":"concentration"}],"field_group_level_2":{"type":"eck","entities":[{"title":[{"value":"AI for Business Ventures"}],"field_requirements":[{"value":"<p>[course_table id=0]&nbsp;<\/p>\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"6522","title":[{"value":"EDU 6558 - Issues in Education"}],"field_course_code":[{"value":"EDU 6558"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"1.00"}],"field_credit_high":[{"value":"4.00"}],"field_credit_connector":[{"value":"TO"}],"field_description":[{"value":"Offers students an opportunity to explore in-depth a current educational issue, long-standing unresolved educational problem, and\/or ways of considering innovation and change in education. The topic alternates each time the course is offered, and students are allowed to enroll each time the focus of the course changes. May be repeated up to 15 times for up to 16 total credits.","format":null}]},{"id":"6525","title":[{"value":"ALY 6040 - Data Mining Applications"}],"field_course_code":[{"value":"ALY 6040"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the theories and tools for intensive data analysis methods and data mining techniques such as rule-based learning, decision trees, clustering, and association-rule mining. Also covers interpretation of the mined patterns using visualization techniques. Offers students an opportunity to gain the knowledge and experience to apply modern data-mining techniques for effective large-scale data pattern recognition and insight discovery. Introduces data analysis software; student teams evaluate, analyze, and report data for the methods used and insights discovered during case studies.","format":null}]},{"id":"3710","title":[{"value":"ITC 6015 - Enterprise Information Architecture"}],"field_course_code":[{"value":"ITC 6015"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the theory, framework\/model, methodology, and tools that enhance business and organizations&#8217; ability to discover, access, and understand data and to integrate IT and information resources, with an ultimate goal to produce information needed to make critical decisions and support business functions. Data and information management is critical to modern businesses. Covers best practices using cases studies in a more practical, comprehensive approach to delivering the subject matter involving the application of tools.","format":null}]},{"id":"10746","title":[{"value":"EAI 6080 - Advanced Analytical Utilization"}],"field_course_code":[{"value":"EAI 6080"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on instrumental methods of data analysis and provides a foundation to the theory and application of modern analytical techniques for artificial intelligence. Explores the importance of instrumental analysis for specific uses of AI within various fields and context applications across numerous professional fields.","format":null}]},{"id":"10747","title":[{"value":"EAI 6120 - AI Communication and Visualization"}],"field_course_code":[{"value":"EAI 6120"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an overview of key informational design concepts, emphasizing the relationship between information and audience in the context of communicating complex quantitative information. Encompasses three main context areas: exploratory data visualization, dashboard and scorecard design, and spatial data representation. Discusses ethical questions related to the communication and visualization of data analytics: storytelling; different techniques (such as R-spatial, GeoDa, GeoWave, GeoTrellis, GeoMesa, graph databases network visualization); and principles for visual design, including privacy requirements.","format":null}]}]}}]}},{"title":[{"value":"AI for Finance "}],"field_requirements":[{"value":"<p>[course_table id=0]<\/p>\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"2709","title":[{"value":"FIN 6101 - Accounting Fundamentals for Financial Institutions"}],"field_course_code":[{"value":"FIN 6101"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Emphasizes managerial and financial accounting concepts as they apply to financial institutions. Analyzes financial statements of a variety of financial institutions with an emphasis on understanding the accounting structure of financial institutions, ratio analysis as it is used to evaluate financial performance, and accounting control systems.","format":null}]},{"id":"6525","title":[{"value":"ALY 6040 - Data Mining Applications"}],"field_course_code":[{"value":"ALY 6040"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the theories and tools for intensive data analysis methods and data mining techniques such as rule-based learning, decision trees, clustering, and association-rule mining. Also covers interpretation of the mined patterns using visualization techniques. Offers students an opportunity to gain the knowledge and experience to apply modern data-mining techniques for effective large-scale data pattern recognition and insight discovery. Introduces data analysis software; student teams evaluate, analyze, and report data for the methods used and insights discovered during case studies.","format":null}]},{"id":"10743","title":[{"value":"EAI 6050 - Finance Information Processing"}],"field_course_code":[{"value":"EAI 6050"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers advanced data management technologies and management systems with a focus on the finance industry. Emphasizes evaluating the advantages and disadvantages of such technologies in different application contexts. Addresses specific application contexts of AI and presents the entity relationship to data management (including network hierarchical and object oriented), with an emphasis on processing, storing, and retrieval, while also including privacy requirements.","format":null}]},{"id":"10746","title":[{"value":"EAI 6080 - Advanced Analytical Utilization"}],"field_course_code":[{"value":"EAI 6080"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on instrumental methods of data analysis and provides a foundation to the theory and application of modern analytical techniques for artificial intelligence. Explores the importance of instrumental analysis for specific uses of AI within various fields and context applications across numerous professional fields.","format":null}]},{"id":"10747","title":[{"value":"EAI 6120 - AI Communication and Visualization"}],"field_course_code":[{"value":"EAI 6120"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an overview of key informational design concepts, emphasizing the relationship between information and audience in the context of communicating complex quantitative information. Encompasses three main context areas: exploratory data visualization, dashboard and scorecard design, and spatial data representation. Discusses ethical questions related to the communication and visualization of data analytics: storytelling; different techniques (such as R-spatial, GeoDa, GeoWave, GeoTrellis, GeoMesa, graph databases network visualization); and principles for visual design, including privacy requirements.","format":null}]}]}}]}},{"title":[{"value":"AI for Healthcare"}],"field_requirements":[{"value":"<p>[course_table id=0]<\/p>\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"10553","title":[{"value":"ALY 6150 - Healthcare\/Pharmaceutical Data and Applications"}],"field_course_code":[{"value":"ALY 6150"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces a selection of healthcare\/pharmaceutical data used for a variety of purposes, and its specific application in data-driven business decision making. Healthcare\/Pharmaceutical data is collected as part of Medicare and Medicaid databases and as mandated by the PPACA (Patient and Affordable Care Act) and the PPSA (Physicians Payment Sunshine Act). Data is available in the form of medical records, social networks, outcomes databases, syndicated data reports, epidemiological data, demographic data, analyst information, R&D Pipeline Database, market data, and online journals and newsletters. Organizations, corporations, and companies use these varieties of data for a host of different reasons - to better profile and segment customers, to answer performance questions, and to identify and capture key opportunities.","format":null}]},{"id":"6525","title":[{"value":"ALY 6040 - Data Mining Applications"}],"field_course_code":[{"value":"ALY 6040"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the theories and tools for intensive data analysis methods and data mining techniques such as rule-based learning, decision trees, clustering, and association-rule mining. Also covers interpretation of the mined patterns using visualization techniques. Offers students an opportunity to gain the knowledge and experience to apply modern data-mining techniques for effective large-scale data pattern recognition and insight discovery. Introduces data analysis software; student teams evaluate, analyze, and report data for the methods used and insights discovered during case studies.","format":null}]},{"id":"10744","title":[{"value":"EAI 6060 - Healthcare Information Processing"}],"field_course_code":[{"value":"EAI 6060"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers advanced data management technologies and management systems with a focus on the healthcare industry. Emphasizes evaluating the advantages and disadvantages of such technologies in different application contexts. Addresses specific application contexts of AI and presents the entity relationship to data management (including network hierarchical and object oriented), with an emphasis on processing, storing, and retrieval, while including privacy requirements.","format":null}]},{"id":"10746","title":[{"value":"EAI 6080 - Advanced Analytical Utilization"}],"field_course_code":[{"value":"EAI 6080"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on instrumental methods of data analysis and provides a foundation to the theory and application of modern analytical techniques for artificial intelligence. Explores the importance of instrumental analysis for specific uses of AI within various fields and context applications across numerous professional fields.","format":null}]},{"id":"10747","title":[{"value":"EAI 6120 - AI Communication and Visualization"}],"field_course_code":[{"value":"EAI 6120"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an overview of key informational design concepts, emphasizing the relationship between information and audience in the context of communicating complex quantitative information. Encompasses three main context areas: exploratory data visualization, dashboard and scorecard design, and spatial data representation. Discusses ethical questions related to the communication and visualization of data analytics: storytelling; different techniques (such as R-spatial, GeoDa, GeoWave, GeoTrellis, GeoMesa, graph databases network visualization); and principles for visual design, including privacy requirements.","format":null}]}]}}]}},{"title":[{"value":"AI for Human Resources"}],"field_requirements":[{"value":"<p>[course_table id=0]&nbsp;<\/p>\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"10505","title":[{"value":"HRM 6025 - Workforce Analytics"}],"field_course_code":[{"value":"HRM 6025"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[{"value":"0.00"}],"field_credit_connector":[{"value":"creditConnector"}],"field_description":[{"value":"Examines the characteristics of high-quality data, key workforce metrics, and introduces common analysis techniques. Human resources management helps drive business performance by delivering competitive advantage through people. This requires a solid grasp of HR analytics: the systematic collection, analysis, and interpretation of data designed to improve decisions about talent and the organization as a whole.","format":null}]},{"id":"6525","title":[{"value":"ALY 6040 - Data Mining Applications"}],"field_course_code":[{"value":"ALY 6040"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the theories and tools for intensive data analysis methods and data mining techniques such as rule-based learning, decision trees, clustering, and association-rule mining. Also covers interpretation of the mined patterns using visualization techniques. Offers students an opportunity to gain the knowledge and experience to apply modern data-mining techniques for effective large-scale data pattern recognition and insight discovery. Introduces data analysis software; student teams evaluate, analyze, and report data for the methods used and insights discovered during case studies.","format":null}]},{"id":"10745","title":[{"value":"EAI 6070 - Human Resources Information Processing"}],"field_course_code":[{"value":"EAI 6070"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers advanced data management technologies and management systems with a focus on human resources. Emphasizes evaluating the advantages and disadvantages of such technologies in different application contexts. Addresses specific application contexts of AI and presents the entity relationship to data management (including network hierarchical and object oriented), with an emphasis on processing, storing, and retrieval, while including privacy requirements.","format":null}]},{"id":"10746","title":[{"value":"EAI 6080 - Advanced Analytical Utilization"}],"field_course_code":[{"value":"EAI 6080"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on instrumental methods of data analysis and provides a foundation to the theory and application of modern analytical techniques for artificial intelligence. Explores the importance of instrumental analysis for specific uses of AI within various fields and context applications across numerous professional fields.","format":null}]},{"id":"10747","title":[{"value":"EAI 6120 - AI Communication and Visualization"}],"field_course_code":[{"value":"EAI 6120"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an overview of key informational design concepts, emphasizing the relationship between information and audience in the context of communicating complex quantitative information. Encompasses three main context areas: exploratory data visualization, dashboard and scorecard design, and spatial data representation. Discusses ethical questions related to the communication and visualization of data analytics: storytelling; different techniques (such as R-spatial, GeoDa, GeoWave, GeoTrellis, GeoMesa, graph databases network visualization); and principles for visual design, including privacy requirements.","format":null}]}]}}]}}]}}]}}]},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}],"description":[{"value":"","format":null}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}],"description":[{"value":"","format":null}]},{"tid":"4","name":[{"value":"Part-Time"}],"description":[{"value":"","format":null}]}],"nids":["3","4"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"},"field_pan":{"entities":[],"nids":[],"type":"taxonomy"},"field_degree_type":{"entities":[{"tid":"38","name":[{"value":"Master's"}],"description":[{"value":"","format":null}]}],"nids":["38"],"type":"taxonomy"},"field_undergrad_degree_type":{"entities":[],"nids":[],"type":"taxonomy"},"field_area_of_study":{"entities":[{"tid":"67","name":[{"value":"Analytics"}],"description":[{"value":"","format":null}],"field_slug":[{"value":"analytics"}]}],"nids":["67"],"type":"taxonomy"},"field_study_options":{"entities":[{"tid":"41","name":[{"value":"Hybrid"}],"description":[{"value":"","format":null}]}],"nids":["41"],"type":"taxonomy"},"field_entry_terms":{"entities":[{"tid":"77","name":[{"value":"Fall"}]},{"tid":"78","name":[{"value":"Spring"}]},{"tid":"79","name":[{"value":"Summer"}]}],"nids":["77","78","79"],"type":"taxonomy"},"field_program_family":{"type":"entity","entities":[{"title":[{"value":"Applied Machine Intelligence"}],"field_college":{"type":"entity","entities":[{"id":"121","title":[{"value":"College of Professional Studies"}],"field_experiential_learning":[{"value":"<p>Northeastern's signature experience-powered learning model has been at the heart of the university for more than a century. It combines world-class academics with professional practice, allowing you to acquire relevant, real-world skills you can immediately put into action in your current workplace. This makes a Northeastern education a dynamic, transformative experience, giving you countless opportunities to grow as a professional and person.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n","format":"basic_html"}],"field_requirements":[{"value":"<ul>\r\n\t<li>Online application<\/li>\r\n\t<li>Statement of purpose (500–1000 words): Identify your educational goals and expectations of the program. Please be aware that Northeastern University's academic policy on plagiarism applies to your statement of purpose.<\/li>\r\n\t<li>Professional resumé<\/li>\r\n\t<li>Unofficial undergraduate transcripts; official transcripts required at the time of admission<\/li>\r\n\t<li>Two letters of recommendation from individuals who have either academic or professional knowledge of your capabilities such as a faculty member, colleague, or mentor, preferably one from your current employer<\/li>\r\n\t<li>English language proficiency proof. Students for whom English is not their primary language must submit one of the following:\r\n\t<ul>\r\n\t\t<li>Official associate or bachelor's degree transcript from an accredited college or university in the U.S., stating degree conferral and date<\/li>\r\n\t\t<li>TOEFL, IELTS, PTE, Duolingo, or NU Global Exam scores<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_college_link":[{"value":"https:\/\/cps.northeastern.edu\/"}]}]},"program":{"entities":[{"id":"18358","title":[{"value":"Master of Professional Studies in Applied Machine Intelligence - Boston"}]},{"id":"18381","title":[{"value":"Master of Professional Studies in Applied Machine Intelligence - Online "}]},{"id":"18825","title":[{"value":"Master of Professional Studies in Applied Machine Intelligence - Portland"}]}]}}]},"field_hero_image":[{"target_id":"2430","alt":"","title":"","width":"480","height":"290","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2021-03\/Campus_in_Fall_26OCT10_008%20%281%29.jpg"}],"field_hero_video_mp4":[],"field_hero_video_webm":[],"field_overview":[],"field_program_description_long":[{"value":"<p>In this program, you’ll take a multi-disciplinary approach to learning, creating well-rounded and sought-after innovators primed to utilize data and AI to inform domain-specific business decisions. Combining the disciplines of applied machine learning and artificial intelligence, data management, data analysis, and data visualization, a Master of Professional Studies in Applied Machine Intelligence teaches you to solve business problems within the rapidly growing field of artificial intelligence.<\/p>\r\n\r\n<p>The diverse concentrations of healthcare, finance, human resources, and business ventures are a direct reflection of the AI value potential in these categories. Our program empowers students to apply AI models and algorithms to a chosen industry and focuses on the interpretation, operationalization, contextualization, and implementation of AI.<\/p>\r\n\r\n<p>With a modular curriculum, you can easily customize your learning activities and experiences across multiple contexts both online and on-ground. Plus, you can earn your degree in less than two years.<\/p>\r\n\r\n<p>All Roux Institute programs provide content relevant to the urgent and emerging needs of industry in Maine and the rapidly evolving regional, national, and global economy. Opportunities for experiential learning will be concentrated in Portland, the state of Maine, and the Northeast region. Students are encouraged to pursue co-ops and special virtual Experiential Network projects with the institute’s founding corporate partners, a group of leading employers in Maine.<\/p>\r\n\r\n<hr \/>\r\n<h3>More Details<\/h3>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Unique Features<\/h4>\r\n\r\n<ul>\r\n\t<li>Graduate with a portfolio of work samples that demonstrate your range and depth of competencies and skills with machine learning and artificial intelligence.<\/li>\r\n\t<li>Work closely with faculty from different fields and areas of expertise.<\/li>\r\n\t<li>Our experiential AI curriculum includes an introductory core, as well as an advanced core with an end-to-end AI education, with the goal to proactively and thoughtfully prepare students for the evolving technology and the challenges it presents.<\/li>\r\n<\/ul>\r\n<\/div>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Career Outlook<\/h4>\r\n\r\n<p>According to Gartner, an estimated 2.3 million AI jobs will be created by 2020. Now’s the time to prepare yourself for a changing industry by building desirable skills and experience with an MPS in Applied Machine Intelligence.<\/p>\r\n<\/div>\r\n","format":"basic_html"}],"field_requirements":[{"value":"<ul>\r\n\t<li>Online application<\/li>\r\n\t<li>Statement of purpose (500–1000 words): identifies your educational goals and expectations of the program<\/li>\r\n\t<li>Unofficial undergraduate transcripts (Official transcripts required at the time of admission) Reflecting degrees in engineering, computer technology, or coursework in place of Statistics.<\/li>\r\n\t<li>Two letters of recommendation: from individuals who have either academic or professional knowledge of your capabilities such as a faculty member, colleague, or mentor, preferably one from your current employer<\/li>\r\n\t<li>English Language Proficiency Proof: students for whom English is not their primary language must submit one of the following:\r\n\t<ul>\r\n\t\t<li>Official bachelor's degree transcript from an accredited college or university in the U.S, stating degree conferral and date<\/li>\r\n\t\t<li>TOEFL, IELTS, or NU Global Exam scores<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n<\/ul>\r\n\r\n<p>All students accepted to the MPS in Applied Machine Intelligence will be required to complete a Python Placement Exam upon acceptance. Those who achieve an 85% or greater will start with AI 6000 and those 84% and below will have to take a required Python course in their first term that will count towards a required elective.<\/p>\r\n","format":"basic_html"}],"field_requirements_append":[{"value":"0"}],"field_marketo_form_one":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-1A-1B_P-MPS-APMI-Simple-POI-IA.html"}],"field_marketo_form_two":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-1A-1B_P-MPS-APMI-ALL-GRAD-POI-Hidden-1B.html"}],"field_marketo_form_three":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-2_P-MPS-APMI-No-POI-Form-2.html"}],"field_marketo_form_four":[{"value":"https:\/\/pages.northeastern.edu\/GRAD-WEBS-Prog-Page-iFrames-4_P-MPS-APMI-Find-Out-More-Bottom-ALL-GRAD-POI-Hidden.html"}],"field_program_experience":[{"value":"<p>Learning integrated with professional experience is a hallmark of Northeastern and the Roux Institute. Students gain a clear understanding of real-world industry needs in Portland, the state of Maine, and the Northeast—and valued workplace skills like communication and teamwork—through assignments at companies and nonprofit organizations. Students can complete a six-week virtual project relevant to their studies through the university’s Experiential Network (XN) of employers, or even for their own company. Or they can apply for four- and six-month, full-time co-op positions. All opportunities enable students to build their resumés, expand their professional networks, and chart a path to in-demand careers.<\/p>\r\n","format":"basic_html"}],"field_testimonials":{"entities":[]},"field_faculty_overview":[],"field_students_overview":[{"value":"<p>Below is a look at where our Analytics alumni work, the positions they hold, and the skills they bring to their organization.<\/p>\r\n\r\n<div class=\"element-container striped-list\" data-eq-pts=\"small: 300, medium: 500, large: 760\">\r\n<p>&nbsp;<\/p>\r\n\r\n<ul class=\"striped-table columns\">\r\n\t<li>\r\n\t<h4>Where They Work<\/h4>\r\n\r\n\t<ul>\r\n\t\t<li>Dell EMC<\/li>\r\n\t\t<li>JPMorgan Chase &amp; Co.<\/li>\r\n\t\t<li>ADP<\/li>\r\n\t\t<li>Staples<\/li>\r\n\t\t<li>Interactive Data<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n\t<li>\r\n\t<h4>What They Do<\/h4>\r\n\r\n\t<ul>\r\n\t\t<li>Information Technology<\/li>\r\n\t\t<li>Operations<\/li>\r\n\t\t<li>Program and Project Management<\/li>\r\n\t\t<li>Business Development<\/li>\r\n\t\t<li>Entrepreneurship<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n\t<li>\r\n\t<h4>What They're Skilled At<\/h4>\r\n\r\n\t<ul>\r\n\t\t<li>Business Analysis<\/li>\r\n\t\t<li>Leadership<\/li>\r\n\t\t<li>Requirements Analysis<\/li>\r\n\t\t<li>Software Development Life Cycle (SDLC)<\/li>\r\n\t\t<li>Project Management<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n<\/ul>\r\n<\/div>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Learn more about Northeastern Alumni on&nbsp;<a href=\"https:\/\/www.linkedin.com\/school\/northeastern-university\/people\/\">Linkedin<\/a>.<\/p>\r\n","format":"basic_html"}],"field_duration":[{"value":"12-18 months"}],"field_accreditation_abbreviation":[],"field_related_program":{"type":"entity","entities":[]},"field_related_program_2":{"type":"entity","entities":[{"id":"18384","title":[{"value":"Master of Professional Studies in Analytics – Portland"}],"field_formatted_title":[{"value":"Analytics"}],"field_program_thumbnail":[{"target_id":"2357","alt":"Master of Professional Studies in Analytics — Portland","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/MPS-in-Analtyics-thumb.jpg"}],"field_degree_type":{"entities":[{"tid":"38","name":[{"value":"Master's"}]}],"nids":["38"],"type":"taxonomy"},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}]},{"tid":"4","name":[{"value":"Part-Time"}]}],"nids":["3","4"],"type":"taxonomy"},"field_duration":[{"value":"12-18 months"}],"field_study_options":{"entities":[{"tid":"41","name":[{"value":"Hybrid"}]}],"nids":["41"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"}}]},"field_finance_tuition_calc":[{"value":"{\"tuitionCalcOption\":\"costPerProgram\",\"fields\":{\"costPerCreditHour\":\"755.00\",\"tuition\":\"43900\"},\"tuitionCalcValue\":43900,\"tuitionCalcLabel\":\"Tuition\"}"}],"field_hide_tuition_costs":[{"value":"0"}],"field_finance_program_fees":[],"field_finance_aid":[],"field_finance_percent_aid":[],"field_finance_information":[],"field_finance_link":[],"field_finance_link_one_source":[{"value":"global"}],"field_finance_link_one_link":[],"field_finance_link_one_text":[],"field_finance_link_two_source":[{"value":"global"}],"field_finance_link_two_link":[],"field_finance_link_two_text":[],"field_admissions_deadline_source":[{"value":"program"}],"field_admissions_intro_text":[],"field_admissions_tables":{"type":"eck","entities":[{"title":[{"value":"Spring 2021"}],"field_table_header_col1":[],"field_table_header_col2":[],"field_admissions_table_rows":{"type":"eck","entities":[{"field_table_row_col1":[{"value":"Deadline for domestic applicants:"}],"field_table_row_col2":[{"value":"April 2, 2021"}]}]}},{"title":[{"value":"Fall 2021"}],"field_table_header_col1":[],"field_table_header_col2":[],"field_admissions_table_rows":{"type":"eck","entities":[{"field_table_row_col1":[{"value":"Deadline for domestic applicants:"}],"field_table_row_col2":[{"value":"August 15, 2021"}]}]}}]},"field_admissions_link_one_source":[{"value":"college"}],"field_admissions_link_one_link":[],"field_admissions_link_one_text":[],"field_admissions_link_two_source":[{"value":"college"}],"field_admissions_link_two_link":[],"field_admissions_link_two_text":[],"field_apply_text":[],"field_apply_link":[],"field_apply_link_source":[{"value":"college"}],"field_admissions_section_intro_text":{"value":"<p>A graduate degree or&nbsp;certificate from Northeastern—a top-50 university—can accelerate your career through rigorous academic coursework and hands-on professional experience in the area of your interest. Apply now—and take your career to the next level.<\/p>\r\n"},"field_admissions_deadlines":{"value":{"intro_text":"","tables":[{"title":"Spring 2021","header":[null,null],"rows":[["Deadline for domestic applicants:","April 2, 2021"]]},{"title":"Fall 2021","header":[null,null],"rows":[["Deadline for domestic applicants:","August 15, 2021"]]}]}},"field_admissions_links":{"value":{"one":{"url":"https:\/\/www.northeastern.edu\/graduate\/admissions-information\/how-to-apply\/applying-as-an-international-student\/","title":"Are You an International Student?","text":"Find out what additional documents are required to apply."},"two":{"url":"https:\/\/cps.northeastern.edu\/admissions-aid\/graduate-admissions\/","title":"Admissions Details","text":"Learn more about the College of Professional Studies admissions process, policies, and required materials."}}},"field_financial_links":{"value":{"one":{"url":"https:\/\/studentfinance.northeastern.edu\/#_ga=2.59552109.19549433.1506949601-148400310.1505504629","title":"Finance Your Education","text":"We offer a variety of resources, including scholarships and assistantships."},"two":{"url":"https:\/\/www.northeastern.edu\/graduate\/admissions-information\/how-to-apply\/the-process\/","title":"How to Apply","text":"Learn more about the application process and requirements."}}},"field_apply_link_transform":{"value":"https:\/\/app.applyyourself.com\/AYApplicantLogin\/fl_ApplicantLogin.asp?id=NEU-CPS&_ga=2.15527222.1824387636.1524836665-81214367.1520869011"},"field_requirements_transform":{"value":"<ul>\r\n\t<li>Online application<\/li>\r\n\t<li>Statement of purpose (500–1000 words): identifies your educational goals and expectations of the program<\/li>\r\n\t<li>Unofficial undergraduate transcripts (Official transcripts required at the time of admission) Reflecting degrees in engineering, computer technology, or coursework in place of Statistics.<\/li>\r\n\t<li>Two letters of recommendation: from individuals who have either academic or professional knowledge of your capabilities such as a faculty member, colleague, or mentor, preferably one from your current employer<\/li>\r\n\t<li>English Language Proficiency Proof: students for whom English is not their primary language must submit one of the following:\r\n\t<ul>\r\n\t\t<li>Official bachelor's degree transcript from an accredited college or university in the U.S, stating degree conferral and date<\/li>\r\n\t\t<li>TOEFL, IELTS, or NU Global Exam scores<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n<\/ul>\r\n\r\n<p>All students accepted to the MPS in Applied Machine Intelligence will be required to complete a Python Placement Exam upon acceptance. Those who achieve an 85% or greater will start with AI 6000 and those 84% and below will have to take a required Python course in their first term that will count towards a required elective.<\/p>\r\n"},"field_key_requirements_transform":{"value":"<ul>\r\n\t<li>Statement of purpose<\/li>\r\n\t<li>Two letters of recommendation<\/li>\r\n\t<li>Unofficial undergraduate transcripts reflecting degrees in engineering, computer technology, or coursework in place of Statistics<\/li>\r\n<\/ul>\r\n"},"field_experiential_transform":{"value":"<p>Learning integrated with professional experience is a hallmark of Northeastern and the Roux Institute. Students gain a clear understanding of real-world industry needs in Portland, the state of Maine, and the Northeast—and valued workplace skills like communication and teamwork—through assignments at companies and nonprofit organizations. Students can complete a six-week virtual project relevant to their studies through the university’s Experiential Network (XN) of employers, or even for their own company. Or they can apply for four- and six-month, full-time co-op positions. All opportunities enable students to build their resumés, expand their professional networks, and chart a path to in-demand careers.<\/p>\r\n"},"field_finance_blocks":{"value":[{"value":"<span class='bullet-currency'>$<\/span><span class='bullet-value'>43.9<\/span><span class='bullet-units'>K<\/span>","label":"Tuition","modal":"<p dir=\"ltr\"><strong>Estimated Total Tuition<\/strong><\/p>\r\n\r\n<p>This is an estimate based on the tuition rates for Academic Year 2020-2021 and does not include any fees or other expenses. Some courses and labs have tuition rates that may increase or decrease total tuition. Tuition and fees are subject to revision by the president and Board of Trustees at any time. For more detailed information, please visit <a href=\"https:\/\/studentfinance.northeastern.edu\/billing-payments\/tuition-and-fees\/\">Student Financial Services<\/a>.<\/p>\r\n"}]},"field_faculty_section_intro_text":{"value":"<p>Our faculty represents a wide cross-section of professional practices and fields ranging from finance to education to biomedical science to management to the U.S. military. They serve as mentors and advisors and collaborate alongside students to solve the most pressing global challenges facing established and emerging markets.<\/p>\r\n"},"field_student_section_intro_text":{"value":"<p>By enrolling in Northeastern, you gain access to a network of more than 275,000 alumni and 3,350+ employer partners, including Fortune 500 companies, government agencies, and global nongovernmental organizations. Our current students and faculty across strategically located regional locations further foster a lifelong, global community of learning and mentoring.<\/p>\r\n"},"field_curriculum_disclaimer":{"value":"<p>Please note: This curriculum is for marketing purposes only and is subject to change. Official curriculum can be found within the course catalog.<\/p>\r\n"}}