{"id":"18383","title":[{"value":"Graduate Certificate in Bioinformatics – Portland"}],"body":[{"value":"<p>The Graduate Certificate in Bioinformatics is designed to expand&nbsp;students’&nbsp;career opportunities in the life sciences by helping&nbsp;them&nbsp;develop the programming and data analysis skills&nbsp;they&nbsp;need to become more effective researchers&nbsp;and scientists.&nbsp;<\/p>\r\n","summary":"","format":"basic_html"}],"field_accredidation":[],"field_formatted_title":[{"value":"Bioinformatics"}],"field_program_thumbnail":[{"target_id":"2355","alt":"Graduate Certificate in Bioinformatics","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/Bioinformatics-cert-Portland-thumb.jpg"}],"field_unique_features":[{"value":"<ul>\r\n\t<li>A wide variety of electives allow&nbsp;students&nbsp;to specialize in&nbsp;an&nbsp;area of interest.<\/li>\r\n\t<li>Students who wish to continue their studies can apply all credits toward the Master of&nbsp;Science&nbsp;in Bioinformatics.<\/li>\r\n\t<li>The program is delivered through a hybrid model of online and&nbsp;on-site&nbsp;learning.<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_key_requirements":[{"value":"<ul>\r\n\t<li>Personal statement<\/li>\r\n\t<li>Resumé<\/li>\r\n\t<li>2 letters of recommendation<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_sv_id":[{"value":"a2j1a000000QKj9AAG"}],"field_visa_eligible":[{"value":"0"}],"field_total_credit_hours":[{"value":"16"}],"field_accredidation_link":[],"field_sidebar":{"type":"entity","entities":[]},"field_banner_id_er":{"type":"eck","entities":[{"field_degree_iped_code":[{"value":"6"}],"field_level_code":[{"value":"GR"}]}]},"field_curriculum":{"entities":[{"id":"18640","title":[{"value":"Graduate Certificate in Bioinformatics "}],"field_catalog_year":[{"value":"2021"}],"field_level_1_group":{"type":"eck","entities":[{"title":[{"value":"General Requirements "}],"field_group_type":[{"value":"core"}],"field_group_level_2":{"type":"eck","entities":[{"title":[{"value":"Graduate Certificate in Bioinformatics General Requirements "}],"field_requirements":[{"value":"<h3>Core Requirements<\/h3>\r\n\r\n<p>[course_table id=0]<\/p>\r\n\r\n<h3>Elective<\/h3>\r\n\r\n<p>Complete one of the following. Electives outside this list may be chosen in consultation with faculty advisor.<\/p>\r\n\r\n<p>Note: International students are required to select a 4-credit elective to maintain a full-time status, 8SH.&nbsp;<\/p>\r\n\r\n<p>[course_table id=1]<\/p>\r\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"431","title":[{"value":"BINF 6200 - Bioinformatics Programming"}],"field_course_code":[{"value":"BINF 6200"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on the fundamental programming skills required in the bioinformatics industry. Focuses on Python and R as the main programming language used. Topics include string operations, file manipulation, regular expressions, object-oriented programming, data structures, testing, program design, and implementation. Includes substantial out-of-classroom assignments.\n","format":null}]},{"id":"432","title":[{"value":"BINF 6308 - Bioinformatics Computational Methods 1"}],"field_course_code":[{"value":"BINF 6308"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers the first semester of a two-semester sequence on the use of computers in bioinformatics research. Offers students an opportunity to work with current methods and computational algorithms used in contemporary sequence analysis. Teaches practical skills necessary to manage and mine the vast biological information being generated and housed in public databases. Emphasizes the use of Python as the primary computer language and requires students to learn and understand basic computer logic and syntax, including an introduction to scalars, arrays, hashes, decision statements, loops, subroutines, references, and regular expressions. A focus on fundamental skills, including the command line interface found in the Linux operating system, is designed to prepare students for second-semester applications.","format":null}]},{"id":"433","title":[{"value":"BINF 6309 - Bioinformatics Computational Methods 2"}],"field_course_code":[{"value":"BINF 6309"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Designed to build upon the core topics covered in BINF 6308, i.e., use of the computer as a tool for bioinformatics research. Builds upon the Python language fundamentals covered during the first semester but requires students to apply these fundamentals to a semester-long project. The project includes protein family analysis, multiple sequence analysis, phylogeny, and protein structure analysis. Additionally, students have an opportunity to learn to build, load, connect, and query custom MySQL databases, and parse command line flags.\n","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"488","title":[{"value":"BIOE 5235 - Biomedical Imaging"}],"field_course_code":[{"value":"BIOE 5235"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents the foundations of modern medical imaging, including imaging principles, imaging mathematics, imaging physics, and image-generation techniques. Includes X-ray, ultrasound, computed tomography, and magnetic resonance imaging.","format":null}]},{"id":"492","title":[{"value":"BIOE 5420 - Cellular Engineering"}],"field_course_code":[{"value":"BIOE 5420"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Analyzes the techniques that form the foundation of molecular cell engineering, including recombinant DNA, cloning and genomics, prokaryotic and eukaryotic gene regulation and single-cell gene expression, structure, dynamics of gene regulatory networks, metabolism and cellular energetics, cell structure, cytoskeleton and cellular motors, synthetic gene circuits, and metabolic engineering.","format":null}]},{"id":"10555","title":[{"value":"BIOE 6100 - Medical Physiology"}],"field_course_code":[{"value":"BIOE 6100"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Designed to provide bioengineering students with a working knowledge of the integrated behavior of organs and systems in the human body. As such, the student is provided with a comprehensive and intense immersion in each physiological subsystem with the expectation that he or she display knowledge of each at the level equivalent to that of a second-year medical student following his or her exposure to physiology. The specific subsystems covered are muscle physiology, cardiovascular physiology with ECG interpretation, pulmonary physiology with gas exchange mechanics and ventilation\/perfusion, renal physiology and water balance, regulation of pH, gastrointestinal physiology, temperature regulation and energy balance, endocrine systems, and reproductive systems. The course does not cover neurophysiology.","format":null}]},{"id":"525","title":[{"value":"BIOL 5499 - Plant Biotechnology"}],"field_course_code":[{"value":"BIOL 5499"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Designed as an introductory course on plant biotechnology for upper-level undergraduates and first-year graduate students. Using examples from current research, offers students an opportunity to review the technology used to modify and improve economically important plants for sustainable agriculture as well as for the production of pharmaceutical and medicinal products. Specific topics include principles of plant heredity and genetics (molecular biology), plant breeding and improvement, hormones and growth regulators, gene isolation, plant tissue culture and transformation, plant-based pharmaceutical production, and stress tolerance and improvement. The course consists of weekly lectures, laboratory demonstrations, and review sessions of recent literature.","format":null}]},{"id":"529","title":[{"value":"BIOL 5543 - Stem Cells and Regeneration"}],"field_course_code":[{"value":"BIOL 5543"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Explores the biological basis of embryonic, adult, and induced pluripotent stem cells toward an understanding of their roles in development, homeostasis, and regeneration, as well as their therapeutic potential. The study of stem cells is a rapidly advancing area in biology and biomedicine. Although the biological basis of stem cells is a major focus, the course aims to put this knowledge into a biomedical context.","format":null}]},{"id":"530","title":[{"value":"BIOL 5549 - Inventions in Microbial Biotechnology"}],"field_course_code":[{"value":"BIOL 5549"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers readings and seminar-style discussion from the current literature on important inventions and practical applications in biotechnology, with a focus on drug discovery.","format":null}]},{"id":"532","title":[{"value":"BIOL 5569 - Advanced Microbiology"}],"field_course_code":[{"value":"BIOL 5569"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on how microorganisms develop, exchange, and regulate genes, and survive in various environments. Emphasizes experimental design and proof, particularly as related to genetic exchange, gene regulation, single and multicellular development, and cell-cell communication.","format":null}]},{"id":"535","title":[{"value":"BIOL 5573 - Medical Microbiology"}],"field_course_code":[{"value":"BIOL 5573"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Emphasizes host-parasite interactions: virulence, toxins, natural flora, and immunological responses; characteristics of the common bacterial, rickettsial, and protozoal infections in humans; and epidemiology, pathology, vaccines, and chemotherapy.","format":null}]},{"id":"537","title":[{"value":"BIOL 5581 - Biological Imaging"}],"field_course_code":[{"value":"BIOL 5581"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Illustrates imaging principles and techniques and their application to biological problems. Topics vary and may include microscopic and macroscopic approaches in areas such as cellular and neurobiology, ecology, and biochemistry.","format":null}]},{"id":"538","title":[{"value":"BIOL 5583 - Immunology"}],"field_course_code":[{"value":"BIOL 5583"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides an overview of the structure and function of genes, proteins, and cells involved in the generation of the immune response. Emphasis is on molecular immunology and immunogenetics.","format":null}]},{"id":"539","title":[{"value":"BIOL 5585 - Evolution"}],"field_course_code":[{"value":"BIOL 5585"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Discusses history of evolutionary theory and lines of evidence. Emphasis is on mechanisms of speciation. Introduces and discusses current evolutionary topics.","format":null}]},{"id":"540","title":[{"value":"BIOL 5587 - Comparative Neurobiology"}],"field_course_code":[{"value":"BIOL 5587"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents a cellular approach to structure and function of the nervous system. Topics include neuronal anatomy, phylogeny of nervous systems, electrophysiology of membrane conductances, synaptic transmission, integration in nerve cells, neuronal networks, sensory systems, motor systems, sensory-motor integration, development and regeneration of neuronal connectivity, and fundamentals of neurotechnology for biomedics. Focuses on the development of these concepts from the primary research literature. A term project involves the design of a simple nervous system for a hypothetical animal.","format":null}]},{"id":"541","title":[{"value":"BIOL 5591 - Advanced Genomics"}],"field_course_code":[{"value":"BIOL 5591"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Intended for those familiar with the basics of genetics, molecular and cellular biology, and biochemistry, all of which are required to appreciate the beauty, power, and importance of modern genomic approaches. Introduces the latest sequencing methods, array technology, genomic databases, whole genome analysis, functional genomics, and more.","format":null}]},{"id":"542","title":[{"value":"BIOL 5593 - Cell and Molecular Biology of Aging"}],"field_course_code":[{"value":"BIOL 5593"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers the recent scientific discoveries that have transformed our understanding of the process of aging. Examines in-depth the current understanding of the molecular mechanisms that control life span in model organisms, including yeast, worms, flies, and mice. Discusses dietary interventions and pharmacological approaches that extend the life span and delay the onset of age-related diseases. Covers potential applications of the new science of aging to improve human health. Requires students to read, discuss, present, and report on primary research papers from the literature.","format":null}]},{"id":"6902","title":[{"value":"BIOL 5597 - Immunotherapies of Cancer and Infectious Disease"}],"field_course_code":[{"value":"BIOL 5597"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Describes the basic principles and the current promises and disappointments with immunotherapies of cancer. Provides a historical overview of the main barriers between tumors and antitumor killer cells. The unifying focus of the lectures is the role of immunological and physiological negative regulators, i.e., &#8220;brakes&#8221; of anti-tumor immune response. A significant part of the course is dedicated to the retrospective evaluation of the last three decades of the immunological and biochemical studies that culminated in identification of the &#8220;chief of tumor defense operations,&#8221; i.e., a hypoxia-adenosinergic pathway in the tumor microenvironment.","format":null}]},{"id":"547","title":[{"value":"BIOL 6299 - Molecular Cell Biology for Biotechnology"}],"field_course_code":[{"value":"BIOL 6299"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Integrates biochemistry and molecular biology in the cellular context. Includes the organization and replication of genomes, principles and methods for genetic manipulation, the regulation of gene expression, and the structure and function of organelles. Emphasizes protein synthesis, including translation, post-translational modifications, and translocations of proteins within the cells and secretion.","format":null}]},{"id":"548","title":[{"value":"BIOL 6300 - Biochemistry"}],"field_course_code":[{"value":"BIOL 6300"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Studies the structure and function of biomolecules, with an emphasis on proteins; enzyme catalysis; and cellular metabolism, with an emphasis on bioenergetics and carbohydrate\/lipid.","format":null}]},{"id":"549","title":[{"value":"BIOL 6301 - Molecular Cell Biology"}],"field_course_code":[{"value":"BIOL 6301"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Integrates biochemistry and molecular biology in the cellular context. Emphasizes the organization and replication of genomes, the regulation of gene expression, the structure and function of organelles, and the mechanisms of signal transduction.","format":null}]},{"id":"550","title":[{"value":"BIOL 6303 - Neurobiology and Behavior"}],"field_course_code":[{"value":"BIOL 6303"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers a lecture course that aims to provide a comprehensive overview of behavioral neurobiology, with special emphasis on a neuroethological approach. At the end of the course, the successful student should have a contemporary understanding of the historical development of the behavioral sciences, the major ethological and neurobiological concepts, and the principal mechanisms that govern behavior in animals and humans. Requires permission of instructor for those students not enrolled in bioinformatics, biology, or marine biology.","format":null}]},{"id":"552","title":[{"value":"BIOL 6399 - Dynamics of Microbial Ecology"}],"field_course_code":[{"value":"BIOL 6399"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Explores state-of-the-art research on microbial biology of the environment and human body. Focuses on molecular diversity of microbial species and microbial discovery, microbial dynamics across time and space, microbiology of extreme environments, microbial ecology in the genomics age, host-microbe interactions in the human body, and translation of basic microbiology into practice. Emphasizes how new concepts in microbial biology, such as signal-based regulation and cell individuality, may change the current views on organization and function of microbial communities in nature. Requires permission of instructor for those students not enrolled in bioinformatics, biology, or marine biology.","format":null}]},{"id":"555","title":[{"value":"BIOL 6407 - Biochemistry for Molecular Biologists"}],"field_course_code":[{"value":"BIOL 6407"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on the interface between molecular biology, molecular genetics, and biochemistry. Concentrates on biochemical problems that molecular biologists are likely to find in their research. Includes examples of prokaryotic and eukaryotic (whenever available) systems. Experimental approaches are discussed for all topics. Seeks to enable students to develop a deep understanding of concepts in biological systems through reading and discussion of the primary literature.","format":null}]},{"id":"588","title":[{"value":"BIOT 5120 - Foundations in Biotechnology"}],"field_course_code":[{"value":"BIOT 5120"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides an interdisciplinary, state-of-the-art introduction to biotechnology. Covers the molecular foundations of biotechnology, molecular microbiology, receptor pharmacology, drug development processes, biotech process development and scale-up, drug approval and regulatory affairs, genomics, microarray analysis, proteomics, computational biology, molecular modeling, analytical biotechnology, and bioterrorism and biotechnology.","format":null}]},{"id":"589","title":[{"value":"BIOT 5130 - Team Skills in Biotechnology"}],"field_course_code":[{"value":"BIOT 5130"}],"field_credits":[{"value":"2.00"}],"field_credit_low":[{"value":"2.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on project management and leadership skills in the biotechnology industry. Emphasizes professional etiquette, teamwork, and team leadership in a diverse, multidisciplinary workplace. Also offers students an opportunity to develop their technical communication skills (scientific writing, public speaking, and technical presentations).","format":null}]},{"id":"590","title":[{"value":"BIOT 5145 - Basic Biotechnology Lab Skills"}],"field_course_code":[{"value":"BIOT 5145"}],"field_credits":[{"value":"1.00"}],"field_credit_low":[{"value":"1.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces selected key skills and techniques central to life sciences research. Combines hands-on training in basic laboratory skills with lecture and live demonstration. Laboratory exercises highlight the importance of precision\/accuracy in dispensation of liquids and in the preparation of solutions and standards, documentation and record keeping, and maintaining a safe and sterile work environment while performing scientific research.","format":null}]},{"id":"591","title":[{"value":"BIOT 5219 - The Biotechnology Enterprise"}],"field_course_code":[{"value":"BIOT 5219"}],"field_credits":[{"value":"2.00"}],"field_credit_low":[{"value":"2.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Exposes students to the business of biotech from scientific discovery startup through its product launch and subsequent organizational and scientific pipeline growth. Topics include scientific discovery, biotech-related funding and organizational structures, regulatory and clinical trial considerations, biotech alliances, patient access, ethics and compliance, and commercialization and growth while meeting unmet patient or consumer needs in this highly regulated industry. Although the focus is on the highest regulated standards in biopharma, the course also touches upon various aspects of other biotechnology domains.","format":null}]},{"id":"593","title":[{"value":"BIOT 5225 - Managing and Leading a Biotechnology Company"}],"field_course_code":[{"value":"BIOT 5225"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers managing projects and personnel in a technology-based organization Such activities are best carried out by those who combine the technical knowledge of their industry with the insight into the best practices for working with groups of highly educated, and often very experienced people. The biotechnology industry is strongly dependent on the concept that knowledge is always shared and ownership is collective. As the fundamental organizational mantra is teamwork, the principles of managing in this environment are key to achieving important goals. How to accomplish this and make decisions that drive innovation and success have common threads with other technology based industries, but with the added complexity of the scientific challenges facing the biotechnology industry. Restricted to students in the Bouv&#233; College of Health Sciences and in the College of Science or by permission of the program office.","format":null}]},{"id":"594","title":[{"value":"BIOT 5226 - Biotechnology Entrepreneurship"}],"field_course_code":[{"value":"BIOT 5226"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Biotechnology by its very nature is an innovative multidisciplinary industry. This is especially true for the biopharmaceutical industry in which the process of discovering new drugs and new drug targets requires novel approaches to solving difficult questions about disease processes and human health. This course focuses on the essential nature of innovation in the biotech industry, exposes students to the basics of creating startup organizations, explains the key role of business planning in enterprise creation, describes means for assessing risks, making choices from available options and how to measure success. Various business models, outsourcing work and establishing strategic partnerships are examined. Restricted to students in the Bouv&#233; College of Health Sciences and in the College of Science or by permission of the program office.","format":null}]},{"id":"595","title":[{"value":"BIOT 5227 - Launching Your Science: Biotechnology Entrepreneurship"}],"field_course_code":[{"value":"BIOT 5227"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on the essential startup elements that lead to pitching your science to investors and funding your biopharmaceutical enterprise. Exposes students to the basics of establishing an unmet patient need and matching that to a scientific discovery or biotechnology platform, analyzing the marketplace from a scientific perspective, determining a draft regulatory pathway and product development plan through a target product profile (TPP), appropriately sizing and hiring your early stage management team, and assessing the financial needs and risks for appropriate exit strategies. Students produce a baseline pitch deck as the culminating project for the course.","format":null}]},{"id":"597","title":[{"value":"BIOT 5560 - Bioprocess Fundamentals"}],"field_course_code":[{"value":"BIOT 5560"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on the fundamental principles and elements in the process of manufacturing biopharmaceuticals. Covers kinetics of enzymatic reactions; selected microbial and cell metabolism and relevant control mechanisms; kinetics of cell growth, cell death, substrate consumption, and product formation; mathematical modeling and representation of bioprocesses; examples of industrial bioprocesses to illustrate types and operations of upstream and downstream unit operations and mass transfers in fermentation systems&#8212;the affecting factors and the impact on process development and scale-up. Also includes an overview of economic considerations. Emphasizes bioprocesses for recombinant protein production.","format":null}]},{"id":"598","title":[{"value":"BIOT 5631 - Cell Culture Processes for Biopharmaceutical Production"}],"field_course_code":[{"value":"BIOT 5631"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers the principles and concepts involved in the development of mammalian and other types of cell culture processes for the manufacturing of biopharmaceutical products such as monoclonal antibodies and recombinant proteins. Topics include protein expression and clone generation, batch and perfusion processes and media development, bioreactor operations and scale-up, and innovations in cell culture processes. Regulatory concepts include quality assurance in a cGMP environment.","format":null}]},{"id":"599","title":[{"value":"BIOT 5635 - Downstream Processes for Biopharmaceutical Production"}],"field_course_code":[{"value":"BIOT 5635"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Addresses the development of recombinant protein purification processes in biotechnology. Provides an overview of the scientific principles, engineering strategies, and unit operations facilities involved in scalable protein purification processes. Also discusses viral clearance and inactivation strategies; cGMP considerations; and technological advances to improve effectiveness and efficiency, such as membrane-based disposable systems.","format":null}]},{"id":"600","title":[{"value":"BIOT 5640 - Drug Product Processes for Biopharmaceuticals"}],"field_course_code":[{"value":"BIOT 5640"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers the development and implementation of the drug product manufacturing process for biopharmaceuticals. Focuses on biologic products, specifically proteins. Covers the workflow required for the development and implementation of the production process with the scientific and engineering principles highlighted. Topics include the preformulation process for early stage product development, the selection of formulation compatible with the targeted product presentation, optimization of formulations to meet stability and usage objectives, the design of a scalable process for production, large-scale process equipment and operations, process scale-up considerations, and regulatory compliance issues for drug product manufacturing facilities and operations. Students who do not meet course prerequisites may seek permission of instructor.","format":null}]},{"id":"601","title":[{"value":"BIOT 5700 - Molecular Interactions of Proteins in Biopharmaceutical Formulations"}],"field_course_code":[{"value":"BIOT 5700"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an up-to-date survey and review of the research and understanding of the molecular interactions of proteins in biopharmaceutical formulations, including both liquid and solid formats, during the process of drug product manufacturing. Focuses on protein-protein interactions, protein-excipients (e.g., stabilizers, surfactants) interactions, and protein at interface surfaces interactions that are critical and impactful on the stability and integrity of therapeutic proteins of interest. Emphasizes understanding the mechanistic aspect of the interactions; the approaches, methods, and techniques employed to study these phenomena; and measures considered to modulate such interactions to enhance the performance of the biopharmaceutical formulations. Students who do not meet course prerequisites may seek permission of instructor.","format":null}]},{"id":"6831","title":[{"value":"BIOT 5810 - Cutting-Edge Applications in Molecular Biotechnology"}],"field_course_code":[{"value":"BIOT 5810"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the uses of molecular biology in a biotechnology setting. Includes a brief review of the basics and then dives into state-of-the-art molecular biology applications used in biotechnology today. These applications include stability and expression of cloned gene products, gene cloning strategies, transgenic species, mutation creation and analysis, DNA fingerprinting, PCR technology, microarray technology, gene probes, gene targeting, gene therapy, stem cell technology, antisense RNA, CAR T-cell therapy, RNA interference, and CRISPR\/Cas9.","format":null}]},{"id":"6832","title":[{"value":"BIOT 5850 - Higher-Order Structure Analytics"}],"field_course_code":[{"value":"BIOT 5850"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers a comprehensive look at various aspects of higher- order protein structures in biotherapeutics and their implications on biological drug design. Focuses heavily on protein aggregation, a type of HOS, and analysis of those aggregates including functional implications. Topics include a review of protein structure, protein aggregation, functional aspects, and techniques to reduce HOS using protein expression and purification strategies, protein folding in disease, macromolecular crystallography, nuclear magnetic resonance, analytical ultracentrifugation, circular dichroism, light scattering, electron spin labelling, cryo-EM, WAXS, and HDX-MS. Highlights experimental design and application to the biotechnology industry in identifying and reducing HOS.","format":null}]},{"id":"608","title":[{"value":"BIOT 7245 - Biotechnology Applications Laboratory"}],"field_course_code":[{"value":"BIOT 7245"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents a laboratory course in biotechnology with a focus on cutting-edge instrumentation that is currently used in the field.  Directs special attention at the practical aspects of laboratory work in this field, for example, techniques in sample preparation, procedures for protein analysis, and new bioinformatic approaches.  Focuses on the emerging field of chemiproteomics, which is the study of the interaction of small molecules with the proteome, that is, the full complement of proteins expressed in an individual cell or organism.  Exposes the student to hands-on experience with modern instrumentation, such as mass spectrometry and high performance liquid chromatography.","format":null}]},{"id":"967","title":[{"value":"CHEM 5550 - Introduction to Glycobiology and Glycoprotein Analysis"}],"field_course_code":[{"value":"CHEM 5550"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers the background and methods used for glycoprotein characterization. Offers students an opportunity to obtain the background needed to assess the analytical steps necessary for development of glycoprotein drugs. Analyzes regulatory issues behind glycoprotein drug development. Covers recent developments in analytical and regulatory sciences.","format":null}]},{"id":"976","title":[{"value":"CHEM 5616 - Protein Mass Spectrometry"}],"field_course_code":[{"value":"CHEM 5616"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers students an opportunity to obtain a fundamental understanding of modern mass spectrometers, the ability to operate these instruments, and the ability to prepare biological samples. Undoubtedly the most popular analytical method in science, mass spectrometry is utilized in fields ranging from subatomic physics to biology. Focuses on the analysis of proteins, with applications including biomarker discovery, tissue characterization, detection of blood doping, drug discovery, and the characterization of protein-based therapeutics. By the end of the course, the student is expected to be able to solve a particular chemistry- or biology-related problem by choosing the appropriate sample preparation methods and mass spectrometer.","format":null}]},{"id":"977","title":[{"value":"CHEM 5617 - Protein Mass Spectrometry Laboratory"}],"field_course_code":[{"value":"CHEM 5617"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers students an opportunity to develop an appreciation of the appropriate choice of mass spectrometer for a particular application.","format":null}]},{"id":"978","title":[{"value":"CHEM 5620 - Protein Chemistry"}],"field_course_code":[{"value":"CHEM 5620"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Describes proteins (what they are, where they come from, and how they work) in the context of analytical analysis and molecular medicine. Discusses the chemical properties of proteins, protein synthesis, and the genetic origins of globular proteins in solution, membrane proteins, and fibrous proteins. Covers the physical intra- and intermolecular interactions that proteins undergo along with descriptions of protein conformation and methods of structural determination. Explores protein folding as well as protein degradation and enzymatic activity. Highlights protein purification and biophysical characterization in relation to protein analysis, drug design, and optimization.","format":null}]},{"id":"995","title":[{"value":"CHEM 5660 - Analytical Biochemistry"}],"field_course_code":[{"value":"CHEM 5660"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers the analysis of biological molecules, which include nucleic acids, proteins, carbohydrates, lipids, and metabolites. Discusses isolation, characterization, and quantification of these molecules.","format":null}]},{"id":"1019","title":[{"value":"CHEM 7317 - Analytical Biotechnology"}],"field_course_code":[{"value":"CHEM 7317"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on the analytical methods used for the characterization of recombinant DNA-derived proteins for human therapeutic use. Combines the description of advanced analytical methods, in particular HPLC and mass spectrometry, with protein chemistry. An important aspect is the development of a method that can identify protein modifications that are present in a product as a result of biosynthetic modifications, contaminants, or degradative reactions. Provides an integrative overview of the role of analytical methods at the different stages of development and production of protein therapeutics including upstream (cell line development, cell culture), downstream (recovery and purifications), formulation development, stability studies, and clinical assay.","format":null}]},{"id":"1478","title":[{"value":"CS 5010 - Programming Design Paradigm"}],"field_course_code":[{"value":"CS 5010"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces modern program design paradigms. Starts with functional program design, introducing the notion of a design recipe. The latter consists of two parts: a task organization (ranging from the description of data to the creation of a test suite) and a data-oriented approach to the organization of programs (ranging from atomic data to self-referential data definitions and functions as data). The course then progresses to object-oriented design, explaining how it generalizes and contrasts with functional design. In addition to studying program design, students also have an opportunity to practice pair-programming and public code review techniques, as found in industry today.","format":null}]},{"id":"1480","title":[{"value":"CS 5100 - Foundations of Artificial Intelligence"}],"field_course_code":[{"value":"CS 5100"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the fundamental problems, theories, and algorithms of the artificial intelligence field. Topics include heuristic search and game trees, knowledge representation using predicate calculus, automated deduction and its applications, problem solving and planning, and introduction to machine learning. Required course work includes the creation of working programs that solve problems, reason logically, and\/or improve their own performance using techniques presented in the course. Requires experience in Java programming.","format":null}]},{"id":"1482","title":[{"value":"CS 5200 - Database Management Systems"}],"field_course_code":[{"value":"CS 5200"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces relational database management systems as a class of software systems. Prepares students to be sophisticated users of database management systems. Covers design theory, query language, and performance\/tuning issues. Topics include relational algebra, SQL, stored procedures, user-defined functions, cursors, embedded SQL programs, client-server interfaces, entity-relationship diagrams, normalization, B-trees, concurrency, transactions, database security, constraints, object-relational DBMSs, and specialized engines such as spatial, text, XML conversion, and time series. Includes exercises using a commercial relational or object-relational database management system.","format":null}]},{"id":"1490","title":[{"value":"CS 5400 - Principles of Programming Language"}],"field_course_code":[{"value":"CS 5400"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Studies the basic components of programming languages, specification of syntax and semantics, and description and implementation of programming language features. Discusses examples from a variety of languages.","format":null}]},{"id":"1491","title":[{"value":"CS 5500 - Foundations of Software Engineering"}],"field_course_code":[{"value":"CS 5500"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers the foundations of software engineering, including software development life cycle models (e.g., waterfall, spiral, agile); requirements analysis; user-centered design; software design principles and patterns; testing (functional testing, structural testing, testing strategies); code refactoring and debugging; software architecture and design; and integration and deployment. Includes a course project where some of the software engineering methods (from requirements analysis to testing) are applied in a team-based setting. Requires admission to MS program or completion of all transition courses.","format":null}]},{"id":"1493","title":[{"value":"CS 5600 - Computer Systems"}],"field_course_code":[{"value":"CS 5600"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Studies the structure, components, design, implementation, and internal operation of computer systems, focusing mainly on the operating system level. Reviews computer hardware and architecture including the arithmetic and logic unit, and the control unit. Covers current operating system components and construction techniques including the memory and memory controller, I\/O device management, device drivers, memory management, file system structures, and the user interface. Introduces distributed operating systems. Discusses issues arising from concurrency and distribution, such as scheduling of concurrent processes, interprocess communication and synchronization, resource sharing and allocation, and deadlock management and resolution. Includes examples from real operating systems. Exposes students to the system concepts through programming exercises. Requires admission to MS program or completion of all transition courses.","format":null}]},{"id":"1494","title":[{"value":"CS 5610 - Web Development"}],"field_course_code":[{"value":"CS 5610"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Discusses Web development for sites that are dynamic, data driven, and interactive. Focuses on the software development issues of integrating multiple languages, assorted data technologies, and Web interaction. Considers ASP.NET, C#, HTTP, HTML, CSS, XML, XSLT, JavaScript, AJAX, RSS\/Atom, SQL, and Web services. Each student must deploy individually designed Web experiments that illustrate the Web technologies and at least one major integrative Web site project. Students may work in teams with the permission of the instructor. Each student or team must also create extensive documentation of their goals, plans, design decisions, accomplishments, and user guidelines. All source files must be open and be automatically served by a sources server.","format":null}]},{"id":"1497","title":[{"value":"CS 5700 - Fundamentals of Computer Networking"}],"field_course_code":[{"value":"CS 5700"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Studies network protocols, focusing on modeling and analysis, and architectures. Introduces modeling concepts, emphasizing queuing theory, including Little&#8217;s theorem, M\/M\/1, M\/M\/m, M\/D\/1, and M\/G\/1 queuing systems. Discusses performance evaluation of computer networks including performance metrics, evaluation tools and methodology, simulation techniques, and limitations. Presents the different harmonizing functions needed for communication and efficient operation of computer networks and discusses examples of Ethernet, FDDI, and wireless networks. Covers link layer protocols including HDLC, PPP, and SLIP; packet framing; spanning tree and learning bridges, error detection techniques, and automatic repeat request algorithms; sliding window and reliable\/ordered services; and queuing disciplines including FQ and WFQ. Introduces flow control schemes, such as window flow control and leaky bucket rate control schemes, and discusses congestion control and fairness. Requires knowledge of probability theory.","format":null}]},{"id":"1500","title":[{"value":"CS 5800 - Algorithms"}],"field_course_code":[{"value":"CS 5800"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents the mathematical techniques used for the design and analysis of computer algorithms. Focuses on algorithmic design paradigms and techniques for analyzing the correctness, time, and space complexity of algorithms. Topics may include asymptotic notation, recurrences, loop invariants, Hoare triples, sorting and searching, advanced data structures, lower bounds, hashing, greedy algorithms, dynamic programming, graph algorithms, and NP-completeness.","format":null}]},{"id":"1508","title":[{"value":"CS 6140 - Machine Learning"}],"field_course_code":[{"value":"CS 6140"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides a broad look at a variety of techniques used in machine learning and data mining, and also examines issues associated with their use. Topics include algorithms for supervised learning including decision tree induction, artificial neural networks, instance-based learning, probabilistic methods, and support vector machines; unsupervised learning; and reinforcement learning. Also covers computational learning theory and other methods for analyzing and measuring the performanceof learning algorithms. Course work includes a programming term project.","format":null}]},{"id":"1509","title":[{"value":"CS 6200 - Information Retrieval"}],"field_course_code":[{"value":"CS 6200"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides an introduction to information retrieval systems and different approaches to information retrieval. Topics covered include evaluation of information retrieval systems; retrieval, language, and indexing models; file organization; compression; relevance feedback; clustering; distributed retrieval and metasearch; probabilistic approaches to information retrieval; Web retrieval; filtering, collaborative filtering, and recommendation systems; cross-language IR; multimedia IR; and machine learning for information retrieval.","format":null}]},{"id":"1510","title":[{"value":"CS 6220 - Data Mining Techniques"}],"field_course_code":[{"value":"CS 6220"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers various aspects of data mining, including classification, prediction, ensemble methods, association rules, sequence mining, and cluster analysis. The class project involves hands-on practice of mining useful knowledge from a large data set.","format":null}]},{"id":"6548","title":[{"value":"DA 5020 - Collecting, Storing, and Retrieving Data"}],"field_course_code":[{"value":"DA 5020"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Studies how to build large-scale information repositories of different types of information objects so that they can be selected, retrieved, and transformed for analytics and discovery, including statistical analysis. Analyzes how traditional approaches to data storage can be applied alongside modern approaches that use nonrelational data structures. Through case studies, readings on background theory, and hands-on experimentation, offers students an opportunity to learn how to select, plan, and implement storage, search, and retrieval components of large-scale structured and unstructured information repositories. Emphasizes how to assess and recommend efficient and effective large-scale information storage and retrieval components that provide data scientists with properly structured, accurate, and reliable access to information needed for investigation.","format":null}]},{"id":"6549","title":[{"value":"DA 5030 - Introduction to Data Mining\/Machine Learning"}],"field_course_code":[{"value":"DA 5030"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the fundamental techniques for data mining, combining elements from CS 6140 and CS 6220. Discusses several basic learning algorithms, such as regression and decision trees, along with popular data types, implementation and execution, and analysis of results. Lays the data analytics program foundation of how learning models from data work, both algorithmically and practically. The coding can be done in R, Matlab or Python. Students must demonstrate ability to set up data for learning, training, testing, and evaluating.","format":null}]},{"id":"10999","title":[{"value":"INSH 5301 - Introduction to Computational Statistics"}],"field_course_code":[{"value":"INSH 5301"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[{"value":"0.00"}],"field_credit_connector":[{"value":"creditConnector"}],"field_description":[{"value":"Introduces the fundamental techniques of quantitative data analysis, ranging from foundational skills—such as data description and visualization, probability, and statistics—to the workhorse of data analysis and regression, to more advanced topics—such as machine learning and networks. Emphasizes real-world data and applications using the R statistical computing language. Analyzing and understanding complex data has become an essential component of numerous fields: business and economics, health and medicine, marketing, public policy, computer science, engineering, and many more. Offers students an opportunity to finish the course ready to apply a wide variety of analytic methods to data problems, present their results to nonexperts, and progress to more advanced course work delving into the many topics introduced here.","format":null}]},{"id":"11000","title":[{"value":"INSH 5302 - Information Design and Visual Analytics"}],"field_course_code":[{"value":"INSH 5302"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[{"value":"0.00"}],"field_credit_connector":[{"value":"creditConnector"}],"field_description":[{"value":"Introduces the systematic use of visualization techniques for supporting the discovery of new information as well as the effective presentation of known facts. Based on principles from art, graphic design, perceptual psychology, and rhetoric, offers students an opportunity to learn how to successfully choose appropriate visual languages for representing various kinds of data to support insights relevant to the user’s goals. Covers visual data mining techniques and algorithms for supporting the knowledge-discovery process; principles of visual perception and color theory for revealing patterns in data, semiotics, and the epistemology of visual representation; narrative strategies for communicating and presenting information and evidence; and the critical evaluation and critique of data visualizations. Requires proficiency in R.","format":null}]},{"id":"4142","title":[{"value":"MATH 5131 - Introduction to Mathematical Methods and Modeling"}],"field_course_code":[{"value":"MATH 5131"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents mathematical methods emphasizing applications. Uses ordinary and partial differential equations to model the evolution of real-world processes. Topics chosen illustrate the power and versatility of mathematical methods in a variety of applied fields and include population dynamics, drug assimilation, epidemics, spread of pollutants in environmental systems, competing and cooperating species, and heat conduction. Requires students to complete a math-modeling project. Requires undergraduate-level course work in ordinary and partial differential equations.","format":null}]},{"id":"4155","title":[{"value":"MATH 7203 - Numerical Analysis 1"}],"field_course_code":[{"value":"MATH 7203"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces methods and techniques used in contemporary number crunching. Covers floating-point computations involving scalars, vectors, and matrices; solvers for sparse and dense linear systems; matrix decompositions; integration of functions and solutions of ordinary differential equations (ODEs); and Fast Fourier transform. Focuses on finding solutions to practical, real-world problems. Knowledge of programming in Matlab is assumed. Knowledge of other programming languages would be good but not required.","format":null}]},{"id":"4157","title":[{"value":"MATH 7205 - Numerical Analysis 2"}],"field_course_code":[{"value":"MATH 7205"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers numerical analysis and scientific computation. Topics include numerical solutions of ordinary differential equations (ODEs) and one-dimensional boundary value problems; solving partial differential equations (PDEs) using modal expansions, finite-difference, and finite-element methods; stability of PDE algorithms; elementary computational geometry and mesh generation; unconstrained optimization with application to data modeling; and constrained optimization of convex functions: linear and quadratic programming. Focuses on techniques commonly used for data fitting and solving problems from engineering and physical science. Knowledge of programming in MATLAB is assumed. Knowledge of other programming languages beneficial but not required.","format":null}]},{"id":"4163","title":[{"value":"MATH 7233 - Graph Theory"}],"field_course_code":[{"value":"MATH 7233"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers fundamental concepts in graph theory. Topics include adjacency and incidence matrices, paths and connectedness, and vertex degrees and counting; trees and distance including properties of trees, distance in graphs, spanning trees, minimum spanning trees, and shortest paths; matchings and factors including matchings in bipartite graphs, Hall&#8217;s matching condition, and min-max theorems; connectivity, such as vertex connectivity, edge connectivity, k-connected graphs, and Menger&#8217;s theorem; network flows including maximum network flow, and integral flows; vertex colorings, such as upper bounds, Brooks, theorem, graphs with large chromatic number, and critical graphs; Eulerian circuits and Hamiltonian cycles including Euler&#8217;s theorem, necessary conditions for Hamiltonian cycles, and sufficient conditions; planar graphs including embeddings and Euler&#8217;s formula, characterization of planar graphs (Kuratowski&#8217;s theorem); and Ramsey theory including Ramsey&#8217;s theorem, Ramsey numbers, and graph Ramsey theory.","format":null}]},{"id":"4166","title":[{"value":"MATH 7241 - Probability 1"}],"field_course_code":[{"value":"MATH 7241"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an introductory course in probability theory, with an emphasis on problem solving and modeling. Starts with basic concepts of probability spaces and random variables, and moves on to the classification of Markov chains with applications. Other topics include the law of large numbers and the central limit theorem, with applications to the theory of random walks and Brownian motion.","format":null}]},{"id":"4186","title":[{"value":"MATH 7341 - Probability 2"}],"field_course_code":[{"value":"MATH 7341"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Continues MATH 7241. Studies probability theory, with an emphasis on its use in modeling and queueing theory. Starts with basic properties of exponential random variables, and then applies this to the study of the Poisson process. Queueing theory forms the bulk of the course, with analysis of single-server queues, multiserver queues, and networks of queues. Also includes material on continuous-time Markov processes, renewal theory, and Brownian motion.","format":null}]},{"id":"4187","title":[{"value":"MATH 7342 - Mathematical Statistics"}],"field_course_code":[{"value":"MATH 7342"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces mathematical statistics, emphasizing theory of point estimations. Topics include parametric estimations, minimum variance unbiased estimators, sufficiency and completeness, and Rao-Blackwell theorem; asymptotic (large sample) theory, maximum likelihood estimator (MLE), consistency of MLE, asymptotic theory of MLE, and Cramer-Rao bound; and hypothesis testing, Neyman-Pearson fundamental lemma, and likelihood ratio test.","format":null}]},{"id":"4189","title":[{"value":"MATH 7344 - Regression, ANOVA, and Design"}],"field_course_code":[{"value":"MATH 7344"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Discusses one-sample and two-sample tests; one-way ANOVA; factorial and nested designs; Cochran&#8217;s theorem; linear and nonlinear regression analysis and corresponding experimental design; analysis of covariance; and simultaneous confidence intervals.","format":null}]},{"id":"4190","title":[{"value":"MATH 7345 - Nonparametric Methods in Statistics"}],"field_course_code":[{"value":"MATH 7345"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents methods for analyzing data that is not necessarily normal. Emphasizes comparing two treatments (the Wilcoxon test, Kolmogorov-Smirnov test), comparison of several treatments (the Kruskal-Wallas test), randomized complete blocks, tests of randomness and independence, asymptotic methods (the delta method, Pitman efficiency), and bootstrapping.","format":null}]},{"id":"5248","title":[{"value":"PHSC 6214 - Experimental Design and Biostatistics"}],"field_course_code":[{"value":"PHSC 6214"}],"field_credits":[{"value":"2.00"}],"field_credit_low":[{"value":"2.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Discusses fundamental principles of experimental design and statistical analysis, with emphasis on clinical research. Topics include descriptive statistics, hypothesis testing, analysis of variance, correlation, regression, chi-square test, and nonparametric methods.","format":null}]},{"id":"5352","title":[{"value":"PHYS 5116 - Complex Networks and Applications"}],"field_course_code":[{"value":"PHYS 5116"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces network science and the set of analytical, numerical, and modeling tools used to understand complex networks emerging in nature and technology. Focuses on the empirical study of real networks, with examples coming from biology (metabolic, protein interaction networks), computer science (World Wide Web, Internet), or social systems (e-mail, friendship networks). Shows the organizing principles that govern the emergence of networks and the set of tools necessary to characterize and model them. Covers elements of graph theory, statistical physics, biology, and social science as they pertain to the understanding of complex systems.","format":null}]},{"id":"5378","title":[{"value":"PHYS 7331 - Network Science Data"}],"field_course_code":[{"value":"PHYS 7331"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an overview of data mining and analysis and techniques in network science. Introduces students to network data analysis. Presents algorithms for the characterization and measurement of networks (centrality based, decomposition, community analysis, etc.) and issues in sampling and statistical biases. Reviews visualization algorithms and specific software tools. Offers students an opportunity to learn about working with real-world network datasets.","format":null}]},{"id":"10535","title":[{"value":"PHYS 7332 - Network Science Data 2"}],"field_course_code":[{"value":"PHYS 7332"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[{"value":"0.00"}],"field_credit_connector":[{"value":"creditConnector"}],"field_description":[{"value":"Focuses on practical exercises in real network data. Offers students an opportunity to learn how to retrieve network data from the real world, analyze network structures and properties, study dynamical processes on top of the networks, and visualize networks. The main programming language used in this course is the current industry standard. This is an interdisciplinary course.","format":null}]}]}}]}}]}}]}}]},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}],"description":[{"value":"","format":null}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}],"description":[{"value":"","format":null}]},{"tid":"4","name":[{"value":"Part-Time"}],"description":[{"value":"","format":null}]}],"nids":["3","4"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"},"field_pan":{"entities":[],"nids":[],"type":"taxonomy"},"field_degree_type":{"entities":[{"tid":"39","name":[{"value":"Certificate"}],"description":[{"value":"","format":null}]}],"nids":["39"],"type":"taxonomy"},"field_undergrad_degree_type":{"entities":[],"nids":[],"type":"taxonomy"},"field_area_of_study":{"entities":[{"tid":"35","name":[{"value":"Science and Mathematics"}],"description":[{"value":"","format":null}],"field_slug":[{"value":"science-math"}]}],"nids":["35"],"type":"taxonomy"},"field_study_options":{"entities":[{"tid":"41","name":[{"value":"Hybrid"}],"description":[{"value":"","format":null}]}],"nids":["41"],"type":"taxonomy"},"field_entry_terms":{"entities":[{"tid":"77","name":[{"value":"Fall"}]},{"tid":"78","name":[{"value":"Spring"}]}],"nids":["77","78"],"type":"taxonomy"},"field_program_family":{"type":"entity","entities":[{"title":[{"value":"Bioinformatics"}],"field_college":{"type":"entity","entities":[{"id":"122","title":[{"value":"College of Science"}],"field_experiential_learning":[{"value":"<p>Northeastern's signature experience-powered learning model has been at the heart of the university for more than a century. It combines world-class academics with professional practice, allowing you to acquire relevant, real-world skills you can immediately put into action in your current workplace. This makes a Northeastern education a dynamic, transformative experience, giving you countless opportunities to grow as a professional and person.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n","format":"basic_html"}],"field_requirements":[{"value":"<ul>\r\n\t<li><a href=\"https:\/\/app.applyyourself.com\/AYApplicantLogin\/fl_ApplicantConnectLogin.asp?id=neu-grad\">Online application<\/a><\/li>\r\n\t<li>Application fee<\/li>\r\n\t<li>Transcripts from all institutions attended<\/li>\r\n\t<li>Personal statement<\/li>\r\n\t<li>Resumé<\/li>\r\n\t<li>2 letters of recommendation<\/li>\r\n\t<li>English language proficiency:\r\n\t<ul style=\"margin-top:0in\" type=\"circle\">\r\n\t\t<li>Degree earned or in progress at a U.S. institution<\/li>\r\n\t\t<li>Degree earned or in progress at an institution where English is the only medium of instruction<\/li>\r\n\t\t<li>Official exam scores from either the TOEFL iBT (institution code is 3682), IELTS, PTE exam, or Duolingo English Test. Scores are valid for 2 years from the test date.<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n<\/ul>\r\n\r\n<p><a href=\"https:\/\/cos.northeastern.edu\/admissions\/graduate-programs\/how-to-apply\/\">Learn more about applying to the College of Science.<\/a><\/p>\r\n","format":"basic_html"}],"field_college_link":[{"value":"https:\/\/cos.northeastern.edu\/"}]}]},"program":{"entities":[{"id":"14244","title":[{"value":"Master of Science in Bioinformatics - Boston"}]},{"id":"14245","title":[{"value":"Master of Science in Bioinformatics — Online"}]},{"id":"17121","title":[{"value":"Graduate Certificate in Bioinformatics — Boston "}]},{"id":"17123","title":[{"value":"Graduate Certificate in Bioinformatics — Online "}]},{"id":"18380","title":[{"value":"Master of Science in Bioinformatics – Portland"}]},{"id":"18383","title":[{"value":"Graduate Certificate in Bioinformatics – Portland"}]}]}}]},"field_hero_image":[{"target_id":"2354","alt":"","title":"","width":"480","height":"290","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/Bioinformatics%20cert%20Portland%20hero.jpg"}],"field_hero_video_mp4":[],"field_hero_video_webm":[],"field_overview":[],"field_program_description_long":[{"value":"<p paraeid=\"{5f598877-0d8c-4758-9ba5-820c92fe4663}{102}\" paraid=\"43\">The Graduate Certificate in Bioinformatics provides cross-disciplinary training in biology, computer science, and data analytics that will prepare students to play pivotal roles in today’s cutting-edge life science, biotechnology, and pharmaceutical industries.&nbsp;Students learn how to interpret data encountered in fields such as genomics, proteomics, personalized medicine, drug discovery, and cancer therapy. The certificate comprises four classes&nbsp;that&nbsp;can be completed in as little as eight months, with a maximum limit of three years.<\/p>\r\n\r\n<p paraeid=\"{5f598877-0d8c-4758-9ba5-820c92fe4663}{122}\" paraid=\"1954759666\">All Roux Institute programs provide content relevant to the urgent and emerging needs of industry in Maine and the rapidly evolving regional, national, and global economy. Opportunities for experiential learning will be concentrated in Portland, the state of Maine, and the Northeast region. Students are encouraged to pursue co-ops and special virtual Experiential Network projects with the institute’s founding corporate partners, a group of leading employers in Maine.&nbsp;<\/p>\r\n\r\n<hr \/>\r\n<h3>More Details<\/h3>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Unique Features<\/h4>\r\n\r\n<ul>\r\n\t<li>A wide variety of electives allow&nbsp;students&nbsp;to specialize in&nbsp;an&nbsp;area of interest.<\/li>\r\n\t<li>Students who wish to continue their studies can apply all credits toward the Master of&nbsp;Science&nbsp;in Bioinformatics.<\/li>\r\n\t<li>The program is delivered through a hybrid model of online and&nbsp;on-site&nbsp;learning.<\/li>\r\n<\/ul>\r\n<\/div>\r\n","format":"basic_html"}],"field_requirements":[],"field_requirements_append":[{"value":"0"}],"field_marketo_form_one":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-1A-1B_CERTG-BINF-Simple-POI-1A.html"}],"field_marketo_form_two":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-1A-1B_CERTG-BINF-ALL-GRAD-POI-Hidden-1B.html"}],"field_marketo_form_three":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-2_CERTG-BINF-No-POI-Form-2.html"}],"field_marketo_form_four":[{"value":"https:\/\/pages.northeastern.edu\/GRAD-WEBS-Prog-Page-iFrames-4_CERTG-BINF-Find-Out-More-Bottom-ALL-GRAD-POI-Hidden.html"}],"field_program_experience":[{"value":"<p>Learning integrated with professional experience is a hallmark of Northeastern and the Roux Institute. Students gain a clear understanding of real-world industry needs in Portland, the state of Maine, and the Northeast—and valued workplace skills like communication and teamwork—through assignments at companies and nonprofit organizations. Students can complete a six-week virtual project relevant to their studies through the university’s <a href=\"https:\/\/careers.northeastern.edu\/experiential-network\/\">Experiential Network (XN)<\/a> of employers, or even for their own company. Or they can apply for four- and six-month, full-time co-op positions. All opportunities enable students to build their resumés, expand their professional networks, and chart a path to in-demand careers.<\/p>\r\n","format":"basic_html"}],"field_testimonials":{"entities":[]},"field_faculty_overview":[],"field_students_overview":[{"value":"<p>Below is a look at where our science and mathematics alumni work, the positions they hold, and the skills they bring to their organization.<\/p>\r\n\r\n<div class=\"element-container striped-list\" data-eq-pts=\"small: 300, medium: 500, large: 760\">\r\n<p>&nbsp;<\/p>\r\n\r\n<ul class=\"striped-table columns\">\r\n\t<li>\r\n\t<h4>Where They Work<\/h4>\r\n\r\n\t<ul>\r\n\t\t<li>State Street<\/li>\r\n\t\t<li>IBM<\/li>\r\n\t\t<li>Raytheon<\/li>\r\n\t\t<li>Liberty Mutual Insurance<\/li>\r\n\t\t<li>Amazon<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n\t<li>\r\n\t<h4>What They Do<\/h4>\r\n\r\n\t<ul>\r\n\t\t<li>Engineering<\/li>\r\n\t\t<li>Education<\/li>\r\n\t\t<li>Business Development<\/li>\r\n\t\t<li>Research<\/li>\r\n\t\t<li>Information Technology<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n\t<li>\r\n\t<h4>What They're Skilled At<\/h4>\r\n\r\n\t<ul>\r\n\t\t<li>Matlab<\/li>\r\n\t\t<li>Research<\/li>\r\n\t\t<li>C++<\/li>\r\n\t\t<li>Project Management<\/li>\r\n\t\t<li>Data Analysis<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n<\/ul>\r\n<\/div>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Learn more about Northeastern Alumni on&nbsp;<a href=\"https:\/\/www.linkedin.com\/school\/northeastern-university\/people\/\">Linkedin<\/a>.<\/p>\r\n","format":"basic_html"}],"field_duration":[{"value":"8-36 months"}],"field_accreditation_abbreviation":[],"field_related_program":{"type":"entity","entities":[]},"field_related_program_2":{"type":"entity","entities":[{"id":"16851","title":[{"value":"Graduate Certificate in Biotechnology - Online"}],"field_formatted_title":[{"value":"Biotechnology"}],"field_program_thumbnail":[{"target_id":"1624","alt":"Graduate Certificate in Biotechnology - Online ","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2017-08\/_DSC0072_1.jpg"}],"field_degree_type":{"entities":[{"tid":"39","name":[{"value":"Certificate"}]}],"nids":["39"],"type":"taxonomy"},"field_location":{"entities":[{"tid":"69","name":[{"value":"Online"}]}],"nids":["69"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}]},{"tid":"4","name":[{"value":"Part-Time"}]}],"nids":["3","4"],"type":"taxonomy"},"field_duration":[{"value":"1 year"}],"field_study_options":{"entities":[{"tid":"37","name":[{"value":"Online"}]}],"nids":["37"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"}},{"id":"14245","title":[{"value":"Master of Science in Bioinformatics — Online"}],"field_formatted_title":[{"value":"Bioinformatics"}],"field_program_thumbnail":[{"target_id":"1138","alt":"Master of Science in Bioinformatics — Online","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2016-08\/Game%20Science%20and%20Design_Michael%20Spierler%20%281%29.jpg"}],"field_degree_type":{"entities":[{"tid":"38","name":[{"value":"Master's"}]}],"nids":["38"],"type":"taxonomy"},"field_location":{"entities":[{"tid":"69","name":[{"value":"Online"}]}],"nids":["69"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}]},{"tid":"4","name":[{"value":"Part-Time"}]}],"nids":["3","4"],"type":"taxonomy"},"field_duration":[{"value":"2-3 Years"}],"field_study_options":{"entities":[{"tid":"37","name":[{"value":"Online"}]}],"nids":["37"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"}},{"id":"14251","title":[{"value":"Master of Science in Biotechnology — Online"}],"field_formatted_title":[{"value":"Biotechnology"}],"field_program_thumbnail":[{"target_id":"1263","alt":"Master of Science in Biotechnology — Online","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2016-08\/22thumbnail.jpg"}],"field_degree_type":{"entities":[{"tid":"38","name":[{"value":"Master's"}]}],"nids":["38"],"type":"taxonomy"},"field_location":{"entities":[{"tid":"69","name":[{"value":"Online"}]}],"nids":["69"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}]},{"tid":"4","name":[{"value":"Part-Time"}]}],"nids":["3","4"],"type":"taxonomy"},"field_duration":[{"value":"2-3 Years"}],"field_study_options":{"entities":[{"tid":"37","name":[{"value":"Online"}]}],"nids":["37"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"}}]},"field_finance_tuition_calc":[{"value":"{\"tuitionCalcOption\":\"costPerProgram\",\"fields\":{\"costPerCreditHour\":\"1550.00\",\"creditHours\":\"16\",\"tuition\":\"26900\"},\"tuitionCalcValue\":26900,\"tuitionCalcLabel\":\"Tuition\"}"}],"field_hide_tuition_costs":[{"value":"0"}],"field_finance_program_fees":[],"field_finance_aid":[],"field_finance_percent_aid":[],"field_finance_information":[],"field_finance_link":[],"field_finance_link_one_source":[{"value":"global"}],"field_finance_link_one_link":[],"field_finance_link_one_text":[],"field_finance_link_two_source":[{"value":"global"}],"field_finance_link_two_link":[],"field_finance_link_two_text":[],"field_admissions_deadline_source":[{"value":"program"}],"field_admissions_intro_text":[{"value":"<p><a href=\"https:\/\/cos.northeastern.edu\/admissions\/graduate-programs\/how-to-apply\/\">Learn more about applying to the College of Science and our admissions deadlines.<\/a><\/p>\r\n","format":"basic_html"}],"field_admissions_tables":{"type":"eck","entities":[]},"field_admissions_link_one_source":[{"value":"college"}],"field_admissions_link_one_link":[],"field_admissions_link_one_text":[],"field_admissions_link_two_source":[{"value":"college"}],"field_admissions_link_two_link":[],"field_admissions_link_two_text":[],"field_apply_text":[],"field_apply_link":[],"field_apply_link_source":[{"value":"college"}],"field_admissions_section_intro_text":{"value":"<p>A graduate degree or&nbsp;certificate from Northeastern—a top-50 university—can accelerate your career through rigorous academic coursework and hands-on professional experience in the area of your interest. Apply now—and take your career to the next level.<\/p>\r\n"},"field_admissions_deadlines":{"value":{"intro_text":"<p><a href=\"https:\/\/cos.northeastern.edu\/admissions\/graduate-programs\/how-to-apply\/\">Learn more about applying to the College of Science and our admissions deadlines.<\/a><\/p>\r\n","tables":[]}},"field_admissions_links":{"value":{"one":{"url":"https:\/\/www.northeastern.edu\/graduate\/admissions-information\/how-to-apply\/applying-as-an-international-student\/","title":"Are You an International Student?","text":"Find out what additional documents are required to apply."},"two":{"url":"https:\/\/cos.northeastern.edu\/admissions\/graduate-programs\/how-to-apply","title":"Admissions Details","text":"Learn more about the College of Science admissions process, policies, and required materials."}}},"field_financial_links":{"value":{"one":{"url":"https:\/\/studentfinance.northeastern.edu\/#_ga=2.59552109.19549433.1506949601-148400310.1505504629","title":"Finance Your Education","text":"We offer a variety of resources, including scholarships and assistantships."},"two":{"url":"https:\/\/www.northeastern.edu\/graduate\/admissions-information\/how-to-apply\/the-process\/","title":"How to Apply","text":"Learn more about the application process and requirements."}}},"field_apply_link_transform":{"value":"https:\/\/app.applyyourself.com\/AYApplicantLogin\/fl_ApplicantConnectLogin.asp?id=neu-grad"},"field_requirements_transform":{"value":""},"field_key_requirements_transform":{"value":"<ul>\r\n\t<li>Personal statement<\/li>\r\n\t<li>Resumé<\/li>\r\n\t<li>2 letters of recommendation<\/li>\r\n<\/ul>\r\n"},"field_experiential_transform":{"value":"<p>Learning integrated with professional experience is a hallmark of Northeastern and the Roux Institute. Students gain a clear understanding of real-world industry needs in Portland, the state of Maine, and the Northeast—and valued workplace skills like communication and teamwork—through assignments at companies and nonprofit organizations. Students can complete a six-week virtual project relevant to their studies through the university’s <a href=\"https:\/\/careers.northeastern.edu\/experiential-network\/\">Experiential Network (XN)<\/a> of employers, or even for their own company. Or they can apply for four- and six-month, full-time co-op positions. All opportunities enable students to build their resumés, expand their professional networks, and chart a path to in-demand careers.<\/p>\r\n"},"field_finance_blocks":{"value":[{"value":"<span class='bullet-currency'>$<\/span><span class='bullet-value'>26.9<\/span><span class='bullet-units'>K<\/span>","label":"Tuition","modal":"<p dir=\"ltr\"><strong>Estimated Total Tuition<\/strong><\/p>\r\n\r\n<p>This is an estimate based on the tuition rates for Academic Year 2020-2021 and does not include any fees or other expenses. Some courses and labs have tuition rates that may increase or decrease total tuition. Tuition and fees are subject to revision by the president and Board of Trustees at any time. For more detailed information, please visit <a href=\"https:\/\/studentfinance.northeastern.edu\/billing-payments\/tuition-and-fees\/\">Student Financial Services<\/a>.<\/p>\r\n"}]},"field_faculty_section_intro_text":{"value":"<p>Our faculty represents a wide cross-section of professional practices and fields ranging from finance to education to biomedical science to management to the U.S. military. They serve as mentors and advisors and collaborate alongside students to solve the most pressing global challenges facing established and emerging markets.<\/p>\r\n"},"field_student_section_intro_text":{"value":"<p>By enrolling in Northeastern, you gain access to a network of more than 275,000 alumni and 3,350+ employer partners, including Fortune 500 companies, government agencies, and global nongovernmental organizations. Our current students and faculty across strategically located regional locations further foster a lifelong, global community of learning and mentoring.<\/p>\r\n"},"field_curriculum_disclaimer":{"value":"<p>Please note: This curriculum is for marketing purposes only and is subject to change. Official curriculum can be found within the course catalog.<\/p>\r\n"}}