{"id":"18397","title":[{"value":"Graduate Certificate in Applied Analytics - Portland "}],"body":[{"value":"<p>With the proliferation of data across all sectors of the global economy, there is an immediate need for individuals to be knowledgeable in harnessing data for continuous analysis and study. The Graduate Certificate in Applied Analytics prepares students to draw on analytical findings to make key decisions in an organization’s strategy.<\/p>\r\n","summary":"","format":"basic_html"}],"field_accredidation":[],"field_formatted_title":[{"value":"Applied Analytics "}],"field_program_thumbnail":[{"target_id":"2375","alt":"Graduate Certificate in Applied Analytics Portland ","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/Campus_in_Fall_26OCT10_008_0.jpg"}],"field_unique_features":[{"value":"<ul>\r\n\t<li>Program is stackable, allowing for students to take a course as a nondegree professional development option, take a series of courses to earn a certificate, or earn a certificate and stack up to 18 quarter hours (six courses) into the Master of Professional Studies in Analytics.<\/li>\r\n\t<li>Graduates of the certificate will also be eligible for the Double Husky Scholarship, which provides 25% off tuition for the master's program.<\/li>\r\n\t<li>The program is delivered through a hybrid model of online and on-site learning.<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_key_requirements":[{"value":"<ul>\r\n\t<li>Statement of purpose<\/li>\r\n\t<li>Professional resumé<\/li>\r\n\t<li>A BS in engineering or computer science, or previous coursework in math and\/or statistics, is required.<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_sv_id":[{"value":"a2j2L000000w8XdQAI"}],"field_visa_eligible":[{"value":"0"}],"field_total_credit_hours":[{"value":"18"}],"field_accredidation_link":[],"field_sidebar":{"type":"entity","entities":[]},"field_banner_id_er":{"type":"eck","entities":[{"field_degree_iped_code":[{"value":"6"}],"field_level_code":[{"value":"GP"}]}]},"field_curriculum":{"entities":[{"id":"18393","title":[{"value":"Graduate Certificate in Applied Analytics"}],"field_catalog_year":[{"value":"2021"}],"field_level_1_group":{"type":"eck","entities":[{"title":[{"value":"General Requirements"}],"field_group_type":[{"value":"core"}],"field_group_level_2":{"type":"eck","entities":[{"title":[{"value":"Graduate Certificate in Applied Analytics General Requirements"}],"field_requirements":[{"value":"<h3>Required Core Courses<\/h3>\r\n\r\n<p>[course_table id=0]&nbsp;<\/p>\r\n\r\n<h3>Electives<\/h3>\r\n\r\n<p>Complete two of the following:<\/p>\r\n\r\n<p>[course_table id=1]<\/p>\r\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"218","title":[{"value":"ALY 6000 - Introduction to Analytics"}],"field_course_code":[{"value":"ALY 6000"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an overview of analytics concepts and practices across a diverse range of industries and organizational contexts. Provides a hands-on introduction to statistics, data management, and the R scripting language. Technical projects based on introductory statistics and the R language offer students an opportunity to understand and apply the theories, practices, and application of analytics to real-world problems. An initial exploration of data sets illustrates how fundamental data analysis can impact decision making at both the strategic and operational level. Students research case studies to examine careers and professional opportunities in both for-profit and nonprofit industry segments.","format":null}]},{"id":"219","title":[{"value":"ALY 6010 - Probability Theory and Introductory Statistics"}],"field_course_code":[{"value":"ALY 6010"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces statistics for business analytics from an analysis-of-data viewpoint. Topics include frequency distributions; measures of location; mean, median, mode; measures of dispersion, variance, graphic presentation; elementary probability; populations and samples; sampling distributions; and categorical data. Includes a preliminary introduction to regression and correlation. Uses statistical software (for data analysis during analytic project assignments) to provide a hands-on experience to observe how probability and statistics, scripting, and basic data management impact decision making at all levels within a corporation.","format":null}]},{"id":"6827","title":[{"value":"ALY 6015 - Intermediate Analytics"}],"field_course_code":[{"value":"ALY 6015"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Builds on the foundation provided in ALY 6000 and ALY 6010 by exploring at greater depth the tools of data correction and recoding, as well as those of statistics and R. Offers students an opportunity to learn to discern and validate meaningful and statistically significant patterns in data through sound applications of the scientific method. Emphasizes initial mastery of correlation and regression, ANOVA, GLM, and logistic regression. Introduces the more advanced techniques of multivariable regression and nonparametric statistics and sampling. The goal of this course is to offer students an opportunity to master the fundamental skills of data management, analysis, and communication, which are the core data analytical competencies required of today’s analytic professionals.","format":null}]},{"id":"6526","title":[{"value":"ALY 6070 - Communication and Visualization for Data Analytics"}],"field_course_code":[{"value":"ALY 6070"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an interdisciplinary examination of design concepts and cognitive and communication theories that support effective practices for data visualization and communication. Considers the relationship between information and audience and studies effective techniques in the written, spoken, and visual communication of complex quantitative information. Project-based activities offer students opportunities to apply these techniques in a manner that makes data understandable, compelling, and actionable. Introduces R Shiny, Tableau and R in the lab sessions as the tool for data visualization.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"220","title":[{"value":"ALY 6020 - Predictive Analytics"}],"field_course_code":[{"value":"ALY 6020"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the end-to-end, data-driven statistical and predictive modeling approach in R with applications and case studies. Includes all the data and modeling steps in a full modeling cycle, including data ETL process, exploratory data analysis, and data cleansing for outlier imputation and data normalization. Commonly applied modeling techniques such as k-nearest neighbors, GLM, random forest, neural networks, and Naive Bayes are heavily utilized and explained using advanced visualization techniques and simplified mathematical derivations to enhance understanding. Predictive analytic modeling steps such as model training, validation, and testing are widely utilized, as are R and Python for data processing, analysis, and modeling.","format":null}]},{"id":"221","title":[{"value":"ALY 6030 - Data Warehousing and SQL"}],"field_course_code":[{"value":"ALY 6030"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on the management, mining, and interpretation of patterns in large databases. Offers students an opportunity to learn how organizations construct data warehouses from operational databases, about different data warehouse architectures, how to build a data warehouse, and how to structure databases for efficient data mining. Discusses relational databases and Structured Query Language (SQL) for the fundamentals in data modeling, database management, and SQL queries. Introduces other modern database systems such as NoSQL (non SQL) and column-based databases.","format":null}]},{"id":"6525","title":[{"value":"ALY 6040 - Data Mining Applications"}],"field_course_code":[{"value":"ALY 6040"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the theories and tools for intensive data analysis methods and data mining techniques such as rule-based learning, decision trees, clustering, and association-rule mining. Also covers interpretation of the mined patterns using visualization techniques. Offers students an opportunity to gain the knowledge and experience to apply modern data-mining techniques for effective large-scale data pattern recognition and insight discovery. Introduces data analysis software; student teams evaluate, analyze, and report data for the methods used and insights discovered during case studies.","format":null}]},{"id":"226","title":[{"value":"ALY 6110 - Data Management and Big Data"}],"field_course_code":[{"value":"ALY 6110"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Designed to provide the student with the core concepts of data collection and management. Topics include systems for collecting data and implications for practice; types of data (textual, quantitative, qualitative, etc.); and storing data with privacy and security issues in mind. Offers students an opportunity to obtain a high-level understanding of big data technologies for data accessibility, efficiency, and security of data management at scale, including big data storage and computing technologies and big data analytics applications. Students create a working system for data acquisition and management using publicly available data sets and evaluate traditional data warehouse platforms as well as cloud-based big data storage and computing technologies. Azure is also introduced and used in the lab sessions.","format":null}]}]}}]}}]}}]}}]},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}],"description":[{"value":"","format":null}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}],"description":[{"value":"","format":null}]},{"tid":"4","name":[{"value":"Part-Time"}],"description":[{"value":"","format":null}]}],"nids":["3","4"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"},"field_pan":{"entities":[],"nids":[],"type":"taxonomy"},"field_degree_type":{"entities":[{"tid":"39","name":[{"value":"Certificate"}],"description":[{"value":"","format":null}]}],"nids":["39"],"type":"taxonomy"},"field_undergrad_degree_type":{"entities":[],"nids":[],"type":"taxonomy"},"field_area_of_study":{"entities":[{"tid":"67","name":[{"value":"Analytics"}],"description":[{"value":"","format":null}],"field_slug":[{"value":"analytics"}]}],"nids":["67"],"type":"taxonomy"},"field_study_options":{"entities":[{"tid":"41","name":[{"value":"Hybrid"}],"description":[{"value":"","format":null}]}],"nids":["41"],"type":"taxonomy"},"field_entry_terms":{"entities":[{"tid":"77","name":[{"value":"Fall"}]},{"tid":"78","name":[{"value":"Spring"}]},{"tid":"79","name":[{"value":"Summer"}]},{"tid":"80","name":[{"value":"Winter"}]}],"nids":["77","78","79","80"],"type":"taxonomy"},"field_program_family":{"type":"entity","entities":[{"title":[{"value":"Applied Analytics"}],"field_college":{"type":"entity","entities":[{"id":"121","title":[{"value":"College of Professional Studies"}],"field_experiential_learning":[{"value":"<p>Northeastern's signature experience-powered learning model has been at the heart of the university for more than a century. It combines world-class academics with professional practice, allowing you to acquire relevant, real-world skills you can immediately put into action in your current workplace. This makes a Northeastern education a dynamic, transformative experience, giving you countless opportunities to grow as a professional and person.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n","format":"basic_html"}],"field_requirements":[{"value":"<ul>\r\n\t<li>Online application<\/li>\r\n\t<li>Statement of purpose (500–1000 words): Identify your educational goals and expectations of the program. Please be aware that Northeastern University's academic policy on plagiarism applies to your statement of purpose.<\/li>\r\n\t<li>Professional resumé<\/li>\r\n\t<li>Unofficial undergraduate transcripts; official transcripts required at the time of admission<\/li>\r\n\t<li>Two letters of recommendation from individuals who have either academic or professional knowledge of your capabilities such as a faculty member, colleague, or mentor, preferably one from your current employer<\/li>\r\n\t<li>English language proficiency proof. Students for whom English is not their primary language must submit one of the following:\r\n\t<ul>\r\n\t\t<li>Official associate or bachelor's degree transcript from an accredited college or university in the U.S., stating degree conferral and date<\/li>\r\n\t\t<li>TOEFL, IELTS, PTE, Duolingo, or NU Global Exam scores<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_college_link":[{"value":"https:\/\/cps.northeastern.edu\/"}]}]},"program":{"entities":[{"id":"18364","title":[{"value":"Graduate Certificate in Applied Analytics - Boston "}]},{"id":"18368","title":[{"value":"Graduate Certificate in Applied Analytics - Online "}]},{"id":"18369","title":[{"value":"Graduate Certificate in Applied Analytics - Seattle "}]},{"id":"18397","title":[{"value":"Graduate Certificate in Applied Analytics - Portland "}]}]}}]},"field_hero_image":[{"target_id":"2374","alt":"","title":"","width":"480","height":"290","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/Campus_in_Fall_26OCT10_008%20%281%29_0.jpg"}],"field_hero_video_mp4":[],"field_hero_video_webm":[],"field_overview":[],"field_program_description_long":[{"value":"<p>In a global environment characterized by digital transformation, rapid change, and high levels of uncertainty, the ability to hire, reskill, and upskill analytic talent is a major driver of organizational performance. The Graduate Certificate in Applied Analytics will prepare students to develop analytical skills that will support decision-making in an organization’s strategy. The certification focuses on analytical, technological, and human literacies—with an emphasis on experiential learning—required for students to serve as strategic business partners in their organizations.<\/p>\r\n\r\n<p>A total of 18 credit hours are required to complete the analytical certification program.<\/p>\r\n\r\n<p>All Roux Institute programs provide content relevant to the urgent and emerging needs of industry in Maine and the rapidly evolving regional, national, and global economy. Opportunities for experiential learning will be concentrated in Portland, the state of Maine, and the Northeast region. Students are encouraged to pursue co-ops and special virtual Experiential Network projects with the institute’s founding corporate partners, a group of leading employers in Maine.<\/p>\r\n\r\n<hr \/>\r\n<h3>More Details<\/h3>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Unique Features<\/h4>\r\n\r\n<ul>\r\n\t<li>Program is stackable, allowing for students to take a course as a nondegree professional development option, take a series of courses to earn a certificate, or earn a certificate and stack up to 18 quarter hours (six courses) into the Master of Professional Studies in Analytics.<\/li>\r\n\t<li>Graduates of the certificate will also be eligible for the Double Husky Scholarship, which provides 25% off tuition for the master's program.<\/li>\r\n\t<li>The program is delivered through a hybrid model of online and on-site learning.<\/li>\r\n<\/ul>\r\n<\/div>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Program Objectives<\/h4>\r\n\r\n<ul>\r\n\t<li>Demonstrate the foundational knowledge and skills critical to pursue data analytics as a profession in relation to statistics and math.<\/li>\r\n\t<li>Articulate and effectively defend the significance and implications of work in data analytics in terms of challenges and trends in a local, national, or global context.<\/li>\r\n\t<li>Demonstrate the knowledge of advanced tools in data analytics.<\/li>\r\n\t<li>Articulate and effectively defend the significance of leadership, governance, and ethics in data analytics in terms of challenges and trends in a local, national, or global context.<\/li>\r\n\t<li>Apply the principles, tools, and methods of analytics to a comprehensive real-world problem or project related to data analyses for tactical and\/or strategic decision-making.<\/li>\r\n\t<li>Integrate the major theories, tools, and approaches in data analytics to identify data-driven insights for informed business process management.<\/li>\r\n\t<li>Design and deliver presentations, reports, and recommendations that effectively translate technical results\/data solutions and are coherent and persuasive to different audiences.<\/li>\r\n<\/ul>\r\n<\/div>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Career Outlook<\/h4>\r\n\r\n<p>Graduates will have the skills to understand and analyze data. Those who are data-literate are needed and valued across all industries, departments, and seniority levels, making careers in analytics a potentially lucrative one for people of all backgrounds.<\/p>\r\n\r\n<p>In-demand data-oriented careers include business intelligence analyst, business\/management analyst, compensation\/benefits analyst, financial analyst, HRIS analyst, and operations analyst.<\/p>\r\n<\/div>\r\n","format":"basic_html"}],"field_requirements":[{"value":"<ul>\r\n\t<li>Online application<\/li>\r\n\t<li>Statement of purpose (500-1,000 words): Identifies your educational goals and expectations of the program. Please be aware that the university's academic policy on plagiarism applies to your statement of purpose.<\/li>\r\n\t<li>Professional resumé<\/li>\r\n\t<li>Unofficial undergraduate transcripts; official transcripts required at the time of admission<\/li>\r\n\t<li>English language proficiency proof. Students for whom English is not their primary language must submit one of the following:\r\n\t<ul>\r\n\t\t<li>Official associate or bachelor's degree transcript form an accredited college or university in the U.S., stating degree conferral and date<\/li>\r\n\t\t<li>TOEFL, IELTS, PTE, Duolingo, or NU Global Exam scores<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n\t<li>A BS in engineering or computer science, or previous coursework in math and\/or statistics, is required.<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_requirements_append":[{"value":"0"}],"field_marketo_form_one":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-1A-1B_P-CERTG-APAN-Simple-POI-1A.html"}],"field_marketo_form_two":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-1A-1B_P-CERTG-APAN-ALL-GRAD-POI-Hidden-1B.html"}],"field_marketo_form_three":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-2_P-CERTG-APAN-No-POI-Form-2.html"}],"field_marketo_form_four":[{"value":"https:\/\/pages.northeastern.edu\/GRAD-WEBS-Prog-Page-iFrames-4_P-CERTG-APAN-Find-Out-More-Bottom-ALL-GRAD-POI-Hidden.html"}],"field_program_experience":[{"value":"<p>Learning integrated with professional experience is a hallmark of Northeastern and the Roux Institute. Students gain a clear understanding of real-world industry needs in Portland, the state of Maine, and the Northeast—and valued workplace skills like communication and teamwork—through assignments at companies and nonprofit organizations. Students can complete a six-week virtual project relevant to their studies through the university’s <a href=\"https:\/\/careers.northeastern.edu\/experiential-network\/\">Experiential Network (XN)<\/a> of employers, or even for their own company. Or they can apply for four- and six-month, full-time co-op positions. All opportunities enable students to build their resumés, expand their professional networks, and chart a path to in-demand careers.<\/p>\r\n","format":"basic_html"}],"field_testimonials":{"entities":[]},"field_faculty_overview":[],"field_students_overview":[],"field_duration":[{"value":"6-12 months"}],"field_accreditation_abbreviation":[],"field_related_program":{"type":"entity","entities":[]},"field_related_program_2":{"type":"entity","entities":[]},"field_finance_tuition_calc":[{"value":"{\"tuitionCalcOption\":\"costPerProgram\",\"fields\":{\"costPerCreditHour\":\"755.00\",\"price\":\"16000\",\"tuitionCustomLabel\":\"P\",\"tuition\":\"17600\"},\"tuitionCalcValue\":17600,\"tuitionCalcLabel\":\"Tuition\"}"}],"field_hide_tuition_costs":[{"value":"0"}],"field_finance_program_fees":[],"field_finance_aid":[],"field_finance_percent_aid":[],"field_finance_information":[],"field_finance_link":[],"field_finance_link_one_source":[{"value":"global"}],"field_finance_link_one_link":[],"field_finance_link_one_text":[],"field_finance_link_two_source":[{"value":"global"}],"field_finance_link_two_link":[],"field_finance_link_two_text":[],"field_admissions_deadline_source":[{"value":"program"}],"field_admissions_intro_text":[],"field_admissions_tables":{"type":"eck","entities":[{"title":[{"value":"Spring 2021"}],"field_table_header_col1":[],"field_table_header_col2":[{"value":"Recommended Admissions Deadline:"}],"field_admissions_table_rows":{"type":"eck","entities":[{"field_table_row_col1":[{"value":"Domestic application complete (first half start: April 12, 2021)"}],"field_table_row_col2":[{"value":"April 2, 2021"}]},{"field_table_row_col1":[{"value":"Domestic application complete (second half start: May 24, 2021)"}],"field_table_row_col2":[{"value":"May 14, 2021"}]}]}},{"title":[{"value":"Fall 2021"}],"field_table_header_col1":[],"field_table_header_col2":[{"value":"Recommended Admissions Deadline"}],"field_admissions_table_rows":{"type":"eck","entities":[{"field_table_row_col1":[{"value":"Domestic application complete (first half start: September 20, 2021)"}],"field_table_row_col2":[{"value":"September 7, 2021"}]},{"field_table_row_col1":[{"value":"Domestic application complete (second half start: November 1, 2021)"}],"field_table_row_col2":[{"value":"October 18, 2021"}]}]}},{"title":[{"value":"Winter 2022"}],"field_table_header_col1":[],"field_table_header_col2":[{"value":"Recommended Admissions Deadline"}],"field_admissions_table_rows":{"type":"eck","entities":[{"field_table_row_col1":[{"value":"Domestic application complete (first half start: January 10, 2022)"}],"field_table_row_col2":[{"value":"December 20, 2021"}]},{"field_table_row_col1":[{"value":"Domestic application complete (second half start: February 22, 2022)"}],"field_table_row_col2":[{"value":"February 8, 2022"}]}]}},{"title":[{"value":"Spring 2022"}],"field_table_header_col1":[],"field_table_header_col2":[{"value":"Recommended Admissions Deadline"}],"field_admissions_table_rows":{"type":"eck","entities":[{"field_table_row_col1":[{"value":"Domestic application complete (first half start: April 11, 2022)"}],"field_table_row_col2":[{"value":"March 28, 2022"}]},{"field_table_row_col1":[{"value":"Domestic application complete (May 23, 2022)"}],"field_table_row_col2":[{"value":"May 9, 2022"}]}]}},{"title":[{"value":"Summer 2022"}],"field_table_header_col1":[],"field_table_header_col2":[{"value":"Recommended Admissions Deadline"}],"field_admissions_table_rows":{"type":"eck","entities":[{"field_table_row_col1":[{"value":"Domestic application complete (first half start: July 11, 2022)"}],"field_table_row_col2":[{"value":"June 27, 2022"}]},{"field_table_row_col1":[{"value":"Domestic application complete (second half start: August 8, 2022)"}],"field_table_row_col2":[{"value":"July 25, 2022"}]}]}}]},"field_admissions_link_one_source":[{"value":"college"}],"field_admissions_link_one_link":[],"field_admissions_link_one_text":[],"field_admissions_link_two_source":[{"value":"college"}],"field_admissions_link_two_link":[],"field_admissions_link_two_text":[],"field_apply_text":[],"field_apply_link":[],"field_apply_link_source":[{"value":"college"}],"field_admissions_section_intro_text":{"value":"<p>A graduate degree or&nbsp;certificate from Northeastern—a top-50 university—can accelerate your career through rigorous academic coursework and hands-on professional experience in the area of your interest. Apply now—and take your career to the next level.<\/p>\r\n"},"field_admissions_deadlines":{"value":{"intro_text":"","tables":[{"title":"Spring 2021","header":[null,"Recommended Admissions Deadline:"],"rows":[["Domestic application complete (first half start: April 12, 2021)","April 2, 2021"],["Domestic application complete (second half start: May 24, 2021)","May 14, 2021"]]},{"title":"Fall 2021","header":[null,"Recommended Admissions Deadline"],"rows":[["Domestic application complete (first half start: September 20, 2021)","September 7, 2021"],["Domestic application complete (second half start: November 1, 2021)","October 18, 2021"]]},{"title":"Winter 2022","header":[null,"Recommended Admissions Deadline"],"rows":[["Domestic application complete (first half start: January 10, 2022)","December 20, 2021"],["Domestic application complete (second half start: February 22, 2022)","February 8, 2022"]]},{"title":"Spring 2022","header":[null,"Recommended Admissions Deadline"],"rows":[["Domestic application complete (first half start: April 11, 2022)","March 28, 2022"],["Domestic application complete (May 23, 2022)","May 9, 2022"]]},{"title":"Summer 2022","header":[null,"Recommended Admissions Deadline"],"rows":[["Domestic application complete (first half start: July 11, 2022)","June 27, 2022"],["Domestic application complete (second half start: August 8, 2022)","July 25, 2022"]]}]}},"field_admissions_links":{"value":{"one":{"url":"https:\/\/www.northeastern.edu\/graduate\/admissions-information\/how-to-apply\/applying-as-an-international-student\/","title":"Are You an International Student?","text":"Find out what additional documents are required to apply."},"two":{"url":"https:\/\/cps.northeastern.edu\/admissions-aid\/graduate-admissions\/","title":"Admissions Details","text":"Learn more about the College of Professional Studies admissions process, policies, and required materials."}}},"field_financial_links":{"value":{"one":{"url":"https:\/\/studentfinance.northeastern.edu\/#_ga=2.59552109.19549433.1506949601-148400310.1505504629","title":"Finance Your Education","text":"We offer a variety of resources, including scholarships and assistantships."},"two":{"url":"https:\/\/www.northeastern.edu\/graduate\/admissions-information\/how-to-apply\/the-process\/","title":"How to Apply","text":"Learn more about the application process and requirements."}}},"field_apply_link_transform":{"value":"https:\/\/app.applyyourself.com\/AYApplicantLogin\/fl_ApplicantLogin.asp?id=NEU-CPS&_ga=2.15527222.1824387636.1524836665-81214367.1520869011"},"field_requirements_transform":{"value":"<ul>\r\n\t<li>Online application<\/li>\r\n\t<li>Statement of purpose (500-1,000 words): Identifies your educational goals and expectations of the program. Please be aware that the university's academic policy on plagiarism applies to your statement of purpose.<\/li>\r\n\t<li>Professional resumé<\/li>\r\n\t<li>Unofficial undergraduate transcripts; official transcripts required at the time of admission<\/li>\r\n\t<li>English language proficiency proof. Students for whom English is not their primary language must submit one of the following:\r\n\t<ul>\r\n\t\t<li>Official associate or bachelor's degree transcript form an accredited college or university in the U.S., stating degree conferral and date<\/li>\r\n\t\t<li>TOEFL, IELTS, PTE, Duolingo, or NU Global Exam scores<\/li>\r\n\t<\/ul>\r\n\t<\/li>\r\n\t<li>A BS in engineering or computer science, or previous coursework in math and\/or statistics, is required.<\/li>\r\n<\/ul>\r\n"},"field_key_requirements_transform":{"value":"<ul>\r\n\t<li>Statement of purpose<\/li>\r\n\t<li>Professional resumé<\/li>\r\n\t<li>A BS in engineering or computer science, or previous coursework in math and\/or statistics, is required.<\/li>\r\n<\/ul>\r\n"},"field_experiential_transform":{"value":"<p>Learning integrated with professional experience is a hallmark of Northeastern and the Roux Institute. Students gain a clear understanding of real-world industry needs in Portland, the state of Maine, and the Northeast—and valued workplace skills like communication and teamwork—through assignments at companies and nonprofit organizations. Students can complete a six-week virtual project relevant to their studies through the university’s <a href=\"https:\/\/careers.northeastern.edu\/experiential-network\/\">Experiential Network (XN)<\/a> of employers, or even for their own company. Or they can apply for four- and six-month, full-time co-op positions. All opportunities enable students to build their resumés, expand their professional networks, and chart a path to in-demand careers.<\/p>\r\n"},"field_finance_blocks":{"value":[{"value":"<span class='bullet-currency'>$<\/span><span class='bullet-value'>17.6<\/span><span class='bullet-units'>K<\/span>","label":"Tuition","modal":"<p dir=\"ltr\"><strong>Estimated Total Tuition<\/strong><\/p>\r\n\r\n<p>This is an estimate based on the tuition rates for Academic Year 2020-2021 and does not include any fees or other expenses. Some courses and labs have tuition rates that may increase or decrease total tuition. Tuition and fees are subject to revision by the president and Board of Trustees at any time. For more detailed information, please visit <a href=\"https:\/\/studentfinance.northeastern.edu\/billing-payments\/tuition-and-fees\/\">Student Financial Services<\/a>.<\/p>\r\n"}]},"field_faculty_section_intro_text":{"value":"<p>Our faculty represents a wide cross-section of professional practices and fields ranging from finance to education to biomedical science to management to the U.S. military. They serve as mentors and advisors and collaborate alongside students to solve the most pressing global challenges facing established and emerging markets.<\/p>\r\n"},"field_student_section_intro_text":{"value":"<p>By enrolling in Northeastern, you gain access to a network of more than 275,000 alumni and 3,350+ employer partners, including Fortune 500 companies, government agencies, and global nongovernmental organizations. Our current students and faculty across strategically located regional locations further foster a lifelong, global community of learning and mentoring.<\/p>\r\n"},"field_curriculum_disclaimer":{"value":"<p>Please note: This curriculum is for marketing purposes only and is subject to change. Official curriculum can be found within the course catalog.<\/p>\r\n"}}