{"id":"19055","title":[{"value":"Master of Science in Bioengineering - Portland "}],"body":[{"value":"<p>The Master of Science in Bioengineering offered at the Roux Institute in Portland, Maine, is designed to advance medicine as an engineering discipline. It equips you with the skills to apply computational models and algorithms to patient data, ultimately helping physicians make critical healthcare decisions tailored to the needs of the individual.<\/p>\r\n","summary":"","format":"basic_html"}],"field_accredidation":[],"field_formatted_title":[{"value":"Bioengineering"}],"field_program_thumbnail":[{"target_id":"2568","alt":"Master of Science in Bioengineering - Portland","title":"","width":"67","height":"100","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2022-01\/iStock_000024400239XXLarge_1.jpeg"}],"field_unique_features":[],"field_key_requirements":[],"field_sv_id":[{"value":"a2j1a000000E75RAAS"}],"field_visa_eligible":[{"value":"1"}],"field_total_credit_hours":[{"value":"32"}],"field_accredidation_link":[],"field_sidebar":{"type":"entity","entities":[]},"field_banner_id_er":{"type":"eck","entities":[{"field_degree_iped_code":[{"value":"7"}],"field_level_code":[{"value":"GR"}]}]},"field_curriculum":{"entities":[{"id":"18531","title":[{"value":"MSBioE Bioengineering"}],"field_catalog_year":[{"value":"2021"}],"field_level_1_group":{"type":"eck","entities":[{"title":[{"value":"General Requirements"}],"field_group_type":[{"value":"core"}],"field_group_level_2":{"type":"eck","entities":[{"title":[{"value":"Master of Science in Bioengineering General Requirements"}],"field_requirements":[{"value":"<p><em>Note:&nbsp;<\/em>This major requires a concentration: biomedical devices and bioimaging,&nbsp;cell and tissue engineering, or&nbsp;biomechanics. Consult your college administrator.<\/p>\r\n\r\n<h3>Seminar<\/h3>\r\n\r\n<p>[course_table id=0]<\/p>\r\n\r\n<h3>Required Core<\/h3>\r\n\r\n<p>A grade of C or higher is required in each course:<br \/>\r\n[course_table id=1]<\/p>\r\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"508","title":[{"value":"BIOE 7390 - Seminar"}],"field_course_code":[{"value":"BIOE 7390"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"0.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents topics of an advanced nature by staff, outside speakers, and students in the graduate program. This course must be attended every semester by all full-time graduate students. May be repeated without limit.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"10555","title":[{"value":"BIOE 6100 - Medical Physiology"}],"field_course_code":[{"value":"BIOE 6100"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Designed to provide bioengineering students with a working knowledge of the integrated behavior of organs and systems in the human body. As such, the student is provided with a comprehensive and intense immersion in each physiological subsystem with the expectation that he or she display knowledge of each at the level equivalent to that of a second-year medical student following his or her exposure to physiology. The specific subsystems covered are muscle physiology, cardiovascular physiology with ECG interpretation, pulmonary physiology with gas exchange mechanics and ventilation\/perfusion, renal physiology and water balance, regulation of pH, gastrointestinal physiology, temperature regulation and energy balance, endocrine systems, and reproductive systems. The course does not cover neurophysiology.","format":null}]},{"id":"498","title":[{"value":"BIOE 6000 - Principles of Bioengineering"}],"field_course_code":[{"value":"BIOE 6000"}],"field_credits":[{"value":"1.00"}],"field_credit_low":[{"value":"1.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers the fundamentals of bioengineering research topics and methodology for master&#8217;s-level bioengineering students. Internal and external speakers discuss general topics in bioengineering, including the medical device qualification and regulatory environment, tissue engineering, cell engineering, mechanobiology, drug delivery, bioimaging, neuromotor control, and effective design of experiments. Each student is expected to read, critically evaluate, and present research in a peer-reviewed bioengineering journal article.","format":null}]}]}}]}}]}},{"title":[{"value":"Concentrations"}],"field_group_type":[{"value":"concentration"}],"field_group_level_2":{"type":"eck","entities":[{"title":[{"value":"Biomedical Devices and Bioimaging"}],"field_requirements":[{"value":"<h4>Required Coursework<\/h4>\r\n\r\n<p>A grade of C or higher is required.&nbsp;&nbsp; &nbsp;<\/p>\r\n\r\n<p>[course_table id=0]<\/p>\r\n\r\n<h4>Coursework Option<\/h4>\r\n\r\n<p>Complete 16 semester hours from the course list.<\/p>\r\n\r\n<h4>Project Option<\/h4>\r\n\r\n<p>[course_table id=1]<\/p>\r\n\r\n<p>Complete 12&nbsp;semester hours from the course list.<\/p>\r\n\r\n<h4>Thesis Option<\/h4>\r\n\r\n<p>Complete the following (repeatable) course twice:<\/p>\r\n\r\n<p>[course_table id=2]<\/p>\r\n\r\n<p>Complete 8 semester hours from the course list.<\/p>\r\n\r\n<h4>Course List<\/h4>\r\n\r\n<p>[course_table id=3]<\/p>\r\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"488","title":[{"value":"BIOE 5235 - Biomedical Imaging"}],"field_course_code":[{"value":"BIOE 5235"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Presents the foundations of modern medical imaging, including imaging principles, imaging mathematics, imaging physics, and image-generation techniques. Includes X-ray, ultrasound, computed tomography, and magnetic resonance imaging.","format":null}]},{"id":"489","title":[{"value":"BIOE 5250 - Design, Manufacture, and Evaluation of Medical Devices"}],"field_course_code":[{"value":"BIOE 5250"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers engineering design challenges intrinsic to the development of biomedical devices, including clinical evaluation, manufacture, and testing of medical devices and the constraints that FDA regulations place on these processes. Topics include quality systems, design control, cybersecurity concerns, the role of standards in global device regulation, and the design process. Students are asked to form teams and to carry out a semester-long conceptual design project to develop a design overview, design plan, design input specifications, and verification test procedures for a novel medical device.","format":null}]},{"id":"495","title":[{"value":"BIOE 5810 - Design of Biomedical Instrumentation"}],"field_course_code":[{"value":"BIOE 5810"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Investigates the principles of biology and engineering underlying the design and use of biomedical instrumentation. Topics include design of a broad range of instrumentation and monitoring devices, sensors, and integrated systems. Graduate students interested in taking this course should have completed an equivalent introductory circuits course.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"510","title":[{"value":"BIOE 7890 - Master&#8217;s Project"}],"field_course_code":[{"value":"BIOE 7890"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers analytical and\/or experimental work leading to a written report and a final short presentation by the end of the semester.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"512","title":[{"value":"BIOE 7990 - Thesis"}],"field_course_code":[{"value":"BIOE 7990"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers analytical, research, and\/or experimental work conducted under the auspices of the department. May be repeated once.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"10705","title":[{"value":"BIOE 5115 - Dynamical Systems in Biological Engineering"}],"field_course_code":[{"value":"BIOE 5115"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the theoretical analysis and modeling of dynamical systems in biology, ranging from molecular to population applications. Topics include difference and differential equation models, with basic theory including nondimensionalization, steady states, linearization, stability, eigenvalues, global behavior, singular perturbations, multistability, hysteresis, cooperativity, periodic solutions, excitable systems, bifurcations; and an introduction to spatial (PDE) models. Develops all concepts in the context of concrete biological applications, such as gene regulation; chemical reaction networks and stoichiometry; drug models and PK\/PD; receptor\/ligand interactions; synthetic constructs; action potential generation; enzymatic reactions; population interactions; epidemiology; epigenetic phenomena, including differentiation and transport; chemotaxis; and diffusion.","format":null}]},{"id":"6531","title":[{"value":"BIOE 5320 - Advanced Biomedical Measurements and Instrumentation"}],"field_course_code":[{"value":"BIOE 5320"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers a comprehensive analysis of the principles underlying biomedical instrumentation, including ECG, EEG, CAT scanning, MRI imaging, and other biomedical laboratory tools. Includes associated laboratory exercises within the course material.","format":null}]},{"id":"10948","title":[{"value":"BIOE 5648 - Biomedical Optics"}],"field_course_code":[{"value":"BIOE 5648"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers biomedical optics and discusses the theory and practice of biological and medical applications of lasers. Topics covered include fundamentals of light propagation in biological tissues; light-matter interactions such as elastic and inelastic scattering; fluorescence and phosphorescence; diagnostic imaging techniques such as confocal fluorescence microscopy, diffuse optical tomography, and optical coherence tomography; and therapeutic interventional techniques, including photodynamic therapy, laser thermal therapies, and fluorescence-guided surgeries. EECE 5648 and BIOE 5648 are cross-listed.","format":null}]},{"id":"496","title":[{"value":"BIOE 5820 - Biomaterials"}],"field_course_code":[{"value":"BIOE 5820"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers a broad overview of the field of biomaterials (materials used in medical devices that interact with living tissues). Introductory lectures cover biomaterials and their translation from the laboratory to the medical marketplace. Discusses important biomaterials terminology and concepts. Emphasizes material structure-property-function-testing relationships and discusses specific materials used in medical devices and drug delivery. Concludes with introductions to topics in the field, such as biomaterials-tissue interactions, tissue engineering, and regulatory requirements. Considers principles of device design as related to the selection and application of biomaterials.","format":null}]},{"id":"497","title":[{"value":"BIOE 5850 - Design of Implants"}],"field_course_code":[{"value":"BIOE 5850"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Uses an interdisciplinary approach to evaluate how a team designs medical implants to meet unmet clinical needs. Covers biomaterials, interfacial phenomena\/surface science, phenomena\/surface science, the lymphatic system, immune response, aging, mechanical factors, sterilization methods, and human factors. Presents exogenous factors, including intellectual property, regulatory requirements, affordability, product liability, and bioethics. The class is divided into teams that design proprietary medical devices using a unit processes\/case study approach presented by experts with firsthand experience in meeting unmet market needs.","format":null}]},{"id":"504","title":[{"value":"BIOE 7100 - Special Topics in Biomedical Imaging and Signal Processing"}],"field_course_code":[{"value":"BIOE 7100"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers various topics of interest in biomedical imaging and signal processing for advanced study depending on the interests of the faculty and students. May be repeated up to two times.","format":null}]},{"id":"509","title":[{"value":"BIOE 7400 - Special Topics in Biomedical Devices"}],"field_course_code":[{"value":"BIOE 7400"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers various topics of interest in biomedical devices for advanced study depending upon the interests of the faculty and students. May be repeated up to two times.","format":null}]},{"id":"2101","title":[{"value":"EECE 5606 - Micro- and Nanofabrication"}],"field_course_code":[{"value":"EECE 5606"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides an overview of integrated circuit fabrication from the viewpoint of a process engineer. Offers students an opportunity to fabricate micro- and nanoscale devices in integrated lab sessions. Focuses on the physics, chemistry, and technology of integrated circuit fabrication in the lecture portion of the course, while students fabricate and test novel devices (an electrohydrodynamic micropump and three-dimensional carbon nanotube interconnects) in integrated lab sessions. Concentrates on silicon IC technology but also includes examples from other materials and device systems including microelectromechanical (MEMS) technologies that are used to build devices such as accelerometers, pressure sensors, and switches for telecommunications and other current examples provided from nanofabrication and nanotechnology. Lab hours are arranged.","format":null}]},{"id":"2132","title":[{"value":"EECE 7105 - Optics for Engineers"}],"field_course_code":[{"value":"EECE 7105"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Provides an introductory graduate course in optics, presenting the engineering concepts necessary to understand and evaluate electro-optical systems. Begins with a brief but rigorous treatment of geometric optics, including matrix methods, aberrations, and pupils and windows, with practical examples of optical instruments and electro-optical systems. Topics include polarization, interference, diffraction, and optical properties of crystals, thin films, optical resonators, guided waves, modulators, and detectors. Presents concepts with examples from modern optical systems such as LIDAR, fiber-optical sensors, range finders, infrared systems, and optical communication systems. Requires a Bachelor of science in engineering or physics.","format":null}]},{"id":"2133","title":[{"value":"EECE 7200 - Linear Systems Analysis"}],"field_course_code":[{"value":"EECE 7200"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers fundamental algebraic concepts and algebraic structures. Topics include linear operators and their representations; matrices, algebraic equations, equivalence, and similarity transformations; introduction to the state-variable theory of continuous and discrete linear systems; standard canonical representations, the concept of state, and the representation of interconnected systems, linear spaces, the state equations, and their solution; stability; and introduction to the general control problem in terms of controllability and observability.","format":null}]},{"id":"2136","title":[{"value":"EECE 7203 - Complex Variable Theory and Differential Equations"}],"field_course_code":[{"value":"EECE 7203"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Comprises the theory of functions of a complex variable. Covers Cauchy&#8217;s integral and related theorems, Taylor and Laurent series, analytic continuation, and multivalued functions. Considers special functions of mathematical physics using generating functions, Taylor and Laurent expansions, and various integral representations. Reviews applications of complex variable theory drawn from optics and electromagnetic theory and from digital signal processing and digital communications. Focuses on the theory of ordinary and partial differential equations of mathematical physics. Develops series solutions of ordinary differential equations of second order using the tools of complex variable theory. Covers Sturm-Liouville theory and uses it to develop eigen function and Green function solutions of homogeneous and inhomogeneous partial differential equations. Requires knowledge of undergraduate advanced calculus.","format":null}]},{"id":"2137","title":[{"value":"EECE 7204 - Applied Probability and Stochastic Processes"}],"field_course_code":[{"value":"EECE 7204"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers fundamentals of probability and stochastic processes with applications to estimation and queuing theory. Includes basic laws of probability, conditioning, and Bayes rule. Topics include random variables and their functions; PDF, PMF, and CDF notions; statistical averages; moments and characteristic functions; multiple random variables; joint and conditional PDF and PMF; multiple functions of random variables; correlation and covariance; mean squared estimation of random variables; Markov, Chebychev, and Chernov inequalities; various notions of convergence of random variable sequences; laws of large numbers; central limit theorem; and large deviation theory. As time permits, discusses basic notions of estimation and properties of estimators, unbiased and minimum variance estimation, CRLB, sufficient statistics, consistency of estimators, basic notions of discrete and continuous-time random processes, mean and autocorrelation function, WSS and cyclo-stationary processes, ergodicity of random processes, and other topics. Requires a strong understanding of linear systems, transform techniques, and linear algebra.","format":null}]},{"id":"4289","title":[{"value":"ME 5657 - Finite Element Method"}],"field_course_code":[{"value":"ME 5657"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on numerical techniques for solving engineering problems. Topics include introduction to the finite element method; methods of approximations and variational methods; Rayleigh-Ritz method and Galerkin formulation; interpolation functions; truss, beam, plate, shell, and solid elements; stiffness matrix and assembly of element equations; application of finite element method in fluid and heat transfer problems; linear, nonlinear, and transient problems; numerical integration and methods of solving systems of equations for static and dynamic problems; and use of a finite element general-purpose commercial package. Permission of instructor required for undergraduate students.","format":null}]},{"id":"4724","title":[{"value":"NNMD 5370 - Nanomedicine Research Techniques"}],"field_course_code":[{"value":"NNMD 5370"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an in-depth look at laboratory methods and tools for studying nanomaterials used in biology and medicine. Includes hands-on sessions with experts in nanoparticle synthesis, electron microscopy, optical microscopy, magnetic resonance imaging, high-performance liquid chromatography, in vitro measurements of nanoparticle bioactivity and cytotoxicity, and in vivo measurements of treatment efficacy.","format":null}]}]}}]}},{"title":[{"value":"Cell and Tissue Engineering"}],"field_requirements":[{"value":"<h4>Required Coursework<\/h4>\r\n\r\n<p>A grade of C or higher is required.<\/p>\r\n\r\n<p>[course_table id=0]<\/p>\r\n\r\n<h4>Coursework Option<\/h4>\r\n\r\n<p>Complete 19-20 semester hours from the course list.<\/p>\r\n\r\n<h4>Project Option<\/h4>\r\n\r\n<p>[course_table id=1]<\/p>\r\n\r\n<p>Complete 15-16 semester hours from the course list.<\/p>\r\n\r\n<h4>Thesis Option<\/h4>\r\n\r\n<p>Complete the following (repeatable) course twice:<\/p>\r\n\r\n<p>[course_table id=2]<\/p>\r\n\r\n<p>Complete 11-12 semester hours from the course list.<\/p>\r\n\r\n<h4>Course List<\/h4>\r\n\r\n<p>[course_table id=3]<\/p>\r\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"491","title":[{"value":"BIOE 5410 - Molecular Bioengineering"}],"field_course_code":[{"value":"BIOE 5410"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the fundamentals of molecular structure and function that underpin engineering of biological macromolecules. Builds on this base with the application of design concepts for molecules and methods of structural and functional analyses and strategies for design and redesign of therapeutic molecules. Projects seek to provide students with experience in conceptual design to create strategies to address significant health concerns.","format":null}]},{"id":"492","title":[{"value":"BIOE 5420 - Cellular Engineering"}],"field_course_code":[{"value":"BIOE 5420"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Analyzes the techniques that form the foundation of molecular cell engineering, including recombinant DNA, cloning and genomics, prokaryotic and eukaryotic gene regulation and single-cell gene expression, structure, dynamics of gene regulatory networks, metabolism and cellular energetics, cell structure, cytoskeleton and cellular motors, synthetic gene circuits, and metabolic engineering.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"510","title":[{"value":"BIOE 7890 - Master&#8217;s Project"}],"field_course_code":[{"value":"BIOE 7890"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers analytical and\/or experimental work leading to a written report and a final short presentation by the end of the semester.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"512","title":[{"value":"BIOE 7990 - Thesis"}],"field_course_code":[{"value":"BIOE 7990"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers analytical, research, and\/or experimental work conducted under the auspices of the department. May be repeated once.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"10705","title":[{"value":"BIOE 5115 - Dynamical Systems in Biological Engineering"}],"field_course_code":[{"value":"BIOE 5115"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the theoretical analysis and modeling of dynamical systems in biology, ranging from molecular to population applications. Topics include difference and differential equation models, with basic theory including nondimensionalization, steady states, linearization, stability, eigenvalues, global behavior, singular perturbations, multistability, hysteresis, cooperativity, periodic solutions, excitable systems, bifurcations; and an introduction to spatial (PDE) models. Develops all concepts in the context of concrete biological applications, such as gene regulation; chemical reaction networks and stoichiometry; drug models and PK\/PD; receptor\/ligand interactions; synthetic constructs; action potential generation; enzymatic reactions; population interactions; epidemiology; epigenetic phenomena, including differentiation and transport; chemotaxis; and diffusion.","format":null}]},{"id":"489","title":[{"value":"BIOE 5250 - Design, Manufacture, and Evaluation of Medical Devices"}],"field_course_code":[{"value":"BIOE 5250"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers engineering design challenges intrinsic to the development of biomedical devices, including clinical evaluation, manufacture, and testing of medical devices and the constraints that FDA regulations place on these processes. Topics include quality systems, design control, cybersecurity concerns, the role of standards in global device regulation, and the design process. Students are asked to form teams and to carry out a semester-long conceptual design project to develop a design overview, design plan, design input specifications, and verification test procedures for a novel medical device.","format":null}]},{"id":"493","title":[{"value":"BIOE 5430 - Principles and Applications of Tissue Engineering"}],"field_course_code":[{"value":"BIOE 5430"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Applies the principles of biology and biomedical engineering to the creation of artificial organs for transplantation, basic research, or drug development. Requires integration of knowledge of organic chemistry, cell biology, genetics, mechanics, biomaterials, nanotechnology, and transport processes to create functional organs. Reviews basic cell culture techniques, structure function relationships, cellular communication, natural and artificial biomaterials, and the basic equations governing cell survival and tissue organization.","format":null}]},{"id":"10946","title":[{"value":"BIOE 5440 - The Cell as a Machine"}],"field_course_code":[{"value":"BIOE 5440"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the key roles that physical forces, the extracellular matrix, and cytoskeletal structure play in the development of human diseases. The cell is viewed as an engineering system that is capable of sensing physical cues from its environment, integrating such information from different mechano-sensors, and responding to changes in its external environment in a coherent manner. Uses mathematical and computational models to explain how cells sense and respond to physical cues.\n","format":null}]},{"id":"10947","title":[{"value":"BIOE 5450 - Stem Cell Engineering"}],"field_course_code":[{"value":"BIOE 5450"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers engineering principles and approaches in stem cell research and their application in tissue engineering and regenerative medicine. Emphasizes recent technology and engineering tools used to understand and manipulate stem cells. Topics covered include embryonic and adult stem cell biology fundamentals; quantitative modeling of stem cell signaling; genetic\/biochemical\/biophysical\/biomechanical\/biomaterials tools to control stem cell fate and differentiation; epigenetic editing and cellular reprogramming; engineering biomimetic and bioreactor environments to develop stem-cell-based therapies; and various applications in tissue development, diseases, and regeneration.","format":null}]},{"id":"496","title":[{"value":"BIOE 5820 - Biomaterials"}],"field_course_code":[{"value":"BIOE 5820"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers a broad overview of the field of biomaterials (materials used in medical devices that interact with living tissues). Introductory lectures cover biomaterials and their translation from the laboratory to the medical marketplace. Discusses important biomaterials terminology and concepts. Emphasizes material structure-property-function-testing relationships and discusses specific materials used in medical devices and drug delivery. Concludes with introductions to topics in the field, such as biomaterials-tissue interactions, tissue engineering, and regulatory requirements. Considers principles of device design as related to the selection and application of biomaterials.","format":null}]},{"id":"529","title":[{"value":"BIOL 5543 - Stem Cells and Regeneration"}],"field_course_code":[{"value":"BIOL 5543"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Explores the biological basis of embryonic, adult, and induced pluripotent stem cells toward an understanding of their roles in development, homeostasis, and regeneration, as well as their therapeutic potential. The study of stem cells is a rapidly advancing area in biology and biomedicine. Although the biological basis of stem cells is a major focus, the course aims to put this knowledge into a biomedical context.","format":null}]},{"id":"549","title":[{"value":"BIOL 6301 - Molecular Cell Biology"}],"field_course_code":[{"value":"BIOL 6301"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Integrates biochemistry and molecular biology in the cellular context. Emphasizes the organization and replication of genomes, the regulation of gene expression, the structure and function of organelles, and the mechanisms of signal transduction.","format":null}]},{"id":"4724","title":[{"value":"NNMD 5370 - Nanomedicine Research Techniques"}],"field_course_code":[{"value":"NNMD 5370"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers an in-depth look at laboratory methods and tools for studying nanomaterials used in biology and medicine. Includes hands-on sessions with experts in nanoparticle synthesis, electron microscopy, optical microscopy, magnetic resonance imaging, high-performance liquid chromatography, in vitro measurements of nanoparticle bioactivity and cytotoxicity, and in vivo measurements of treatment efficacy.","format":null}]},{"id":"4725","title":[{"value":"NNMD 5470 - Nano\/Biomedical Commercialization: Concept to Market"}],"field_course_code":[{"value":"NNMD 5470"}],"field_credits":[{"value":"3.00"}],"field_credit_low":[{"value":"3.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers a comprehensive overview of the  commercialization process for nano- and  biomedical technologies. Discusses the key elements of a successful  business plan, including scientific innovation, market assessment, customer discovery,  intellectual property protection,  business modeling, and value extraction.  Also covers regulatory processes  and market-specific strategies for  raising capital.  Offers students an opportunity to gain entrepreneurship skills through the creation of a team business proposal. Students have opportunities to interact with guest entrepreneurs.","format":null}]}]}}]}},{"title":[{"value":"Biomechanics"}],"field_requirements":[{"value":"<h4>Required Coursework<\/h4>\r\n\r\n<p>A grade of C or higher is required.<\/p>\r\n\r\n<p>Complete two of the following courses<br \/>\r\n[course_table id=0]<\/p>\r\n\r\n<h4>Coursework Option<\/h4>\r\n\r\n<p>Complete 20 semester hours from the course list.<\/p>\r\n\r\n<h4>Project Option<\/h4>\r\n\r\n<p>[course_table id=1]<\/p>\r\n\r\n<p>Complete 16 semester hours from the course list.<\/p>\r\n\r\n<h4>Thesis Option<\/h4>\r\n\r\n<p>Complete the following (repeatable) course twice:<\/p>\r\n\r\n<p>[course_table id=2]<\/p>\r\n\r\n<p>Complete 12 semester hours from the course list.<\/p>\r\n\r\n<h4>Course List<\/h4>\r\n\r\n<p>[course_table id=3]<\/p>\r\n","format":"basic_html"}],"field_course_table":{"type":"eck","entities":[{"field_courses":{"type":"eck","entities":[{"id":"494","title":[{"value":"BIOE 5630 - Physiological Fluid Mechanics"}],"field_course_code":[{"value":"BIOE 5630"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Analyzes biofluids and their mechanics, including cardiovascular fluid mechanics. Examples are taken from biotechnology processes and physiologic applications, including the cardiovascular, respiratory, ocular, renal, musculoskeletal, and gastrointestinal systems. Topics include dimensional analysis, particle kinematics in Eulerian and Lagrangian reference frames, constitutive equations and Newtonian\/non-Newtonian biofluid models, flow and wave propagation in flexible tubes, and oscillatory and pulsatile flows.","format":null}]},{"id":"11031","title":[{"value":"BIOE 5640 - Computational Biomechanics"}],"field_course_code":[{"value":"BIOE 5640"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Identifies and reviews the fundamental conservation principles that govern structural mechanics and fluid dynamics in biological systems. Discusses the following numerical analysis techniques: parameter estimation, finite difference, numerical integration, and finite element methods. By combining conservation laws with numerical analyses techniques, develops approaches to describe the physiological function of various biological systems, allowing for a system of equations to be used to describe a biological problem and solve this system numerically to predict its behavior.","format":null}]},{"id":"6830","title":[{"value":"BIOE 5650 - Multiscale Biomechanics"}],"field_course_code":[{"value":"BIOE 5650"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Seeks to help students develop and apply scaling laws and continuum mechanics to biomechanical phenomena at different length scales starting from a single molecule, moving up to the cellular and tissue levels. Topics include structure of tissues and the molecular basis for macroscopic properties; chemical and electrical effects on mechanical behavior; cell mechanics, motility, and adhesion; biomembranes; biomolecular mechanics and molecular motors; and experimental methods for probing structures at the tissue, cellular, and molecular levels.","format":null}]},{"id":"4291","title":[{"value":"ME 5665 - Musculoskeletal Biomechanics"}],"field_course_code":[{"value":"ME 5665"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Using a three-part format, emphasizes the quantitative analysis of human musculoskeletal system statics and dynamics, including, in part I, gait analysis and estimation of the complex loads on human joint systems. Investigates how the form of connective tissue and bone is derived from function in part II, including a quantitative analysis of the material properties of bone, ligament, tendon, and cartilage. Working in groups in part III, students select and investigate a relevant, current topic in musculoskeletal biomechanics and present their findings to the class. Requires prior completion of an undergraduate course in biomechanics (Northeastern&#8217;s BIOE 2350 or equivalent). Permission of instructor required for undergraduate students.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"510","title":[{"value":"BIOE 7890 - Master&#8217;s Project"}],"field_course_code":[{"value":"BIOE 7890"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers analytical and\/or experimental work leading to a written report and a final short presentation by the end of the semester.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"512","title":[{"value":"BIOE 7990 - Thesis"}],"field_course_code":[{"value":"BIOE 7990"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers analytical, research, and\/or experimental work conducted under the auspices of the department. May be repeated once.","format":null}]}]}},{"field_courses":{"type":"eck","entities":[{"id":"10705","title":[{"value":"BIOE 5115 - Dynamical Systems in Biological Engineering"}],"field_course_code":[{"value":"BIOE 5115"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the theoretical analysis and modeling of dynamical systems in biology, ranging from molecular to population applications. Topics include difference and differential equation models, with basic theory including nondimensionalization, steady states, linearization, stability, eigenvalues, global behavior, singular perturbations, multistability, hysteresis, cooperativity, periodic solutions, excitable systems, bifurcations; and an introduction to spatial (PDE) models. Develops all concepts in the context of concrete biological applications, such as gene regulation; chemical reaction networks and stoichiometry; drug models and PK\/PD; receptor\/ligand interactions; synthetic constructs; action potential generation; enzymatic reactions; population interactions; epidemiology; epigenetic phenomena, including differentiation and transport; chemotaxis; and diffusion.","format":null}]},{"id":"10946","title":[{"value":"BIOE 5440 - The Cell as a Machine"}],"field_course_code":[{"value":"BIOE 5440"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Introduces the key roles that physical forces, the extracellular matrix, and cytoskeletal structure play in the development of human diseases. The cell is viewed as an engineering system that is capable of sensing physical cues from its environment, integrating such information from different mechano-sensors, and responding to changes in its external environment in a coherent manner. Uses mathematical and computational models to explain how cells sense and respond to physical cues.\n","format":null}]},{"id":"543","title":[{"value":"BIOL 5601 - Multidisciplinary Approaches in Motor Control"}],"field_course_code":[{"value":"BIOL 5601"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Studies the field of human motor control, or motor neuroscience. Offers students an opportunity to obtain a fundamental understanding of the processes underlying the acquisition and control of sensorimotor behavior. The systems approach connects a variety of disciplines ranging from neurophysiology, to engineering, to neurorehabilitation. Reviews a selection of approaches with emphasis on motor learning. Focuses on early behavioral approaches, more recent neurophysiological and imaging approaches, and rehabilitation. Discusses selected representative papers, including seminal historical papers and more recent studies reflecting the current discussion in the field.","format":null}]},{"id":"494","title":[{"value":"BIOE 5630 - Physiological Fluid Mechanics"}],"field_course_code":[{"value":"BIOE 5630"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Analyzes biofluids and their mechanics, including cardiovascular fluid mechanics. Examples are taken from biotechnology processes and physiologic applications, including the cardiovascular, respiratory, ocular, renal, musculoskeletal, and gastrointestinal systems. Topics include dimensional analysis, particle kinematics in Eulerian and Lagrangian reference frames, constitutive equations and Newtonian\/non-Newtonian biofluid models, flow and wave propagation in flexible tubes, and oscillatory and pulsatile flows.","format":null}]},{"id":"11031","title":[{"value":"BIOE 5640 - Computational Biomechanics"}],"field_course_code":[{"value":"BIOE 5640"}],"field_credits":[{"value":"0.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Identifies and reviews the fundamental conservation principles that govern structural mechanics and fluid dynamics in biological systems. Discusses the following numerical analysis techniques: parameter estimation, finite difference, numerical integration, and finite element methods. By combining conservation laws with numerical analyses techniques, develops approaches to describe the physiological function of various biological systems, allowing for a system of equations to be used to describe a biological problem and solve this system numerically to predict its behavior.","format":null}]},{"id":"6830","title":[{"value":"BIOE 5650 - Multiscale Biomechanics"}],"field_course_code":[{"value":"BIOE 5650"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Seeks to help students develop and apply scaling laws and continuum mechanics to biomechanical phenomena at different length scales starting from a single molecule, moving up to the cellular and tissue levels. Topics include structure of tissues and the molecular basis for macroscopic properties; chemical and electrical effects on mechanical behavior; cell mechanics, motility, and adhesion; biomembranes; biomolecular mechanics and molecular motors; and experimental methods for probing structures at the tissue, cellular, and molecular levels.","format":null}]},{"id":"496","title":[{"value":"BIOE 5820 - Biomaterials"}],"field_course_code":[{"value":"BIOE 5820"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers a broad overview of the field of biomaterials (materials used in medical devices that interact with living tissues). Introductory lectures cover biomaterials and their translation from the laboratory to the medical marketplace. Discusses important biomaterials terminology and concepts. Emphasizes material structure-property-function-testing relationships and discusses specific materials used in medical devices and drug delivery. Concludes with introductions to topics in the field, such as biomaterials-tissue interactions, tissue engineering, and regulatory requirements. Considers principles of device design as related to the selection and application of biomaterials.","format":null}]},{"id":"506","title":[{"value":"BIOE 7300 - Special Topics in Biomechanics"}],"field_course_code":[{"value":"BIOE 7300"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Offers various topics of interest in biomechanics for advanced study depending upon the interests of the faculty and students. May be repeated up to two times.","format":null}]},{"id":"2133","title":[{"value":"EECE 7200 - Linear Systems Analysis"}],"field_course_code":[{"value":"EECE 7200"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers fundamental algebraic concepts and algebraic structures. Topics include linear operators and their representations; matrices, algebraic equations, equivalence, and similarity transformations; introduction to the state-variable theory of continuous and discrete linear systems; standard canonical representations, the concept of state, and the representation of interconnected systems, linear spaces, the state equations, and their solution; stability; and introduction to the general control problem in terms of controllability and observability.","format":null}]},{"id":"2136","title":[{"value":"EECE 7203 - Complex Variable Theory and Differential Equations"}],"field_course_code":[{"value":"EECE 7203"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Comprises the theory of functions of a complex variable. Covers Cauchy&#8217;s integral and related theorems, Taylor and Laurent series, analytic continuation, and multivalued functions. Considers special functions of mathematical physics using generating functions, Taylor and Laurent expansions, and various integral representations. Reviews applications of complex variable theory drawn from optics and electromagnetic theory and from digital signal processing and digital communications. Focuses on the theory of ordinary and partial differential equations of mathematical physics. Develops series solutions of ordinary differential equations of second order using the tools of complex variable theory. Covers Sturm-Liouville theory and uses it to develop eigen function and Green function solutions of homogeneous and inhomogeneous partial differential equations. Requires knowledge of undergraduate advanced calculus.","format":null}]},{"id":"4287","title":[{"value":"ME 5650 - Advanced Mechanics of Materials"}],"field_course_code":[{"value":"ME 5650"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers stress, strain, and deformation analysis of simple structures including beams, plates, and shells. Topics include classical theory of circular and rectangular plates; combined effects of bending and in-plane forces; buckling of plates; effects of shear deformation and of large deflections; membrane theory of shells; analysis of cylindrical shells; introduction to energy methods with applications to beams, frames, and rings; Ritz method; and the concept of stability as applied to one and two degree-of-freedom systems buckling of bars, frames, and rings. Permission of instructor required for undergraduate students.","format":null}]},{"id":"4288","title":[{"value":"ME 5655 - Dynamics and Mechanical Vibration"}],"field_course_code":[{"value":"ME 5655"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers dynamic response of discrete and continuous media. Topics include work and energy, impulse and momentum, Lagrangian dynamics, free and forced response to periodic and transient excitations, vibration absorber, free and forced response of multiple degree-of-freedom systems with and without damping, method of modal analysis, vibrations of continuous media such as extensional, torsional, and bending vibrations of bars, and approximate methods of analysis. Permission of instructor required for undergraduate students.","format":null}]},{"id":"4289","title":[{"value":"ME 5657 - Finite Element Method"}],"field_course_code":[{"value":"ME 5657"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on numerical techniques for solving engineering problems. Topics include introduction to the finite element method; methods of approximations and variational methods; Rayleigh-Ritz method and Galerkin formulation; interpolation functions; truss, beam, plate, shell, and solid elements; stiffness matrix and assembly of element equations; application of finite element method in fluid and heat transfer problems; linear, nonlinear, and transient problems; numerical integration and methods of solving systems of equations for static and dynamic problems; and use of a finite element general-purpose commercial package. Permission of instructor required for undergraduate students.","format":null}]},{"id":"4290","title":[{"value":"ME 5659 - Control Systems Engineering"}],"field_course_code":[{"value":"ME 5659"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers concepts in design and control of dynamical systems. Topics include review of continuous-time system modeling and dynamic response; principles of feedback, classical and modern control analyses, and design techniques such as root locus, frequency response (e.g., Bode plots and Nyquist Criteria), and state-space feedback; dynamic analysis, design, and control of electromechanical systems; block diagram algebra or signal-flow graphs, effects of poles and zeros on system response characteristics; principles of controllability, observability, observer designs, and pole placement techniques; introduction to adaptive and learning control and digital implementation of control algorithms.","format":null}]},{"id":"4291","title":[{"value":"ME 5665 - Musculoskeletal Biomechanics"}],"field_course_code":[{"value":"ME 5665"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Using a three-part format, emphasizes the quantitative analysis of human musculoskeletal system statics and dynamics, including, in part I, gait analysis and estimation of the complex loads on human joint systems. Investigates how the form of connective tissue and bone is derived from function in part II, including a quantitative analysis of the material properties of bone, ligament, tendon, and cartilage. Working in groups in part III, students select and investigate a relevant, current topic in musculoskeletal biomechanics and present their findings to the class. Requires prior completion of an undergraduate course in biomechanics (Northeastern&#8217;s BIOE 2350 or equivalent). Permission of instructor required for undergraduate students.","format":null}]},{"id":"4307","title":[{"value":"ME 7210 - Elasticity and Plasticity"}],"field_course_code":[{"value":"ME 7210"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers stress and strain analysis in continuous media. Analyzes Cartesian tensors using indicial notation; stress and strain concepts; point stress and strain; relation to tensor concepts; equations of equilibrium and compatibility; constitutive laws for elastic, general, axisymmetric, plane stress, and plane strain formulations and solutions; the relation of elasticity to structural mechanics theories; physical basis of plastic\/inelastic deformation of solids; and constitutive descriptions of plasticity including yielding, hardening rules, Prandtl-Reuss constitutive laws, and viscoplasticity.","format":null}]},{"id":"4310","title":[{"value":"ME 7238 - Advanced Finite Element Method"}],"field_course_code":[{"value":"ME 7238"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Focuses on advanced techniques for solving engineering problems with the finite element method. Topics include review of finite element method; solution of linear and nonlinear algebraic problems; solution of dynamics problems; solution of contact problems using penalty and Lagrange multiplier methods; solution of nonlinear beams, plates, and shells; finite element formulations of solid continua including Lagrangian and updated Lagrangian formulations, material nonlinearities, and use of a commercially available finite element package.","format":null}]},{"id":"4312","title":[{"value":"ME 7245 - Fracture Mechanics and Failure Analysis"}],"field_course_code":[{"value":"ME 7245"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Explores the fundamentals of fracture and failure of materials. Includes Orwan and Griffith theory of fracture, energy release rate and stress intensity factor as fracture parameters, fracture toughness and its determination, crack growth resistance, R curve, crack opening displacement, J integral methodology, prediction of fatigue crack growth using fracture mechanics, test for measurement of fatigue crack growth parameters, optical fractography in failure analysis, overview of nonlinear fracture mechanics, probabilistic method for fracture prediction for ceramic materials with random populations of microscopic flaws, and application of fracture mechanics in failure analysis.","format":null}]},{"id":"4315","title":[{"value":"ME 7255 - Continuum Mechanics and Nonlinear FEM"}],"field_course_code":[{"value":"ME 7255"}],"field_credits":[{"value":"4.00"}],"field_credit_low":[{"value":"4.00"}],"field_credit_high":[],"field_credit_connector":[],"field_description":[{"value":"Covers the stresses, strains, and displacements in general continuous media. Topics include vector and tensor calculus; definitions of stress, strain, and deformation; kinematics of a continuous medium; material derivatives; rate of deformation tensor, finite strain, and deformation; Eulerian and Lagrangian formulations; geometric measures of strain; relative deformation gradient, rotation, and stretch tensors; compatibility conditions; general principles; conservation of mass; momentum principles; energy balance; constitutive theories of materials (i.e., heat conduction, fluid mechanics, elastic solids, nonlinear elasticity, inelastic deformation of solids); variational principles; introduction to the nonlinear finite element formulations for solids, such as nonlinearities in solid mechanics, governing equations (strong form and weak form), finite element approximation, Newton-Raphson method, Lagrangian finite elements (total and updated Lagrangian approaches), and solution procedure.","format":null}]}]}}]}}]}}]}}]},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}],"description":[{"value":"","format":null}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}],"description":[{"value":"","format":null}]},{"tid":"4","name":[{"value":"Part-Time"}],"description":[{"value":"","format":null}]}],"nids":["3","4"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"},"field_pan":{"entities":[],"nids":[],"type":"taxonomy"},"field_degree_type":{"entities":[{"tid":"38","name":[{"value":"Master's"}],"description":[{"value":"","format":null}]}],"nids":["38"],"type":"taxonomy"},"field_undergrad_degree_type":{"entities":[],"nids":[],"type":"taxonomy"},"field_area_of_study":{"entities":[{"tid":"48","name":[{"value":"Nursing & Healthcare"}],"description":[{"value":"","format":null}],"field_slug":[{"value":"nursing-healthcare"}]},{"tid":"55","name":[{"value":"Public Health & Public Policy"}],"description":[{"value":"","format":null}],"field_slug":[{"value":"public-health-policy"}]},{"tid":"35","name":[{"value":"Science and Mathematics"}],"description":[{"value":"","format":null}],"field_slug":[{"value":"science-math"}]},{"tid":"26","name":[{"value":"Engineering"}],"description":[{"value":"","format":null}],"field_slug":[{"value":"engineering"}]},{"tid":"67","name":[{"value":"Analytics"}],"description":[{"value":"","format":null}],"field_slug":[{"value":"analytics"}]}],"nids":["48","55","35","26","67"],"type":"taxonomy"},"field_study_options":{"entities":[{"tid":"40","name":[{"value":"Classroom"}],"description":[{"value":"","format":null}]}],"nids":["40"],"type":"taxonomy"},"field_entry_terms":{"entities":[{"tid":"77","name":[{"value":"Fall"}]}],"nids":["77"],"type":"taxonomy"},"field_program_family":{"type":"entity","entities":[{"title":[{"value":"Bioengineering"}],"field_college":{"type":"entity","entities":[{"id":"120","title":[{"value":"College of Engineering"}],"field_experiential_learning":[{"value":"<p>Northeastern combines rigorous academics with experiential learning and research to prepare students for real-world engineering challenges. The cooperative education program, also known as co-op,&nbsp;is one of the largest and most innovative in the world, and Northeastern is one of only a few that offers a co-op program for graduate students. Through this program, students gain professional industry experience in their field of interest as part of the academic curriculum while employed from four&nbsp;to eight months in a wide variety of organizations, from large companies to entrepreneurial startups.<br \/>\r\n&nbsp;<br \/>\r\nIn 2019, the Graduate School of Engineering placed nearly 1000 students in co-op positions. We have a team that prepares students for the cooperative education experience through resumé building, developing interview skills, and guiding professional development.<\/p>\r\n","format":"basic_html"}],"field_requirements":[{"value":"<ul>\r\n\t<li>Completed online&nbsp;application&nbsp;form<\/li>\r\n\t<li>$75 application fee<\/li>\r\n\t<li>Two letters of recommendation<\/li>\r\n\t<li>Transcripts from all institutions attended<\/li>\r\n\t<li>GRE is not required for terms starting during the 2021-2022 or the 2022-2023 academic years<\/li>\r\n\t<li>Statement of purpose<\/li>\r\n\t<li>Resumé<\/li>\r\n\t<li>TOEFL, IELTS, or Duolingo&nbsp;for international applicants<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_college_link":[{"value":"http:\/\/www.coe.neu.edu\/"}]}]},"program":{"entities":[{"id":"5258","title":[{"value":"Master of Science in Bioengineering"}]},{"id":"19055","title":[{"value":"Master of Science in Bioengineering - Portland "}]}]}}]},"field_hero_image":[{"target_id":"2567","alt":"","title":"","width":"480","height":"290","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2022-01\/iStock_000024400239XXLarge_0.jpeg"}],"field_hero_video_mp4":[],"field_hero_video_webm":[],"field_overview":[],"field_program_description_long":[{"value":"<p>The Master of Science in Bioengineering at the Roux Institute focuses on using engineering principles to model and understand complex biological systems in health and disease, using mathematical and computational tools applied to diverse experimental and clinical data. The program teaches in-demand skills in data and system science and how to apply them to emergent fields in bioengineering.<\/p>\r\n\r\n<p>Topics covered include probability theory, stochastic processes, statistical physics, statistical inference, dynamical and stochastic modeling, execution and analysis of quantitative experimentation, dynamical systems, machine learning, and control and information theory.<\/p>\r\n\r\n<p>These techniques are taught in the context of medical applications in cardiology, neurology, and critical care medicine, and biological applications such as gene regulation, differentiation and cancer, epigenetics, the microbiome, and memory and learning.<\/p>\r\n\r\n<h3>More Details<\/h3>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Program Objectives<\/h4>\r\n\r\n<p>Students will complete 32 semester hours, including a rigorous core curriculum in basic bioengineering science followed by completion of the chosen immersion track curriculum.<\/p>\r\n\r\n<p>The core curriculum focuses on the variety of topics needed for students to compete internationally within the bioengineering field. Concentrations allow students to closely affiliate with a group of faculty, led by Rai Winslow, whose research is clustered around precision medicine.<\/p>\r\n<\/div>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Unique Features<\/h4>\r\n\r\n<ul>\r\n\t<li>Learn computational medicine from its core theoretical principles to its practical application.<\/li>\r\n\t<li>Study the use of real-world clinical data sets to solve important health care problems.<\/li>\r\n\t<li>Receive real-world training on the applications of statistical modeling and engineering approaches to precision medicine.<\/li>\r\n\t<li>Gain the ability to pursue either a research or industry co-op in precision medicine.<\/li>\r\n<\/ul>\r\n<\/div>\r\n\r\n<div class=\"collapse wrapper\">\r\n<h4>Career Outlook<\/h4>\r\n\r\n<p>Biology has already become a computational discipline, and medicine is following. For someone to be relevant in the coming era of biomedicine, it’s necessary to understand how to formulate a wide range of biological systems models that relate phenotype to function in both health and disease.<\/p>\r\n\r\n<ul>\r\n\t<li>This is a rapidly growing sector of the engineering profession.<\/li>\r\n\t<li>Biomedical advances are increasingly dependent on quantitative approaches exemplified by our bioengineering program. Recent high-profile reports on the high rate of failures in artificial hips—along with the rising demand for more sophisticated and cost-effective medical equipment and procedures—only furthers the demand for biomedical engineers.<\/li>\r\n\t<li>The convergence of advanced materials, genome-wide informatics, and ever-expanding computational power is producing a strong foundation for the design and fabrication of biomedical devices. Single-cell technologies combined with additive manufacturing techniques make possible novel tissue-on-a-chip platforms for pharmaceutical testing.<\/li>\r\n<\/ul>\r\n<\/div>\r\n","format":"basic_html"}],"field_requirements":[{"value":"<ul>\r\n\t<li>Completed online application form<\/li>\r\n\t<li>$75 application fee<\/li>\r\n\t<li>Two letters of recommendation<\/li>\r\n\t<li>Transcripts from all institutions attended<\/li>\r\n\t<li>GRE is not required for terms starting during the 2021-2022 or the 2022-2023 academic years<\/li>\r\n\t<li>Undergraduate degree in engineering, physics, mathematics or other quantitative field<\/li>\r\n\t<li>Statement of purpose<\/li>\r\n\t<li>Resumé<\/li>\r\n\t<li>TOEFL, IELTS, or Duolingo for international applicants<br \/>\r\n\t&nbsp;<\/li>\r\n<\/ul>\r\n","format":"basic_html"}],"field_requirements_append":[{"value":"0"}],"field_marketo_form_one":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-1A-1B_MSBIOE-BION-Simple-POI-1A.html"}],"field_marketo_form_two":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-1A-1B_MSBIOE-BION-POI-Hidden-1B.html"}],"field_marketo_form_three":[{"value":"https:\/\/pages.northeastern.edu\/Grad-WEBS-Prog-Page-iFrames-2_MSBIOE-BION-No-POI-Form-2.html"}],"field_marketo_form_four":[{"value":"https:\/\/pages.northeastern.edu\/GRAD-WEBS-Prog-Page-iFrames-4_MSBIOE-BION-Find-Out-More-POI-Hidden.html"}],"field_program_experience":[],"field_testimonials":{"entities":[]},"field_faculty_overview":[],"field_students_overview":[],"field_duration":[{"value":"18-24 months"}],"field_accreditation_abbreviation":[],"field_related_program":{"type":"entity","entities":[]},"field_related_program_2":{"type":"entity","entities":[{"id":"18387","title":[{"value":"Master of Science in Biotechnology - Portland"}],"field_formatted_title":[{"value":"Biotechnology"}],"field_program_thumbnail":[{"target_id":"2379","alt":"Master of Science in Biotechnology Portland","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/Buildings_HighRes_001.jpg"}],"field_degree_type":{"entities":[{"tid":"38","name":[{"value":"Master's"}]}],"nids":["38"],"type":"taxonomy"},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}]},{"tid":"4","name":[{"value":"Part-Time"}]}],"nids":["3","4"],"type":"taxonomy"},"field_duration":[{"value":"2-3 years"}],"field_study_options":{"entities":[{"tid":"41","name":[{"value":"Hybrid"}]}],"nids":["41"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"}},{"id":"18385","title":[{"value":"Graduate Certificate in Biotechnology - Portland"}],"field_formatted_title":[{"value":"Biotechnology "}],"field_program_thumbnail":[{"target_id":"2381","alt":"Graduate Certificate in Biotechnology Portland ","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/Buildings_HighRes_002%20copy%202.jpg"}],"field_degree_type":{"entities":[{"tid":"39","name":[{"value":"Certificate"}]}],"nids":["39"],"type":"taxonomy"},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}]},{"tid":"4","name":[{"value":"Part-Time"}]}],"nids":["3","4"],"type":"taxonomy"},"field_duration":[{"value":"1 year"}],"field_study_options":{"entities":[{"tid":"41","name":[{"value":"Hybrid"}]}],"nids":["41"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"}},{"id":"18380","title":[{"value":"Master of Science in Bioinformatics – Portland"}],"field_formatted_title":[{"value":"Bioinformatics"}],"field_program_thumbnail":[{"target_id":"2349","alt":"Master of Science in Biotechnology","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/CERTG-in-Fundraising-thumb_0.jpg"}],"field_degree_type":{"entities":[{"tid":"38","name":[{"value":"Master's"}]}],"nids":["38"],"type":"taxonomy"},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}]},{"tid":"4","name":[{"value":"Part-Time"}]}],"nids":["3","4"],"type":"taxonomy"},"field_duration":[{"value":"2-3 years"}],"field_study_options":{"entities":[{"tid":"41","name":[{"value":"Hybrid"}]}],"nids":["41"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"}},{"id":"18383","title":[{"value":"Graduate Certificate in Bioinformatics – Portland"}],"field_formatted_title":[{"value":"Bioinformatics"}],"field_program_thumbnail":[{"target_id":"2355","alt":"Graduate Certificate in Bioinformatics","title":"","width":"100","height":"150","uri":"https:\/\/pim.northeastern.edu\/sites\/default\/files\/2020-06\/Bioinformatics-cert-Portland-thumb.jpg"}],"field_degree_type":{"entities":[{"tid":"39","name":[{"value":"Certificate"}]}],"nids":["39"],"type":"taxonomy"},"field_location":{"entities":[{"tid":"85","name":[{"value":"Portland"}]}],"nids":["85"],"type":"taxonomy"},"field_commitment":{"entities":[{"tid":"3","name":[{"value":"Full-Time"}]},{"tid":"4","name":[{"value":"Part-Time"}]}],"nids":["3","4"],"type":"taxonomy"},"field_duration":[{"value":"8-36 months"}],"field_study_options":{"entities":[{"tid":"41","name":[{"value":"Hybrid"}]}],"nids":["41"],"type":"taxonomy"},"field_align_program":{"entities":[],"nids":[],"type":"taxonomy"}}]},"field_finance_tuition_calc":[{"value":"{\"tuitionCalcOption\":\"tuitionPerCreditHours\",\"fields\":{\"costPerCreditHour\":\"1689.00\",\"creditHours\":\"32\"},\"tuitionCalcValue\":54048,\"tuitionCalcLabel\":\"Tuition\"}"}],"field_hide_tuition_costs":[{"value":"0"}],"field_finance_program_fees":[],"field_finance_aid":[],"field_finance_percent_aid":[],"field_finance_information":[],"field_finance_link":[],"field_finance_link_one_source":[{"value":"global"}],"field_finance_link_one_link":[],"field_finance_link_one_text":[],"field_finance_link_two_source":[{"value":"global"}],"field_finance_link_two_link":[],"field_finance_link_two_text":[],"field_admissions_deadline_source":[{"value":"college"}],"field_admissions_intro_text":[],"field_admissions_tables":{"type":"eck","entities":[]},"field_admissions_link_one_source":[{"value":"college"}],"field_admissions_link_one_link":[],"field_admissions_link_one_text":[],"field_admissions_link_two_source":[{"value":"college"}],"field_admissions_link_two_link":[],"field_admissions_link_two_text":[],"field_apply_text":[],"field_apply_link":[],"field_apply_link_source":[{"value":"college"}],"field_admissions_section_intro_text":{"value":"<p>A graduate degree or&nbsp;certificate from Northeastern—a top-50 university—can accelerate your career through rigorous academic coursework and hands-on professional experience in the area of your interest. Apply now—and take your career to the next level.<\/p>\r\n"},"field_admissions_deadlines":{"value":{"intro_text":"<p>Applications received after the stated deadline dates will be accepted and processed&nbsp;as quickly as possible; however it may not be possible to have a decision rendered in time for the applicant to begin taking classes for the desired term if admitted.<\/p>\r\n\r\n<p>Applications submitted by the referenced dates will receive full consideration for the referenced term. Applications received after the referenced dates will be considered on a case-by-case basis.<\/p>\r\n","tables":[{"title":"Fall Semester Entry","header":[null,null],"rows":[["Early Action","January 15"],["Final Deadline International Students outside the US","June 1"],["Final Deadline: International Students Inside the US","July 1 "],["Domestic applicants","August 1 "]]},{"title":"Spring Semester Entry","header":[null,null],"rows":[["International Students Outside the US","November 1"],["International Students Inside the US","December 1"],["Domestic Applicants","December 1"]]}]}},"field_admissions_links":{"value":{"one":{"url":"https:\/\/www.northeastern.edu\/graduate\/admissions-information\/how-to-apply\/applying-as-an-international-student\/","title":"Are You an International Student?","text":"Find out what additional documents are required to apply."},"two":{"url":"https:\/\/coe.northeastern.edu\/academics-experiential-learning\/graduate-school-of-engineering\/graduate-admissions\/","title":"Admissions Details","text":"Learn more about the College of Engineering admissions process, policies, and required materials."}}},"field_financial_links":{"value":{"one":{"url":"https:\/\/studentfinance.northeastern.edu\/#_ga=2.59552109.19549433.1506949601-148400310.1505504629","title":"Finance Your Education","text":"We offer a variety of resources, including scholarships and assistantships."},"two":{"url":"https:\/\/www.northeastern.edu\/graduate\/admissions-information\/how-to-apply\/the-process\/","title":"How to Apply","text":"Learn more about the application process and requirements."}}},"field_apply_link_transform":{"value":"https:\/\/app.applyyourself.com\/AYApplicantLogin\/fl_ApplicantConnectLogin.asp?id=neu-grad"},"field_requirements_transform":{"value":"<ul>\r\n\t<li>Completed online application form<\/li>\r\n\t<li>$75 application fee<\/li>\r\n\t<li>Two letters of recommendation<\/li>\r\n\t<li>Transcripts from all institutions attended<\/li>\r\n\t<li>GRE is not required for terms starting during the 2021-2022 or the 2022-2023 academic years<\/li>\r\n\t<li>Undergraduate degree in engineering, physics, mathematics or other quantitative field<\/li>\r\n\t<li>Statement of purpose<\/li>\r\n\t<li>Resumé<\/li>\r\n\t<li>TOEFL, IELTS, or Duolingo for international applicants<br \/>\r\n\t&nbsp;<\/li>\r\n<\/ul>\r\n"},"field_key_requirements_transform":{"value":""},"field_experiential_transform":{"value":"<p>Northeastern combines rigorous academics with experiential learning and research to prepare students for real-world engineering challenges. The cooperative education program, also known as co-op,&nbsp;is one of the largest and most innovative in the world, and Northeastern is one of only a few that offers a co-op program for graduate students. Through this program, students gain professional industry experience in their field of interest as part of the academic curriculum while employed from four&nbsp;to eight months in a wide variety of organizations, from large companies to entrepreneurial startups.<br \/>\r\n&nbsp;<br \/>\r\nIn 2019, the Graduate School of Engineering placed nearly 1000 students in co-op positions. We have a team that prepares students for the cooperative education experience through resumé building, developing interview skills, and guiding professional development.<\/p>\r\n"},"field_finance_blocks":{"value":[{"value":"<span class='bullet-currency'>$<\/span><span class='bullet-value'>54<\/span><span class='bullet-units'>K<\/span>","label":"Tuition","modal":"<p dir=\"ltr\"><strong>Estimated Total Tuition<\/strong><\/p>\r\n\r\n<p>This is an estimate based on the tuition rates for Academic Year 2021-2022&nbsp;and does not include any fees or other expenses. Some courses and labs have tuition rates that may increase or decrease total tuition. Tuition and fees are subject to revision by the president and Board of Trustees at any time. For more detailed information, please visit <a href=\"https:\/\/studentfinance.northeastern.edu\/billing-payments\/tuition-and-fees\/\">Student Financial Services<\/a>.<\/p>\r\n"}]},"field_faculty_section_intro_text":{"value":"<p>Our faculty represents a wide cross-section of professional practices and fields ranging from finance to education to biomedical science to management to the U.S. military. They serve as mentors and advisors and collaborate alongside students to solve the most pressing global challenges facing established and emerging markets.<\/p>\r\n"},"field_student_section_intro_text":{"value":"<p>By enrolling in Northeastern, you gain access to a network of more than 275,000 alumni and 3,350+ employer partners, including Fortune 500 companies, government agencies, and global nongovernmental organizations. Our current students and faculty across strategically located regional locations further foster a lifelong, global community of learning and mentoring.<\/p>\r\n"},"field_curriculum_disclaimer":{"value":"<h3>Industry-aligned courses for in-demand careers.<\/h3>\r\n\r\n<p><br \/>\r\nFor 100+ years, we’ve designed our programs with one thing in mind—your success. Explore the current program requirements and course descriptions, all designed to meet today’s industry needs and must-have skills.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n"}}